// sub4/pages/reservedAccChg/company.js
var app = getApp();
var that;

var encr = require('../../../utils/encrypt/encrypt'); //国密3段式加密
import Org from '../../../api/Org';

var aeskey = encr.key //随机数
Page({

  /**
   * 页面的初始数据
   */
  data: {
    biTypeListShow:false,
    e015:{},
    List:[
    // {txt:'是否授权经办',name:'issqjbSelect'},
    // {txt:'授权经办人姓名',name:'sqjbrmcSelect'},
    // {txt:'授权经办人证件种类',name:'sqjbrzjzlSelect'},
    // {txt:'授权经办人证件号',name:'sqjbrzjhmSelect'},
    {txt:'账户中文名',name:'zhzwmSelect'},
    {txt:'统一社会信用代码',name:'shxydmSelect'},
    {txt:'营业执照有效日期',name:'govinExpireDateSelect'},
    {txt:'有效日期',name:'yxrqSelect'},
    {txt:'执照注册地址',name:'liceAppAddrSelect'},
    {txt:'注册资金币种',name:'zczjbzSelect'},
    {txt:'注册资金',name:'regCptlSelect'},
    {txt:'行业类型',name:'industryTypeSelect'},
    {txt:'客户主营业务(经营范围)',name:'custMainBusnSelect'},
    {txt:'审批文号',name:'appCertNoSelect'},
    {txt:'审批文号有效期',name:'appCertExpireDateSelect'},
    {txt:'办公电话（办公地址类型）',name:'workTelSelect'},
    {txt:'邮政编码（办公地址类型）',name:'posrCdSelect'},
    {txt:'办公地址（办公地址类型）',name:'workAddrSelect'},
    {txt:'上级机构名称',name:'companyNameSelect'},
    {txt:'上级部门代码证',name:'leadCompanyNoSelect'},
    {txt:'法人代表名称',name:'legalNameSelect'},
    {txt:'法人代表证件类型',name:'legalCertTypeSelect'},
    {txt:'法人代表证件号码',name:'legalCertNoSelect'},
    {txt:'法定代表人证件有效期止',name:'reserve9Select'},
    {txt:'法定代表人证件有效期起',name:'dateSelect'},
    {txt:'法人代表电话号码',name:'legalPhoneNoSelect'},
    {txt:'财务主管',name:'financeMasterSelect'},
    {txt:'财务主管手机号',name:'financeTelSelect'},
    {txt:'账户标志',name:'flogTelSelect'},
    {txt:'账户性质',name:'typeTelSelect'},
    {txt:'财务主管证件号码',name:'financeZjhmSelect'},
    {txt:'财务主管证件类型',name:'financeZjzlSelect'},
    {txt:'执照批准机关',name:'zzpzjgSelect'},
    // {txt:'经营组织形式',name:'jyzzxs'},
    // {txt:'国别代码',name:'gbdm'},
    // {txt:'对公客户类型',name:'dgkhlx'},
    {txt:'大额查证信息',name:'deczxxSelect'},
    {txt:'联系人证件类型',name:'contactZjlxSelect'},
    {txt:'联系人证件号',name:'contactZjhmSelect'},
    {txt:'联系人证件有效期',name:'contactzjyxqSelect'},
    {txt:'联系人证件有效期止',name:'contactzjyxqendSelect'},
    {txt:'联系人姓名',name:'contactNameSelect'},
    {txt:'联系人电话',name:'contactPhoneNoSelect'},
    {txt:'联系人手机号码',name:'contactMobileNoSelect'},
    {txt:'大额查证联系人1姓名',name:'deczlxrxm1Select'},
    {txt:'证件种类1',name:'zjzl1Select'},
    {txt:'证件号1',name:'zjh1Select'},
    {txt:'联系电话1',name:'lxdh1Select'},
    {txt:'证件有效期1',name:'zjyxq1Select'},
    // {txt:'证件有效期止',name:'deczzjyxqend1Select'},
    {txt:'大额查证联系人2姓名',name:'deczlxrxm2Select'},
    {txt:'证件种类2',name:'zjzl2Select'},
    {txt:'证件号2',name:'zjh2Select'},
    {txt:'联系电话2',name:'lxdh2Select'},
    {txt:'证件有效期2',name:'zjyxq2Select'},
    // {txt:'证件有效期止',name:'deczzjyxqend2Select'},
    // {txt:'大额查证联系人3姓名',name:'deczlxrxm3Select'},
    // {txt:'证件种类3',name:'zjzl3Select'},
    // {txt:'证件号',name:'zjh3Select'},
    // {txt:'联系电话3',name:'lxdh3Select'},
    // {txt:'证件有效期3',name:'zjyxq3Select'},
    // {txt:'证件有效期止',name:'deczzjyxqend3Select'},
    // {txt:'大额查证联系人4姓名',name:'deczlxrxm4Select'},
    // {txt:'证件种类4',name:'zjzl4Select'},
    // {txt:'证件号4',name:'zjh4Select'},
    // {txt:'联系电话4',name:'lxdh4Select'},
    // {txt:'证件有效期4',name:'zjyxq4Select'},
    // {txt:'证件有效期止',name:'deczzjyxqend4Select'},
    {txt:'对账联系人姓名',name:'dzlxrNameSelect'},
    {txt:'对账联系人手机',name:'dzlxrPhoneSelect'},
    {txt:'对账联系人地址',name:'dzlxrAddressSelect'},
    {txt:'对账联系人邮编',name:'dzlxrCodeSelect'},
    {txt:'上级机构基本存款账户核准号',name:'zhbzhSelect'},
    {txt:'上级机构负责人姓名',name:'fzrmcSelect'},
    {txt:'上级机构负责人证件种类',name:'fzrzjzlSelect'},
    {txt:'上级机构负责人证件号码',name:'fzrzjhSelect'}

  ],
    biTypeList: [
      { id: "01", text: "人民币" },
      { id: "12", text: "英镑" },
      { id: "13", text: "港币" },
      { id: "14", text: "美元" },
      { id: "15", text: "瑞士法郎" },
      { id: "16", text: "德国马克" },
      { id: "17", text: "法国法郎" },
      { id: "18", text: "新加坡元" },
      { id: "20", text: "荷兰盾" },
      { id: "21", text: "瑞士克朗" },
      { id: "22", text: "丹麦克朗" },
      { id: "23", text: "挪威克朗" },
      { id: "24", text: "奥地利先令" },
      { id: "25", text: "比利时法郎" },
      { id: "26", text: "意大利里拉" },
      { id: "27", text: "日元" },
      { id: "28", text: "加拿大元" },
      { id: "29", text: "澳大利亚元" },
      { id: "31", text: "比塞塔" },
      { id: "32", text: "马来西亚林吉特" },
      { id: "33", text: "欧洲货币单位" },
      { id: "42", text: "芬兰马克" },
      { id: "81", text: "澳门元" },
      { id: "84", text: "泰国铢" },
      { id: "87", text: "新西兰元" },
      { id: "95", text: "清算瑞士法郎" },
      { id: "96", text: "欧元" },
    ],
    preffixUrl: app.globalData.CDNURL,
    checked: false,
    showOver: false,
    validDate: '请选择',
    flagSelShow:false,
    p4:'',
    p5:'',
    p6:'',
    p7:'',
    validdateSelShow: false,
    validDateColumns: ['长期', '固定有效期', '无有效期'],
    accountColumns:['一般存款账户（不涉外）','一般存款账户（涉外）','一般存款账户（境外）','验资临时户','临时机构临时户','非临时机构临时户','预算单位专用户','非预算单位专用户（不涉外）','非预算单位专用户（涉外）','非预算单位专用户（境外）'],
    flagColumns:['基本账户','一般存款账户','临时存款账户','专用存款账户','结算账户','资本金','贷款','外债','其他',],
    allAccountType:{
      '基本账户':[
        '基本存款账户'
      ],
      '一般存款账户':[
        '一般存款账户（不涉外）','一般存款账户（涉外）','一般存款账户（境外）'
      ],
      '临时存款账户':[
        '验资临时户','临时机构临时户','非临时机构临时户',
      ],
      '专用存款账户':[
        '预算单位专用户','非预算单位专用户（不涉外）','非预算单位专用户（涉外）','非预算单位专用户（境外）'
      ],

    },
    accountType:{
      '基本账户':'0',
      ' 一般存款账户':'1',
      '临时存款账户':'2',
      '专用存款账户':'3',
      '结算账户':'4',
      '资本金':'5',
      '贷款':'6',
      '外债':'7',
      '其他':'8',
      '一般存款账户（不涉外）':'10',
      '一般存款账户（涉外）':'11',
      '一般存款账户（境外）':'12',
      '验资临时户':'21',
      '临时机构临时户':'22',
      '非临时机构临时户':'23',
      '预算单位专用户':'31',
      '非预算单位专用户（不涉外）':'32',
      '非预算单位专用户（涉外）':'33',
      '非预算单位专用户（境外）':'34',  
      '基本存款账户':'00',  
    },
    selectId1: '',
    wdh:'',
    info: {
      remark1:0,
      remark2:'',
      remark3:'',
      remark4:'',
    },
    selectId2: '',
    selectId3: '',
    selectId4: '',
    selectTxt: '请选择',
    idCardSelShow: false,
    dateSel: '',
    dateSelShow: false,
    dateSelType:'',
    accountSelShow:false,
    currentDate: new Date().getTime(),
    minDate: new Date(1949, 10, 1).getTime(),
    maxDate: new Date(2050, 10, 1).getTime(),
    formatter(type, value) {
      if (type === 'year') {
        return `${value}`;
      }
      if (type === 'month') {
        return `${value}`;
      }

      if (type === 'day') {
        return `${value}`;
      }
      return value;
    },
    selectId: {
      text: '请选择'
    },
    dic: [{
        txt: "种子种苗培育活动",
        id: "A0511"
      },
      {
        txt: "农业机械活动",
        id: "A0512"
      },
      {
        txt: "灌溉活动",
        id: "A0513"
      },
      {
        txt: "农产品初加工活动",
        id: "A0514"
      },
      {
        txt: "农作物病虫害防治活动",
        id: "A0515"
      },
      {
        txt: "其他农业专业及辅助性活动",
        id: "A0519"
      },
      {
        txt: "林业有害生物防治活动",
        id: "A0521"
      },
      {
        txt: "森林防火服务活动",
        id: "A0522"
      },
      {
        txt: "林产品初级加工活动",
        id: "A0523"
      },
      {
        txt: "其他林业专业及辅助性活动",
        id: "A0529"
      },
      {
        txt: "畜牧良种繁殖活动",
        id: "A0531"
      },
      {
        txt: "畜禽粪污处理活动",
        id: "A0532"
      },
      {
        txt: "其他畜牧专业及辅助性活动",
        id: "A0539"
      },
      {
        txt: "鱼苗及鱼种场活动",
        id: "A0541"
      },
      {
        txt: "其他渔业专业及辅助性活动",
        id: "A0549"
      },
      {
        txt: "稻谷种植",
        id: "A0111"
      },
      {
        txt: "小麦种植",
        id: "A0112"
      },
      {
        txt: "玉米种植",
        id: "A0113"
      },
      {
        txt: "其他谷物种植",
        id: "A0119"
      },
      {
        txt: "豆类种植",
        id: "A0121"
      },
      {
        txt: "油料种植",
        id: "A0122"
      },
      {
        txt: "薯类种植",
        id: "A0123"
      },
      {
        txt: "棉花种植",
        id: "A0131"
      },
      {
        txt: "麻类种植",
        id: "A0132"
      },
      {
        txt: "糖料种植",
        id: "A0133"
      },
      {
        txt: "烟草种植",
        id: "A0134"
      },
      {
        txt: "蔬菜种植",
        id: "A0141"
      },
      {
        txt: "食用菌种植",
        id: "A0142"
      },
      {
        txt: "花卉种植",
        id: "A0143"
      },
      {
        txt: "其他园艺作物种植",
        id: "A0149"
      },
      {
        txt: "仁果类和核果类水果种植",
        id: "A0151"
      },
      {
        txt: "葡萄种植",
        id: "A0152"
      },
      {
        txt: "柑橘类种植",
        id: "A0153"
      },
      {
        txt: "香蕉等亚热带水果种植",
        id: "A0154"
      },
      {
        txt: "其他水果种植",
        id: "A0159"
      },
      {
        txt: "坚果种植",
        id: "A0161"
      },
      {
        txt: "含油果种植",
        id: "A0162"
      },
      {
        txt: "香料作物种植",
        id: "A0163"
      },
      {
        txt: "茶叶种植",
        id: "A0164"
      },
      {
        txt: "其他饮料作物种植",
        id: "A0169"
      },
      {
        txt: "中草药种植",
        id: "A0171"
      },
      {
        txt: "其他中药材种植",
        id: "A0179"
      },
      {
        txt: "草种植",
        id: "A0181"
      },
      {
        txt: "天然草原割草",
        id: "A0182"
      },
      {
        txt: "其他农业",
        id: "A0190"
      },
      {
        txt: "林木育种",
        id: "A0211"
      },
      {
        txt: "林木育苗",
        id: "A0212"
      },
      {
        txt: "造林和更新",
        id: "A0220"
      },
      {
        txt: "森林经营和管护",
        id: "A0231"
      },
      {
        txt: "森林改培",
        id: "A0232"
      },
      {
        txt: "木材采运",
        id: "A0241"
      },
      {
        txt: "竹材采运",
        id: "A0242"
      },
      {
        txt: "木竹材林产品采集",
        id: "A0251"
      },
      {
        txt: "非木竹材林产品采集",
        id: "A0252"
      },
      {
        txt: "牛的饲养",
        id: "A0311"
      },
      {
        txt: "马的饲养",
        id: "A0312"
      },
      {
        txt: "猪的饲养",
        id: "A0313"
      },
      {
        txt: "羊的饲养",
        id: "A0314"
      },
      {
        txt: "骆驼饲养",
        id: "A0315"
      },
      {
        txt: "其他牲畜饲养",
        id: "A0319"
      },
      {
        txt: "鸡的饲养",
        id: "A0321"
      },
      {
        txt: "鸭的饲养",
        id: "A0322"
      },
      {
        txt: "鹅的饲养",
        id: "A0323"
      },
      {
        txt: "其他家禽饲养",
        id: "A0329"
      },
      {
        txt: "狩猎和捕捉动物",
        id: "A0330"
      },
      {
        txt: "兔的饲养",
        id: "A0391"
      },
      {
        txt: "蜜蜂饲养",
        id: "A0392"
      },
      {
        txt: "其他未列明畜牧业",
        id: "A0399"
      },
      {
        txt: "海水养殖",
        id: "A0411"
      },
      {
        txt: "内陆养殖",
        id: "A0412"
      },
      {
        txt: "海水捕捞",
        id: "A0421"
      },
      {
        txt: "内陆捕捞",
        id: "A0422"
      },
      {
        txt: "烟煤和无烟煤开采洗选",
        id: "B0610"
      },
      {
        txt: "褐煤开采洗选",
        id: "B0620"
      },
      {
        txt: "其他煤炭采选",
        id: "B0690"
      },
      {
        txt: "陆地石油开采",
        id: "B0711"
      },
      {
        txt: "海洋石油开采",
        id: "B0712"
      },
      {
        txt: "陆地天然气开采",
        id: "B0721"
      },
      {
        txt: "海洋天然气及可燃冰开采",
        id: "B0722"
      },
      {
        txt: "铁矿采选",
        id: "B0810"
      },
      {
        txt: "锰矿、铬矿采选",
        id: "B0820"
      },
      {
        txt: "其他黑色金属矿采选",
        id: "B0890"
      },
      {
        txt: "铜矿采选",
        id: "B0911"
      },
      {
        txt: "铅锌矿采选",
        id: "B0912"
      },
      {
        txt: "镍钴矿采选",
        id: "B0913"
      },
      {
        txt: "锡矿采选",
        id: "B0914"
      },
      {
        txt: "锑矿采选",
        id: "B0915"
      },
      {
        txt: "铝矿采选",
        id: "B0916"
      },
      {
        txt: "镁矿采选",
        id: "B0917"
      },
      {
        txt: "其他常用有色金属矿采选",
        id: "B0919"
      },
      {
        txt: "金矿采选",
        id: "B0921"
      },
      {
        txt: "银矿采选",
        id: "B0922"
      },
      {
        txt: "其他贵金属矿采选",
        id: "B0929"
      },
      {
        txt: "钨钼矿采选",
        id: "B0931"
      },
      {
        txt: "稀土金属矿采选",
        id: "B0932"
      },
      {
        txt: "放射性金属矿采选",
        id: "B0933"
      },
      {
        txt: "其他稀有金属矿采选",
        id: "B0939"
      },
      {
        txt: "石灰石、石膏开采",
        id: "B1011"
      },
      {
        txt: "建筑装饰用石开采",
        id: "B1012"
      },
      {
        txt: "耐火土石开采",
        id: "B1013"
      },
      {
        txt: "粘土及其他土砂石开采",
        id: "B1019"
      },
      {
        txt: "化学矿开采",
        id: "B1020"
      },
      {
        txt: "采盐",
        id: "B1030"
      },
      {
        txt: "石棉、云母矿采选",
        id: "B1091"
      },
      {
        txt: "石墨、滑石采选",
        id: "B1092"
      },
      {
        txt: "宝石、玉石采选",
        id: "B1093"
      },
      {
        txt: "其他未列明非金属矿采选",
        id: "B1099"
      },
      {
        txt: "煤炭开采和洗选辅助活动",
        id: "B1110"
      },
      {
        txt: "石油和天然气开采辅助活动",
        id: "B1120"
      },
      {
        txt: "其他开采辅助活动",
        id: "B1190"
      },
      {
        txt: "其他采矿业",
        id: "B1200"
      },
      {
        txt: "汽柴油车整车制造",
        id: "C3611"
      },
      {
        txt: "新能源车整车制造",
        id: "C3612"
      },
      {
        txt: "汽车用发动机制造",
        id: "C3620"
      },
      {
        txt: "改装汽车制造",
        id: "C3630"
      },
      {
        txt: "低速汽车制造",
        id: "C3640"
      },
      {
        txt: "电车制造",
        id: "C3650"
      },
      {
        txt: "汽车车身、挂车制造",
        id: "C3660"
      },
      {
        txt: "汽车零部件及配件制造",
        id: "C3670"
      },
      {
        txt: "高铁车组制造",
        id: "C3711"
      },
      {
        txt: "铁路机车车辆制造",
        id: "C3712"
      },
      {
        txt: "窄轨机车车辆制造",
        id: "C3713"
      },
      {
        txt: "高铁设备、配件制造",
        id: "C3714"
      },
      {
        txt: "铁路机车车辆配件制造",
        id: "C3715"
      },
      {
        txt: "铁路专用设备及器材、配件制造",
        id: "C3716"
      },
      {
        txt: "其他铁路运输设备制造",
        id: "C3719"
      },
      {
        txt: "城市轨道交通设备制造",
        id: "C3720"
      },
      {
        txt: "金属船舶制造",
        id: "C3731"
      },
      {
        txt: "非金属船舶制造",
        id: "C3732"
      },
      {
        txt: "娱乐船和运动船制造",
        id: "C3733"
      },
      {
        txt: "船用配套设备制造",
        id: "C3734"
      },
      {
        txt: "船舶改装",
        id: "C3735"
      },
      {
        txt: "船舶拆除",
        id: "C3736"
      },
      {
        txt: "海洋工程装备制造",
        id: "C3737"
      },
      {
        txt: "航标器材及其他相关装置制造",
        id: "C3739"
      },
      {
        txt: "飞机制造",
        id: "C3741"
      },
      {
        txt: "航天器及运载火箭制造",
        id: "C3742"
      },
      {
        txt: "航天相关设备制造",
        id: "C3743"
      },
      {
        txt: "航空相关设备制造",
        id: "C3744"
      },
      {
        txt: "其他航空航天器制造",
        id: "C3749"
      },
      {
        txt: "摩托车整车制造",
        id: "C3751"
      },
      {
        txt: "摩托车零部件及配件制造",
        id: "C3752"
      },
      {
        txt: "自行车制造",
        id: "C3761"
      },
      {
        txt: "残疾人座车制造",
        id: "C3762"
      },
      {
        txt: "助动车制造",
        id: "C3770"
      },
      {
        txt: "非公路休闲车及零配件制造",
        id: "C3780"
      },
      {
        txt: "潜水装备制造",
        id: "C3791"
      },
      {
        txt: "水下救捞装备制造",
        id: "C3792"
      },
      {
        txt: "其他未列明运输设备制造",
        id: "C3799"
      },
      {
        txt: "发电机及发电机组制造",
        id: "C3811"
      },
      {
        txt: "电动机制造",
        id: "C3812"
      },
      {
        txt: "微特电机及组件制造",
        id: "C3813"
      },
      {
        txt: "其他电机制造",
        id: "C3819"
      },
      {
        txt: "变压器、整流器和电感器制造",
        id: "C3821"
      },
      {
        txt: "电容器及其配套设备制造",
        id: "C3822"
      },
      {
        txt: "配电开关控制设备制造",
        id: "C3823"
      },
      {
        txt: "电力电子元器件制造",
        id: "C3824"
      },
      {
        txt: "光伏设备及元器件制造",
        id: "C3825"
      },
      {
        txt: "其他输配电及控制设备制造",
        id: "C3829"
      },
      {
        txt: "电线、电缆制造",
        id: "C3831"
      },
      {
        txt: "光纤制造",
        id: "C3832"
      },
      {
        txt: "光缆制造",
        id: "C3833"
      },
      {
        txt: "绝缘制品制造",
        id: "C3834"
      },
      {
        txt: "其他电工器材制造",
        id: "C3839"
      },
      {
        txt: "锂离子电池制造",
        id: "C3841"
      },
      {
        txt: "镍氢电池制造",
        id: "C3842"
      },
      {
        txt: "铅蓄电池制造",
        id: "C3843"
      },
      {
        txt: "锌锰电池制造",
        id: "C3844"
      },
      {
        txt: "其他电池制造",
        id: "C3849"
      },
      {
        txt: "家用制冷电器具制造",
        id: "C3851"
      },
      {
        txt: "家用空气调节器制造",
        id: "C3852"
      },
      {
        txt: "家用通风电器具制造",
        id: "C3853"
      },
      {
        txt: "家用厨房电器具制造",
        id: "C3854"
      },
      {
        txt: "家用清洁卫生电器具制造",
        id: "C3855"
      },
      {
        txt: "家用美容、保健护理电器具制造",
        id: "C3856"
      },
      {
        txt: "家用电力器具专用配件制造",
        id: "C3857"
      },
      {
        txt: "其他家用电力器具制造",
        id: "C3859"
      },
      {
        txt: "燃气及类似能源家用器具制造",
        id: "C3861"
      },
      {
        txt: "太阳能器具制造 ",
        id: "C3862"
      },
      {
        txt: "其他非电力家用器具制造",
        id: "C3869"
      },
      {
        txt: "电光源制造",
        id: "C3871"
      },
      {
        txt: "照明灯具制造",
        id: "C3872"
      },
      {
        txt: "舞台及场地用灯制造",
        id: "C3873"
      },
      {
        txt: "智能照明器具制造",
        id: "C3874"
      },
      {
        txt: "灯用电器附件及其他照明器具制造",
        id: "C3879"
      },
      {
        txt: "电气信号设备装置制造",
        id: "C3891"
      },
      {
        txt: "其他未列明电气机械及器材制造",
        id: "C3899"
      },
      {
        txt: "计算机整机制造",
        id: "C3911"
      },
      {
        txt: "计算机零部件制造",
        id: "C3912"
      },
      {
        txt: "计算机外围设备制造",
        id: "C3913"
      },
      {
        txt: "工业控制计算机及系统制造",
        id: "C3914"
      },
      {
        txt: "信息安全设备制造",
        id: "C3915"
      },
      {
        txt: "其他计算机制造",
        id: "C3919"
      },
      {
        txt: "通信系统设备制造",
        id: "C3921"
      },
      {
        txt: "通信终端设备制造",
        id: "C3922"
      },
      {
        txt: "广播电视节目制作及发射设备制造",
        id: "C3931"
      },
      {
        txt: "广播电视接收设备制造",
        id: "C3932"
      },
      {
        txt: "广播电视专用配件制造",
        id: "C3933"
      },
      {
        txt: "专业音响设备制造",
        id: "C3934"
      },
      {
        txt: "应用电视设备及其他广播电视设备制造",
        id: "C3939"
      },
      {
        txt: "雷达及配套设备制造",
        id: "C3940"
      },
      {
        txt: "电视机制造",
        id: "C3951"
      },
      {
        txt: "音响设备制造",
        id: "C3952"
      },
      {
        txt: "影视录放设备制造",
        id: "C3953"
      },
      {
        txt: "可穿戴智能设备制造",
        id: "C3961"
      },
      {
        txt: "智能车载设备制造",
        id: "C3962"
      },
      {
        txt: "智能无人飞行器制造",
        id: "C3963"
      },
      {
        txt: "服务消费机器人制造",
        id: "C3964"
      },
      {
        txt: "其他智能消费设备制造",
        id: "C3969"
      },
      {
        txt: "电子真空器件制造",
        id: "C3971"
      },
      {
        txt: "半导体分立器件制造",
        id: "C3972"
      },
      {
        txt: "集成电路制造",
        id: "C3973"
      },
      {
        txt: "显示器件制造",
        id: "C3974"
      },
      {
        txt: "半导体照明器件制造",
        id: "C3975"
      },
      {
        txt: "光电子器件制造",
        id: "C3976"
      },
      {
        txt: "其他电子器件制造",
        id: "C3979"
      },
      {
        txt: "电阻电容电感元件制造",
        id: "C3981"
      },
      {
        txt: "电子电路制造",
        id: "C3982"
      },
      {
        txt: "敏感元件及传感器制造",
        id: "C3983"
      },
      {
        txt: "电声器件及零件制造",
        id: "C3984"
      },
      {
        txt: "电子专用材料制造",
        id: "C3985"
      },
      {
        txt: "其他电子元件制造",
        id: "C3989"
      },
      {
        txt: "其他电子设备制造",
        id: "C3990"
      },
      {
        txt: "医疗诊断、监护及治疗设备制造",
        id: "C3581"
      },
      {
        txt: "口腔科用设备及器具制造",
        id: "C3582"
      },
      {
        txt: "医疗实验室及医用消毒设备和器具制造",
        id: "C3583"
      },
      {
        txt: "医疗、外科及兽医用器械制造",
        id: "C3584"
      },
      {
        txt: "机械治疗及病房护理设备制造",
        id: "C3585"
      },
      {
        txt: "康复辅具制造",
        id: "C3586"
      },
      {
        txt: "眼镜制造",
        id: "C3587"
      },
      {
        txt: "其他医疗设备及器械制造",
        id: "C3589"
      },
      {
        txt: "环境保护专用设备制造",
        id: "C3591"
      },
      {
        txt: "地质勘查专用设备制造",
        id: "C3592"
      },
      {
        txt: "邮政专用机械及器材制造",
        id: "C3593"
      },
      {
        txt: "商业、饮食、服务专用设备制造",
        id: "C3594"
      },
      {
        txt: "社会公共安全设备及器材制造",
        id: "C3595"
      },
      {
        txt: "交通安全、管制及类似专用设备制造",
        id: "C3596"
      },
      {
        txt: "水资源专用机械制造",
        id: "C3597"
      },
      {
        txt: "其他专用设备制造",
        id: "C3599"
      },
      {
        txt: "矿山机械制造",
        id: "C3511"
      },
      {
        txt: "石油钻采专用设备制造",
        id: "C3512"
      },
      {
        txt: "深海石油钻探设备制造",
        id: "C3513"
      },
      {
        txt: "建筑工程用机械制造",
        id: "C3514"
      },
      {
        txt: "建筑材料生产专用机械制造",
        id: "C3515"
      },
      {
        txt: "冶金专用设备制造",
        id: "C3516"
      },
      {
        txt: "隧道施工专用机械制造",
        id: "C3517"
      },
      {
        txt: "炼油、化工生产专用设备制造",
        id: "C3521"
      },
      {
        txt: "橡胶加工专用设备制造",
        id: "C3522"
      },
      {
        txt: "塑料加工专用设备制造",
        id: "C3523"
      },
      {
        txt: "木材加工机械制造",
        id: "C3524"
      },
      {
        txt: "模具制造",
        id: "C3525"
      },
      {
        txt: "其他非金属加工专用设备制造",
        id: "C3529"
      },
      {
        txt: "食品、酒、饮料及茶生产专用设备制造",
        id: "C3531"
      },
      {
        txt: "农副食品加工专用设备制造",
        id: "C3532"
      },
      {
        txt: "烟草生产专用设备制造",
        id: "C3533"
      },
      {
        txt: "饲料生产专用设备制造",
        id: "C3534"
      },
      {
        txt: "制浆和造纸专用设备制造",
        id: "C3541"
      },
      {
        txt: "印刷专用设备制造",
        id: "C3542"
      },
      {
        txt: "日用化工专用设备制造",
        id: "C3543"
      },
      {
        txt: "制药专用设备制造",
        id: "C3544"
      },
      {
        txt: "照明器具生产专用设备制造",
        id: "C3545"
      },
      {
        txt: "玻璃、陶瓷和搪瓷制品生产专用设备制造",
        id: "C3546"
      },
      {
        txt: "其他日用品生产专用设备制造",
        id: "C3549"
      },
      {
        txt: "纺织专用设备制造",
        id: "C3551"
      },
      {
        txt: "皮革、毛皮及其制品加工专用设备制造",
        id: "C3552"
      },
      {
        txt: "缝制机械制造",
        id: "C3553"
      },
      {
        txt: "洗涤机械制造",
        id: "C3554"
      },
      {
        txt: "电工机械专用设备制造",
        id: "C3561"
      },
      {
        txt: "半导体器件专用设备制造",
        id: "C3562"
      },
      {
        txt: "电子元器件与机电组件设备制造",
        id: "C3563"
      },
      {
        txt: "其他电子专用设备制造",
        id: "C3569"
      },
      {
        txt: "渔业机械制造",
        id: "C3575"
      },
      {
        txt: "农林牧渔机械配件制造",
        id: "C3576"
      },
      {
        txt: "棉花加工机械制造",
        id: "C3577"
      },
      {
        txt: "其他农、林、牧、渔业机械制造",
        id: "C3579"
      },
      {
        txt: "拖拉机制造",
        id: "C3571"
      },
      {
        txt: "机械化农业及园艺机具制造",
        id: "C3572"
      },
      {
        txt: "营林及木竹采伐机械制造",
        id: "C3573"
      },
      {
        txt: "畜牧机械制造",
        id: "C3574"
      },
      {
        txt: "运动机织服装制造",
        id: "C1811"
      },
      {
        txt: "其他机织服装制造",
        id: "C1819"
      },
      {
        txt: "运动休闲针织服装制造",
        id: "C1821"
      },
      {
        txt: "其他针织或钩针编织服装制造",
        id: "C1829"
      },
      {
        txt: "服饰制造",
        id: "C1830"
      },
      {
        txt: "皮革鞣制加工",
        id: "C1910"
      },
      {
        txt: "皮革服装制造",
        id: "C1921"
      },
      {
        txt: "皮箱、包(袋)制造",
        id: "C1922"
      },
      {
        txt: "皮手套及皮装饰制品制造",
        id: "C1923"
      },
      {
        txt: "其他皮革制品制造",
        id: "C1929"
      },
      {
        txt: "毛皮鞣制加工",
        id: "C1931"
      },
      {
        txt: "毛皮服装加工",
        id: "C1932"
      },
      {
        txt: "其他毛皮制品加工",
        id: "C1939"
      },
      {
        txt: "羽毛(绒)加工",
        id: "C1941"
      },
      {
        txt: "羽毛(绒)制品加工",
        id: "C1942"
      },
      {
        txt: "纺织面料鞋制造",
        id: "C1951"
      },
      {
        txt: "皮鞋制造",
        id: "C1952"
      },
      {
        txt: "塑料鞋制造",
        id: "C1953"
      },
      {
        txt: "橡胶鞋制造",
        id: "C1954"
      },
      {
        txt: "其他制鞋业",
        id: "C1959"
      },
      {
        txt: "锯材加工",
        id: "C2011"
      },
      {
        txt: "木片加工",
        id: "C2012"
      },
      {
        txt: "单板加工",
        id: "C2013"
      },
      {
        txt: "其他木材加工",
        id: "C2019"
      },
      {
        txt: "胶合板制造",
        id: "C2021"
      },
      {
        txt: "纤维板制造",
        id: "C2022"
      },
      {
        txt: "刨花板制造",
        id: "C2023"
      },
      {
        txt: "其他人造板制造",
        id: "C2029"
      },
      {
        txt: "建筑用木料及木材组件加工",
        id: "C2031"
      },
      {
        txt: "木门窗制造",
        id: "C2032"
      },
      {
        txt: "木楼梯制造",
        id: "C2033"
      },
      {
        txt: "木地板制造",
        id: "C2034"
      },
      {
        txt: "木制容器制造",
        id: "C2035"
      },
      {
        txt: "软木制品及其他木制品制造",
        id: "C2039"
      },
      {
        txt: "竹制品制造",
        id: "C2041"
      },
      {
        txt: "藤制品制造",
        id: "C2042"
      },
      {
        txt: "棕制品制造",
        id: "C2043"
      },
      {
        txt: "草及其他制品制造",
        id: "C2049"
      },
      {
        txt: "木质家具制造",
        id: "C2110"
      },
      {
        txt: "竹、藤家具制造",
        id: "C2120"
      },
      {
        txt: "金属家具制造",
        id: "C2130"
      },
      {
        txt: "塑料家具制造",
        id: "C2140"
      },
      {
        txt: "其他家具制造",
        id: "C2190"
      },
      {
        txt: "木竹浆制造",
        id: "C2211"
      },
      {
        txt: "非木竹浆制造",
        id: "C2212"
      },
      {
        txt: "机制纸及纸板制造",
        id: "C2221"
      },
      {
        txt: "手工纸制造",
        id: "C2222"
      },
      {
        txt: "加工纸制造",
        id: "C2223"
      },
      {
        txt: "纸和纸板容器制造",
        id: "C2231"
      },
      {
        txt: "其他纸制品制造",
        id: "C2239"
      },
      {
        txt: "书、报刊印刷",
        id: "C2311"
      },
      {
        txt: "本册印制",
        id: "C2312"
      },
      {
        txt: "包装装潢及其他印刷",
        id: "C2319"
      },
      {
        txt: "装订及印刷相关服务",
        id: "C2320"
      },
      {
        txt: "记录媒介复制",
        id: "C2330"
      },
      {
        txt: "文具制造",
        id: "C2411"
      },
      {
        txt: "笔的制造",
        id: "C2412"
      },
      {
        txt: "教学用模型及教具制造",
        id: "C2413"
      },
      {
        txt: "墨水、墨汁制造",
        id: "C2414"
      },
      {
        txt: "其他文教办公用品制造",
        id: "C2419"
      },
      {
        txt: "中乐器制造",
        id: "C2421"
      },
      {
        txt: "西乐器制造",
        id: "C2422"
      },
      {
        txt: "电子乐器制造",
        id: "C2423"
      },
      {
        txt: "其他乐器及零件制造",
        id: "C2429"
      },
      {
        txt: "雕塑工艺品制造",
        id: "C2431"
      },
      {
        txt: "金属工艺品制造",
        id: "C2432"
      },
      {
        txt: "漆器工艺品制造",
        id: "C2433"
      },
      {
        txt: "花画工艺品制造",
        id: "C2434"
      },
      {
        txt: "天然植物纤维编织工艺品制造",
        id: "C2435"
      },
      {
        txt: "抽纱刺绣工艺品制造",
        id: "C2436"
      },
      {
        txt: "地毯、挂毯制造",
        id: "C2437"
      },
      {
        txt: "珠宝首饰及有关物品制造",
        id: "C2438"
      },
      {
        txt: "其他工艺美术及礼仪用品制造",
        id: "C2439"
      },
      {
        txt: "球类制造",
        id: "C2441"
      },
      {
        txt: "专项运动器材及配件制造",
        id: "C2442"
      },
      {
        txt: "健身器材制造",
        id: "C2443"
      },
      {
        txt: "运动防护用具制造",
        id: "C2444"
      },
      {
        txt: "其他体育用品制造",
        id: "C2449"
      },
      {
        txt: "电玩具制造",
        id: "C2451"
      },
      {
        txt: "塑胶玩具制造",
        id: "C2452"
      },
      {
        txt: "金属玩具制造",
        id: "C2453"
      },
      {
        txt: "弹射玩具制造",
        id: "C2454"
      },
      {
        txt: "娃娃玩具制造",
        id: "C2455"
      },
      {
        txt: "儿童乘骑玩耍的童车类产品制造",
        id: "C2456"
      },
      {
        txt: "其他玩具制造",
        id: "C2459"
      },
      {
        txt: "露天游乐场所游乐设备制造",
        id: "C2461"
      },
      {
        txt: "游艺用品及室内游艺器材制造",
        id: "C2462"
      },
      {
        txt: "其他娱乐用品制造",
        id: "C2469"
      },
      {
        txt: "原油加工及石油制品制造",
        id: "C2511"
      },
      {
        txt: "其他原油制造",
        id: "C2519"
      },
      {
        txt: "炼焦",
        id: "C2521"
      },
      {
        txt: "煤制合成气生产",
        id: "C2522"
      },
      {
        txt: "煤制液体燃料生产",
        id: "C2523"
      },
      {
        txt: "煤制品制造",
        id: "C2524"
      },
      {
        txt: "其他煤炭加工",
        id: "C2529"
      },
      {
        txt: "核燃料加工",
        id: "C2530"
      },
      {
        txt: "生物质液体燃料生产",
        id: "C2541"
      },
      {
        txt: "生物质致密成型燃料加工",
        id: "C2542"
      },
      {
        txt: "无机酸制造",
        id: "C2611"
      },
      {
        txt: "无机碱制造",
        id: "C2612"
      },
      {
        txt: "无机盐制造",
        id: "C2613"
      },
      {
        txt: "有机化学原料制造",
        id: "C2614"
      },
      {
        txt: "其他基础化学原料制造",
        id: "C2619"
      },
      {
        txt: "氮肥制造",
        id: "C2621"
      },
      {
        txt: "磷肥制造",
        id: "C2622"
      },
      {
        txt: "钾肥制造",
        id: "C2623"
      },
      {
        txt: "复混肥料制造",
        id: "C2624"
      },
      {
        txt: "有机肥料及微生物肥料制造",
        id: "C2625"
      },
      {
        txt: "其他肥料制造",
        id: "C2629"
      },
      {
        txt: "化学农药制造",
        id: "C2631"
      },
      {
        txt: "生物化学农药及微生物农药制造",
        id: "C2632"
      },
      {
        txt: "涂料制造",
        id: "C2641"
      },
      {
        txt: "油墨及类似产品制造",
        id: "C2642"
      },
      {
        txt: "工业颜料制造",
        id: "C2643"
      },
      {
        txt: "工艺美术颜料制造",
        id: "C2644"
      },
      {
        txt: "染料制造",
        id: "C2645"
      },
      {
        txt: "密封用填料及类似品制造",
        id: "C2646"
      },
      {
        txt: "初级形态塑料及合成树脂制造",
        id: "C2651"
      },
      {
        txt: "合成橡胶制造",
        id: "C2652"
      },
      {
        txt: "合成纤维单(聚合)体制造",
        id: "C2653"
      },
      {
        txt: "其他合成材料制造",
        id: "C2659"
      },
      {
        txt: "化学试剂和助剂制造",
        id: "C2661"
      },
      {
        txt: "专项化学用品制造",
        id: "C2662"
      },
      {
        txt: "林产化学产品制造",
        id: "C2663"
      },
      {
        txt: "文化用信息化学品制造",
        id: "C2664"
      },
      {
        txt: "医学生产用信息化学品制造",
        id: "C2665"
      },
      {
        txt: "环境污染处理专用药剂材料制造",
        id: "C2666"
      },
      {
        txt: "动物胶制造",
        id: "C2667"
      },
      {
        txt: "其他专用化学产品制造",
        id: "C2669"
      },
      {
        txt: "炸药及火工产品制造",
        id: "C2671"
      },
      {
        txt: "焰火、鞭炮产品制造",
        id: "C2672"
      },
      {
        txt: "肥皂及洗涤剂制造",
        id: "C2681"
      },
      {
        txt: "化妆品制造",
        id: "C2682"
      },
      {
        txt: "口腔清洁用品制造",
        id: "C2683"
      },
      {
        txt: "香料、香精制造",
        id: "C2684"
      },
      {
        txt: "其他日用化学产品制造",
        id: "C2689"
      },
      {
        txt: "化学药品原料药制造",
        id: "C2710"
      },
      {
        txt: "化学药品制剂制造",
        id: "C2720"
      },
      {
        txt: "中药饮片加工",
        id: "C2730"
      },
      {
        txt: "中成药生产",
        id: "C2740"
      },
      {
        txt: "兽用药品制造",
        id: "C2750"
      },
      {
        txt: "生物药品制造",
        id: "C2761"
      },
      {
        txt: "基因工程药物和疫苗制造",
        id: "C2762"
      },
      {
        txt: "卫生材料及医药用品制造",
        id: "C2770"
      },
      {
        txt: "药用辅料及包装材料",
        id: "C2780"
      },
      {
        txt: "化纤浆粕制造",
        id: "C2811"
      },
      {
        txt: "人造纤维（纤维素纤维）制造",
        id: "C2812"
      },
      {
        txt: "锦纶纤维制造",
        id: "C2821"
      },
      {
        txt: "涤纶纤维制造",
        id: "C2822"
      },
      {
        txt: "腈纶纤维制造",
        id: "C2823"
      },
      {
        txt: "维纶纤维制造",
        id: "C2824"
      },
      {
        txt: "丙纶纤维制造",
        id: "C2825"
      },
      {
        txt: "氨纶纤维制造",
        id: "C2826"
      },
      {
        txt: "其他合成纤维制造",
        id: "C2829"
      },
      {
        txt: "生物基化学纤维制造",
        id: "C2831"
      },
      {
        txt: "生物基、淀粉基新材料制造",
        id: "C2832"
      },
      {
        txt: "轮胎制造",
        id: "C2911"
      },
      {
        txt: "橡胶板、管、带制造",
        id: "C2912"
      },
      {
        txt: "橡胶零件制造",
        id: "C2913"
      },
      {
        txt: "再生橡胶制造",
        id: "C2914"
      },
      {
        txt: "日用及医用橡胶制品制造",
        id: "C2915"
      },
      {
        txt: "运动场地用塑胶制造",
        id: "C2916"
      },
      {
        txt: "其他橡胶制品制造",
        id: "C2919"
      },
      {
        txt: "塑料薄膜制造",
        id: "C2921"
      },
      {
        txt: "塑料板、管、型材制造",
        id: "C2922"
      },
      {
        txt: "塑料丝、绳及编织品制造",
        id: "C2923"
      },
      {
        txt: "泡沫塑料制造",
        id: "C2924"
      },
      {
        txt: "塑料人造革、合成革制造",
        id: "C2925"
      },
      {
        txt: "塑料包装箱及容器制造",
        id: "C2926"
      },
      {
        txt: "日用塑料制品制造",
        id: "C2927"
      },
      {
        txt: "人造草坪制造",
        id: "C2928"
      },
      {
        txt: "塑料零件及其他塑料制品制造",
        id: "C2929"
      },
      {
        txt: "水泥制造",
        id: "C3011"
      },
      {
        txt: "石灰和石膏制造",
        id: "C3012"
      },
      {
        txt: "水泥制品制造",
        id: "C3021"
      },
      {
        txt: "砼结构构件制造",
        id: "C3022"
      },
      {
        txt: "石棉水泥制品制造",
        id: "C3023"
      },
      {
        txt: "轻质建筑材料制造",
        id: "C3024"
      },
      {
        txt: "其他水泥类似制品制造",
        id: "C3029"
      },
      {
        txt: "粘土砖瓦及建筑砌块制造",
        id: "C3031"
      },
      {
        txt: "建筑用石加工",
        id: "C3032"
      },
      {
        txt: "防水建筑材料制造",
        id: "C3033"
      },
      {
        txt: "隔热和隔音材料制造",
        id: "C3034"
      },
      {
        txt: "其他建筑材料制造",
        id: "C3039"
      },
      {
        txt: "平板玻璃制造",
        id: "C3041"
      },
      {
        txt: "特种玻璃制造",
        id: "C3042"
      },
      {
        txt: "其他玻璃制造",
        id: "C3049"
      },
      {
        txt: "技术玻璃制品制造",
        id: "C3051"
      },
      {
        txt: "光学玻璃制造",
        id: "C3052"
      },
      {
        txt: "玻璃仪器制造",
        id: "C3053"
      },
      {
        txt: "日用玻璃制品制造",
        id: "C3054"
      },
      {
        txt: "玻璃包装容器制造",
        id: "C3055"
      },
      {
        txt: "玻璃保温容器制造",
        id: "C3056"
      },
      {
        txt: "制镜及类似品加工",
        id: "C3057"
      },
      {
        txt: "其他玻璃制品制造",
        id: "C3059"
      },
      {
        txt: "玻璃纤维及制品制造",
        id: "C3061"
      },
      {
        txt: "玻璃纤维增强塑料制品制造",
        id: "C3062"
      },
      {
        txt: "建筑陶瓷制品制造",
        id: "C3071"
      },
      {
        txt: "卫生陶瓷制品制造",
        id: "C3072"
      },
      {
        txt: "特种陶瓷制品制造",
        id: "C3073"
      },
      {
        txt: "日用陶瓷制品制造",
        id: "C3074"
      },
      {
        txt: "陈设艺术陶瓷制造",
        id: "C3075"
      },
      {
        txt: "园艺陶瓷制造",
        id: "C3076"
      },
      {
        txt: "其他陶瓷制品制造",
        id: "C3079"
      },
      {
        txt: "石棉制品制造",
        id: "C3081"
      },
      {
        txt: "云母制品制造",
        id: "C3082"
      },
      {
        txt: "耐火陶瓷制品及其他耐火材料制造",
        id: "C3089"
      },
      {
        txt: "石墨及碳素制品制造",
        id: "C3091"
      },
      {
        txt: "其他非金属矿物制品制造",
        id: "C3099"
      },
      {
        txt: "炼铁",
        id: "C3110"
      },
      {
        txt: "炼钢",
        id: "C3120"
      },
      {
        txt: "钢压延加工",
        id: "C3130"
      },
      {
        txt: "铁合金冶炼",
        id: "C3140"
      },
      {
        txt: "铜冶炼",
        id: "C3211"
      },
      {
        txt: "铅锌冶炼",
        id: "C3212"
      },
      {
        txt: "镍钴冶炼",
        id: "C3213"
      },
      {
        txt: "锡冶炼",
        id: "C3214"
      },
      {
        txt: "锑冶炼",
        id: "C3215"
      },
      {
        txt: "铝冶炼",
        id: "C3216"
      },
      {
        txt: "镁冶炼",
        id: "C3217"
      },
      {
        txt: "硅冶炼",
        id: "C3218"
      },
      {
        txt: "其他常用有色金属冶炼",
        id: "C3219"
      },
      {
        txt: "金冶炼",
        id: "C3221"
      },
      {
        txt: "银冶炼",
        id: "C3222"
      },
      {
        txt: "其他贵金属冶炼",
        id: "C3229"
      },
      {
        txt: "钨钼冶炼",
        id: "C3231"
      },
      {
        txt: "稀土金属冶炼",
        id: "C3232"
      },
      {
        txt: "其他稀有金属冶炼",
        id: "C3239"
      },
      {
        txt: "有色金属合金制造",
        id: "C3240"
      },
      {
        txt: "铜压延加工",
        id: "C3251"
      },
      {
        txt: "铝压延加工",
        id: "C3252"
      },
      {
        txt: "贵金属压延加工",
        id: "C3253"
      },
      {
        txt: "稀有稀土金属压延加工",
        id: "C3254"
      },
      {
        txt: "其他有色金属压延加工",
        id: "C3259"
      },
      {
        txt: "金属结构制造",
        id: "C3311"
      },
      {
        txt: "金属门窗制造",
        id: "C3312"
      },
      {
        txt: "切削工具制造",
        id: "C3321"
      },
      {
        txt: "手工具制造",
        id: "C3322"
      },
      {
        txt: "农用及园林用金属工具制造",
        id: "C3323"
      },
      {
        txt: "刀剪及类似日用金属工具制造",
        id: "C3324"
      },
      {
        txt: "其他金属工具制造",
        id: "C3329"
      },
      {
        txt: "集装箱制造",
        id: "C3331"
      },
      {
        txt: "金属压力容器制造",
        id: "C3332"
      },
      {
        txt: "金属包装容器及材料制造",
        id: "C3333"
      },
      {
        txt: "金属丝绳及其制品制造",
        id: "C3340"
      },
      {
        txt: "建筑、家具用金属配件制造",
        id: "C3351"
      },
      {
        txt: "建筑装饰及水暖管道零件制造",
        id: "C3352"
      },
      {
        txt: "安全、消防用金属制品制造",
        id: "C3353"
      },
      {
        txt: "其他建筑、安全用金属制品制造",
        id: "C3359"
      },
      {
        txt: "金属表面处理及热处理加工",
        id: "C3360"
      },
      {
        txt: "生产专用搪瓷制品制造",
        id: "C3371"
      },
      {
        txt: "建筑装饰搪瓷制品制造",
        id: "C3372"
      },
      {
        txt: "搪瓷卫生洁具制造",
        id: "C3373"
      },
      {
        txt: "搪瓷日用品及其他搪瓷制品制造",
        id: "C3379"
      },
      {
        txt: "金属制厨房用器具制造",
        id: "C3381"
      },
      {
        txt: "金属制餐具和器皿制造",
        id: "C3382"
      },
      {
        txt: "金属制卫生器具制造",
        id: "C3383"
      },
      {
        txt: "其他金属制日用品制造",
        id: "C3389"
      },
      {
        txt: "黑色金属铸造",
        id: "C3391"
      },
      {
        txt: "有色金属铸造",
        id: "C3392"
      },
      {
        txt: "锻件及粉末冶金制品制造",
        id: "C3393"
      },
      {
        txt: "交通及公共管理用金属标牌制造",
        id: "C3394"
      },
      {
        txt: "其他未列明金属制品制造",
        id: "C3399"
      },
      {
        txt: "金属切削机床制造",
        id: "C3421"
      },
      {
        txt: "金属成形机床制造",
        id: "C3422"
      },
      {
        txt: "铸造机械制造",
        id: "C3423"
      },
      {
        txt: "金属切割及焊接设备制造",
        id: "C3424"
      },
      {
        txt: "机床功能部件及附件制造",
        id: "C3425"
      },
      {
        txt: "其他金属加工机械制造",
        id: "C3429"
      },
      {
        txt: "轻小型起重设备制造",
        id: "C3431"
      },
      {
        txt: "生产专用起重机制造",
        id: "C3432"
      },
      {
        txt: "生产专用车辆制造",
        id: "C3433"
      },
      {
        txt: "连续搬运设备制造",
        id: "C3434"
      },
      {
        txt: "电梯、自动扶梯及升降机制造",
        id: "C3435"
      },
      {
        txt: "客运索道制造",
        id: "C3436"
      },
      {
        txt: "机械式停车设备制造",
        id: "C3437"
      },
      {
        txt: "其他物料搬运设备制造",
        id: "C3439"
      },
      {
        txt: "泵及真空设备制造",
        id: "C3441"
      },
      {
        txt: "气体压缩机械制造",
        id: "C3442"
      },
      {
        txt: "阀门和旋塞制造",
        id: "C3443"
      },
      {
        txt: "液压动力机械及元件制造",
        id: "C3444"
      },
      {
        txt: "液力动力机械元件制造",
        id: "C3445"
      },
      {
        txt: "气压动力机械及元件制造",
        id: "C3446"
      },
      {
        txt: "滚动轴承制造",
        id: "C3451"
      },
      {
        txt: "滑动轴承制造",
        id: "C3452"
      },
      {
        txt: "齿轮及齿轮减、变速箱制造",
        id: "C3453"
      },
      {
        txt: "其他传动部件制造",
        id: "C3459"
      },
      {
        txt: "烘炉、熔炉及电炉制造",
        id: "C3461"
      },
      {
        txt: "风机、风扇制造",
        id: "C3462"
      },
      {
        txt: "气体、液体分离及纯净设备制造",
        id: "C3463"
      },
      {
        txt: "制冷、空调设备制造",
        id: "C3464"
      },
      {
        txt: "风动和电动工具制造",
        id: "C3465"
      },
      {
        txt: "喷枪及类似器具制造",
        id: "C3466"
      },
      {
        txt: "包装专用设备制造",
        id: "C3467"
      },
      {
        txt: "电影机械制造",
        id: "C3471"
      },
      {
        txt: "幻灯及投影设备制造",
        id: "C3472"
      },
      {
        txt: "照相机及器材制造",
        id: "C3473"
      },
      {
        txt: "复印和胶印设备制造",
        id: "C3474"
      },
      {
        txt: "计算器及货币专用设备制造",
        id: "C3475"
      },
      {
        txt: "其他文化、办公用机械制造",
        id: "C3479"
      },
      {
        txt: "金属密封件制造",
        id: "C3481"
      },
      {
        txt: "紧固件制造",
        id: "C3482"
      },
      {
        txt: "弹簧制造",
        id: "C3483"
      },
      {
        txt: "机械零部件加工",
        id: "C3484"
      },
      {
        txt: "其他通用零部件制造",
        id: "C3489"
      },
      {
        txt: "工业机器人制造",
        id: "C3491"
      },
      {
        txt: "特殊作业机器人制造",
        id: "C3492"
      },
      {
        txt: "增材制造装备制造",
        id: "C3493"
      },
      {
        txt: "其他未列明通用设备制造业",
        id: "C3499"
      },
      {
        txt: "锅炉及辅助设备制造",
        id: "C3411"
      },
      {
        txt: "内燃机及配件制造",
        id: "C3412"
      },
      {
        txt: "汽轮机及辅机制造",
        id: "C3413"
      },
      {
        txt: "水轮机及辅机制造",
        id: "C3414"
      },
      {
        txt: "风能原动设备制造",
        id: "C3415"
      },
      {
        txt: "其他原动设备制造",
        id: "C3419"
      },
      {
        txt: "工业自动控制系统装置制造",
        id: "C4011"
      },
      {
        txt: "电工仪器仪表制造",
        id: "C4012"
      },
      {
        txt: "绘图、计算及测量仪器制造",
        id: "C4013"
      },
      {
        txt: "实验分析仪器制造",
        id: "C4014"
      },
      {
        txt: "试验机制造",
        id: "C4015"
      },
      {
        txt: "供应用仪器仪表制造",
        id: "C4016"
      },
      {
        txt: "其他通用仪器制造",
        id: "C4019"
      },
      {
        txt: "环境监测专用仪器仪表制造",
        id: "C4021"
      },
      {
        txt: "运输设备及生产用计数仪表制造",
        id: "C4022"
      },
      {
        txt: "导航、测绘、气象及海洋专用仪器制造",
        id: "C4023"
      },
      {
        txt: "农林牧渔专用仪器仪表制造",
        id: "C4024"
      },
      {
        txt: "地质勘探和地震专用仪器制造",
        id: "C4025"
      },
      {
        txt: "教学专用仪器制造",
        id: "C4026"
      },
      {
        txt: "核子及核辐射测量仪器制造",
        id: "C4027"
      },
      {
        txt: "电子测量仪器制造",
        id: "C4028"
      },
      {
        txt: "其他专用仪器制造",
        id: "C4029"
      },
      {
        txt: "钟表与计时仪器制造",
        id: "C4030"
      },
      {
        txt: "光学仪器制造",
        id: "C4040"
      },
      {
        txt: "衡器制造",
        id: "C4050"
      },
      {
        txt: "其他仪器仪表制造业",
        id: "C4090"
      },
      {
        txt: "鬃毛加工、制刷及清扫工具制造",
        id: "C4111"
      },
      {
        txt: "其他日用杂品制造",
        id: "C4119"
      },
      {
        txt: "核辐射加工",
        id: "C4120"
      },
      {
        txt: "其他未列明制造业",
        id: "C4190"
      },
      {
        txt: "金属废料和碎屑加工处理",
        id: "C4210"
      },
      {
        txt: "非金属废料和碎屑加工处理",
        id: "C4220"
      },
      {
        txt: "金属制品修理",
        id: "C4310"
      },
      {
        txt: "通用设备修理",
        id: "C4320"
      },
      {
        txt: "专用设备修理",
        id: "C4330"
      },
      {
        txt: "铁路运输设备修理",
        id: "C4341"
      },
      {
        txt: "船舶修理",
        id: "C4342"
      },
      {
        txt: "航空航天器修理",
        id: "C4343"
      },
      {
        txt: "其他运输设备修理",
        id: "C4349"
      },
      {
        txt: "电气设备修理",
        id: "C4350"
      },
      {
        txt: "仪器仪表修理",
        id: "C4360"
      },
      {
        txt: "其他机械和设备修理业",
        id: "C4390"
      },
      {
        txt: "稻谷加工",
        id: "C1311"
      },
      {
        txt: "小麦加工",
        id: "C1312"
      },
      {
        txt: "玉米加工",
        id: "C1313"
      },
      {
        txt: "杂粮加工",
        id: "C1314"
      },
      {
        txt: "其他谷物磨制",
        id: "C1319"
      },
      {
        txt: "宠物饲料加工",
        id: "C1321"
      },
      {
        txt: "其他饲料加工",
        id: "C1329"
      },
      {
        txt: "食用植物油加工",
        id: "C1331"
      },
      {
        txt: "非食用植物油加工",
        id: "C1332"
      },
      {
        txt: "制糖业",
        id: "C1340"
      },
      {
        txt: "牲畜屠宰",
        id: "C1351"
      },
      {
        txt: "禽类屠宰",
        id: "C1352"
      },
      {
        txt: "肉制品及副产品加工",
        id: "C1353"
      },
      {
        txt: "水产品冷冻加工",
        id: "C1361"
      },
      {
        txt: "鱼糜制品及水产品干腌制加工",
        id: "C1362"
      },
      {
        txt: "鱼油提取及制品制造",
        id: "C1363"
      },
      {
        txt: "其他水产品加工",
        id: "C1369"
      },
      {
        txt: "蔬菜加工",
        id: "C1371"
      },
      {
        txt: "食用菌加工",
        id: "C1372"
      },
      {
        txt: "水果和坚果加工",
        id: "C1373"
      },
      {
        txt: "淀粉及淀粉制品制造",
        id: "C1391"
      },
      {
        txt: "豆制品制造",
        id: "C1392"
      },
      {
        txt: "蛋品加工",
        id: "C1393"
      },
      {
        txt: "其他未列明农副食品加工",
        id: "C1399"
      },
      {
        txt: "糕点、面包制造",
        id: "C1411"
      },
      {
        txt: "饼干及其他焙烤食品制造",
        id: "C1419"
      },
      {
        txt: "糖果、巧克力制造",
        id: "C1421"
      },
      {
        txt: "蜜饯制作",
        id: "C1422"
      },
      {
        txt: "米、面制品制造",
        id: "C1431"
      },
      {
        txt: "速冻食品制造",
        id: "C1432"
      },
      {
        txt: "方便面制造",
        id: "C1433"
      },
      {
        txt: "其他方便食品制造",
        id: "C1439"
      },
      {
        txt: "液体乳制造",
        id: "C1441"
      },
      {
        txt: "乳粉制造",
        id: "C1442"
      },
      {
        txt: "其他乳制品制造",
        id: "C1449"
      },
      {
        txt: "肉、禽类罐头制造",
        id: "C1451"
      },
      {
        txt: "水产品罐头制造",
        id: "C1452"
      },
      {
        txt: "蔬菜、水果罐头制造",
        id: "C1453"
      },
      {
        txt: "其他罐头食品制造",
        id: "C1459"
      },
      {
        txt: "味精制造",
        id: "C1461"
      },
      {
        txt: "酱油、食醋及类似制品制造",
        id: "C1462"
      },
      {
        txt: "其他调味品、发酵制品制造",
        id: "C1469"
      },
      {
        txt: "营养食品制造",
        id: "C1491"
      },
      {
        txt: "保健食品制造",
        id: "C1492"
      },
      {
        txt: "冷冻饮品及食用冰制造",
        id: "C1493"
      },
      {
        txt: "盐加工",
        id: "C1494"
      },
      {
        txt: "食品及饲料添加剂制造",
        id: "C1495"
      },
      {
        txt: "其他未列明食品制造",
        id: "C1499"
      },
      {
        txt: "酒精制造",
        id: "C1511"
      },
      {
        txt: "白酒制造",
        id: "C1512"
      },
      {
        txt: "啤酒制造",
        id: "C1513"
      },
      {
        txt: "黄酒制造",
        id: "C1514"
      },
      {
        txt: "葡萄酒制造",
        id: "C1515"
      },
      {
        txt: "其他酒制造",
        id: "C1519"
      },
      {
        txt: "碳酸饮料制造",
        id: "C1521"
      },
      {
        txt: "瓶（罐）装饮用水制造",
        id: "C1522"
      },
      {
        txt: "果菜汁及果菜汁饮料制造",
        id: "C1523"
      },
      {
        txt: "含乳饮料和植物蛋白饮料制造",
        id: "C1524"
      },
      {
        txt: "固体饮料制造",
        id: "C1525"
      },
      {
        txt: "茶饮料及其他饮料制造",
        id: "C1529"
      },
      {
        txt: "精制茶加工",
        id: "C1530"
      },
      {
        txt: "烟叶复烤",
        id: "C1610"
      },
      {
        txt: "卷烟制造",
        id: "C1620"
      },
      {
        txt: "其他烟草制品制造",
        id: "C1690"
      },
      {
        txt: "缫丝加工",
        id: "C1741"
      },
      {
        txt: "绢纺和丝织加工",
        id: "C1742"
      },
      {
        txt: "丝印染精加工",
        id: "C1743"
      },
      {
        txt: "化纤织造加工",
        id: "C1751"
      },
      {
        txt: "化纤织物染整精加工",
        id: "C1752"
      },
      {
        txt: "针织或钩针编织物织造",
        id: "C1761"
      },
      {
        txt: "针织或钩针编织物印染精加工",
        id: "C1762"
      },
      {
        txt: "针织或钩针编织品制造",
        id: "C1763"
      },
      {
        txt: "床上用品制造",
        id: "C1771"
      },
      {
        txt: "毛巾类制品制造",
        id: "C1772"
      },
      {
        txt: "窗帘、布艺类产品制造",
        id: "C1773"
      },
      {
        txt: "其他家用纺织制成品制造",
        id: "C1779"
      },
      {
        txt: "非织造布制造",
        id: "C1781"
      },
      {
        txt: "绳、索、缆制造",
        id: "C1782"
      },
      {
        txt: "纺织带和帘子布制造",
        id: "C1783"
      },
      {
        txt: "篷、帆布制造",
        id: "C1784"
      },
      {
        txt: "其他产业用纺织制成品制造",
        id: "C1789"
      },
      {
        txt: "棉纺纱加工",
        id: "C1711"
      },
      {
        txt: "棉织造加工",
        id: "C1712"
      },
      {
        txt: "棉印染精加工",
        id: "C1713"
      },
      {
        txt: "毛条和毛纱线加工",
        id: "C1721"
      },
      {
        txt: "毛织造加工",
        id: "C1722"
      },
      {
        txt: "毛染整精加工",
        id: "C1723"
      },
      {
        txt: "麻纤维纺前加工和纺纱",
        id: "C1731"
      },
      {
        txt: "麻织造加工",
        id: "C1732"
      },
      {
        txt: "麻染整精加工",
        id: "C1733"
      },
      {
        txt: "火力发电",
        id: "D4411"
      },
      {
        txt: "热电联产",
        id: "D4412"
      },
      {
        txt: "水力发电",
        id: "D4413"
      },
      {
        txt: "核力发电",
        id: "D4414"
      },
      {
        txt: "风力发电",
        id: "D4415"
      },
      {
        txt: "太阳能发电",
        id: "D4416"
      },
      {
        txt: "生物质能发电",
        id: "D4417"
      },
      {
        txt: "其他电力生产",
        id: "D4419"
      },
      {
        txt: "电力供应",
        id: "D4420"
      },
      {
        txt: "热力生产和供应",
        id: "D4430"
      },
      {
        txt: "天然气生产和供应业",
        id: "D4511"
      },
      {
        txt: "液化石油气生产和供应业",
        id: "D4512"
      },
      {
        txt: "煤气生产和供应业",
        id: "D4513"
      },
      {
        txt: "生物质燃气生产和供应业",
        id: "D4520"
      },
      {
        txt: "自来水生产和供应",
        id: "D4610"
      },
      {
        txt: "污水处理及其再生利用",
        id: "D4620"
      },
      {
        txt: "海水淡化处理",
        id: "D4630"
      },
      {
        txt: "其他水的处理、利用与分配",
        id: "D4690"
      },
      {
        txt: "住宅房屋建筑",
        id: "E4710"
      },
      {
        txt: "体育场馆建筑",
        id: "E4720"
      },
      {
        txt: "其他房屋建筑业",
        id: "E4790"
      },
      {
        txt: "铁路工程建筑",
        id: "E4811"
      },
      {
        txt: "公路工程建筑",
        id: "E4812"
      },
      {
        txt: "市政道路工程建筑",
        id: "E4813"
      },
      {
        txt: "城市轨道交通工程建筑",
        id: "E4814"
      },
      {
        txt: "其他道路、隧道和桥梁工程建筑",
        id: "E4819"
      },
      {
        txt: "水源及供水设施工程建筑",
        id: "E4821"
      },
      {
        txt: "河湖治理及防洪设施工程建筑",
        id: "E4822"
      },
      {
        txt: "港口及航运设施工程建筑",
        id: "E4823"
      },
      {
        txt: "海洋油气资源开发利用工程建筑",
        id: "E4831"
      },
      {
        txt: "海洋能源开发利用工程建筑",
        id: "E4832"
      },
      {
        txt: "海底隧道工程建筑",
        id: "E4833"
      },
      {
        txt: "海底设施铺设工程建筑",
        id: "E4834"
      },
      {
        txt: "其他海洋工程建筑",
        id: "E4839"
      },
      {
        txt: "工矿工程建筑",
        id: "E4840"
      },
      {
        txt: "架线及设备工程建筑",
        id: "E4851"
      },
      {
        txt: "管道工程建筑",
        id: "E4852"
      },
      {
        txt: "地下综合管廊工程建筑",
        id: "E4853"
      },
      {
        txt: "节能工程施工",
        id: "E4861"
      },
      {
        txt: "环保工程施工",
        id: "E4862"
      },
      {
        txt: "生态保护工程施工",
        id: "E4863"
      },
      {
        txt: "火力发电工程施工",
        id: "E4871"
      },
      {
        txt: "水力发电工程施工",
        id: "E4872"
      },
      {
        txt: "核电工程施工",
        id: "E4873"
      },
      {
        txt: "风能发电工程施工",
        id: "E4874"
      },
      {
        txt: "太阳能发电工程施工",
        id: "E4875"
      },
      {
        txt: "其他电力工程施工",
        id: "E4879"
      },
      {
        txt: "园林绿化工程施工",
        id: "E4891"
      },
      {
        txt: "体育场地设施工程施工",
        id: "E4892"
      },
      {
        txt: "游乐设施工程施工",
        id: "E4893"
      },
      {
        txt: "其他土木工程建筑施工",
        id: "E4899"
      },
      {
        txt: "电气安装",
        id: "E4910"
      },
      {
        txt: "管道和设备安装",
        id: "E4920"
      },
      {
        txt: "体育场地设施安装",
        id: "E4991"
      },
      {
        txt: "其他建筑安装",
        id: "E4999"
      },
      {
        txt: "公共建筑装饰和装修",
        id: "E5011"
      },
      {
        txt: "住宅装饰和装修",
        id: "E5012"
      },
      {
        txt: "建筑幕墙装饰和装修",
        id: "E5013"
      },
      {
        txt: "建筑物拆除活动",
        id: "E5021"
      },
      {
        txt: "场地准备活动",
        id: "E5022"
      },
      {
        txt: "提供施工设备服务",
        id: "E5030"
      },
      {
        txt: "其他未列明建筑业",
        id: "E5090"
      },
      {
        txt: "谷物、豆及薯类批发",
        id: "F5111"
      },
      {
        txt: "种子批发",
        id: "F5112"
      },
      {
        txt: "畜牧渔业饲料批发",
        id: "F5113"
      },
      {
        txt: "棉、麻批发",
        id: "F5114"
      },
      {
        txt: "林业产品批发",
        id: "F5115"
      },
      {
        txt: "牲畜批发",
        id: "F5116"
      },
      {
        txt: "渔业产品批发",
        id: "F5117"
      },
      {
        txt: "其他农牧产品批发",
        id: "F5119"
      },
      {
        txt: "米、面制品及食用油批发",
        id: "F5121"
      },
      {
        txt: "糕点、糖果及糖批发",
        id: "F5122"
      },
      {
        txt: "果品、蔬菜批发",
        id: "F5123"
      },
      {
        txt: "肉、禽、蛋、奶及水产品批发",
        id: "F5124"
      },
      {
        txt: "盐及调味品批发",
        id: "F5125"
      },
      {
        txt: "营养和保健品批发",
        id: "F5126"
      },
      {
        txt: "酒、饮料及茶叶批发",
        id: "F5127"
      },
      {
        txt: "烟草制品批发",
        id: "F5128"
      },
      {
        txt: "其他食品批发",
        id: "F5129"
      },
      {
        txt: "纺织品、针织品及原料批发",
        id: "F5131"
      },
      {
        txt: "服装批发",
        id: "F5132"
      },
      {
        txt: "鞋帽批发",
        id: "F5133"
      },
      {
        txt: "化妆品及卫生用品批发",
        id: "F5134"
      },
      {
        txt: "厨具卫具及日用杂品批发",
        id: "F5135"
      },
      {
        txt: "灯具、装饰物品批发",
        id: "F5136"
      },
      {
        txt: "家用视听设备批发",
        id: "F5137"
      },
      {
        txt: "日用家电批发",
        id: "F5138"
      },
      {
        txt: "其他家庭用品批发",
        id: "F5139"
      },
      {
        txt: "文具用品批发",
        id: "F5141"
      },
      {
        txt: "体育用品及器材批发",
        id: "F5142"
      },
      {
        txt: "图书批发",
        id: "F5143"
      },
      {
        txt: "报刊批发",
        id: "F5144"
      },
      {
        txt: "音像制品、电子和数字出版物批发",
        id: "F5145"
      },
      {
        txt: "首饰、工艺品及收藏品批发",
        id: "F5146"
      },
      {
        txt: "乐器批发",
        id: "F5147"
      },
      {
        txt: "其他文化用品批发",
        id: "F5149"
      },
      {
        txt: "西药批发",
        id: "F5151"
      },
      {
        txt: "中药批发",
        id: "F5152"
      },
      {
        txt: "动物用药品批发",
        id: "F5153"
      },
      {
        txt: "医疗用品及器材批发",
        id: "F5154"
      },
      {
        txt: "煤炭及制品批发",
        id: "F5161"
      },
      {
        txt: "石油及制品批发",
        id: "F5162"
      },
      {
        txt: "非金属矿及制品批发",
        id: "F5163"
      },
      {
        txt: "金属及金属矿批发",
        id: "F5164"
      },
      {
        txt: "建材批发",
        id: "F5165"
      },
      {
        txt: "化肥批发",
        id: "F5166"
      },
      {
        txt: "农药批发",
        id: "F5167"
      },
      {
        txt: "农用薄膜批发",
        id: "F5168"
      },
      {
        txt: "其他化工产品批发",
        id: "F5169"
      },
      {
        txt: "农业机械批发",
        id: "F5171"
      },
      {
        txt: "汽车及零配件批发",
        id: "F5172"
      },
      {
        txt: "摩托车及零配件批发",
        id: "F5173"
      },
      {
        txt: "五金产品批发",
        id: "F5174"
      },
      {
        txt: "电气设备批发",
        id: "F5175"
      },
      {
        txt: "计算机、软件及辅助设备批发",
        id: "F5176"
      },
      {
        txt: "通讯设备批发",
        id: "F5177"
      },
      {
        txt: "广播影视设备批发",
        id: "F5178"
      },
      {
        txt: "其他机械设备及电子产品批发",
        id: "F5179"
      },
      {
        txt: "贸易代理",
        id: "F5181"
      },
      {
        txt: "一般物品拍卖",
        id: "F5182"
      },
      {
        txt: "艺术品、收藏品拍卖",
        id: "F5183"
      },
      {
        txt: "艺术品代理",
        id: "F5184"
      },
      {
        txt: "其他贸易经纪与代理",
        id: "F5189"
      },
      {
        txt: "再生物资回收与批发",
        id: "F5191"
      },
      {
        txt: "宠物食品用品批发",
        id: "F5192"
      },
      {
        txt: "互联网批发",
        id: "F5193"
      },
      {
        txt: "其他未列明批发业",
        id: "F5199"
      },
      {
        txt: "百货零售",
        id: "F5211"
      },
      {
        txt: "超级市场零售",
        id: "F5212"
      },
      {
        txt: "便利店零售",
        id: "F5213"
      },
      {
        txt: "其他综合零售",
        id: "F5219"
      },
      {
        txt: "粮油零售",
        id: "F5221"
      },
      {
        txt: "糕点、面包零售",
        id: "F5222"
      },
      {
        txt: "果品、蔬菜零售",
        id: "F5223"
      },
      {
        txt: "肉、禽、蛋、奶及水产品零售",
        id: "F5224"
      },
      {
        txt: "营养和保健品零售",
        id: "F5225"
      },
      {
        txt: "酒、饮料及茶叶零售",
        id: "F5226"
      },
      {
        txt: "烟草制品零售",
        id: "F5227"
      },
      {
        txt: "其他食品零售",
        id: "F5229"
      },
      {
        txt: "纺织品及针织品零售",
        id: "F5231"
      },
      {
        txt: "服装零售",
        id: "F5232"
      },
      {
        txt: "鞋帽零售",
        id: "F5233"
      },
      {
        txt: "化妆品及卫生用品零售",
        id: "F5234"
      },
      {
        txt: "厨具卫具及日用杂品零售",
        id: "F5235"
      },
      {
        txt: "钟表、眼镜零售",
        id: "F5236"
      },
      {
        txt: "箱包零售",
        id: "F5237"
      },
      {
        txt: "自行车等代步设备零售",
        id: "F5238"
      },
      {
        txt: "其他日用品零售",
        id: "F5239"
      },
      {
        txt: "文具用品零售",
        id: "F5241"
      },
      {
        txt: "体育用品及器材零售",
        id: "F5242"
      },
      {
        txt: "图书、报刊零售",
        id: "F5243"
      },
      {
        txt: "音像制品、电子和数字出版物零售",
        id: "F5244"
      },
      {
        txt: "珠宝首饰零售",
        id: "F5245"
      },
      {
        txt: "工艺美术品及收藏品零售",
        id: "F5246"
      },
      {
        txt: "乐器零售",
        id: "F5247"
      },
      {
        txt: "照相器材零售",
        id: "F5248"
      },
      {
        txt: "其他文化用品零售",
        id: "F5249"
      },
      {
        txt: "西药零售",
        id: "F5251"
      },
      {
        txt: "中药零售",
        id: "F5252"
      },
      {
        txt: "动物用药品零售",
        id: "F5253"
      },
      {
        txt: "医疗用品及器材零售",
        id: "F5254"
      },
      {
        txt: "保健辅助治疗器材零售",
        id: "F5255"
      },
      {
        txt: "汽车新车零售",
        id: "F5261"
      },
      {
        txt: "汽车旧车零售",
        id: "F5262"
      },
      {
        txt: "汽车零配件零售",
        id: "F5263"
      },
      {
        txt: "摩托车及零配件零售",
        id: "F5264"
      },
      {
        txt: "机动车燃油零售",
        id: "F5265"
      },
      {
        txt: "机动车燃气零售",
        id: "F5266"
      },
      {
        txt: "机动车充电销售",
        id: "F5267"
      },
      {
        txt: "家用视听设备零售",
        id: "F5271"
      },
      {
        txt: "日用家电零售",
        id: "F5272"
      },
      {
        txt: "计算机、软件及辅助设备零售",
        id: "F5273"
      },
      {
        txt: "通信设备零售",
        id: "F5274"
      },
      {
        txt: "其他电子产品零售",
        id: "F5279"
      },
      {
        txt: "五金零售",
        id: "F5281"
      },
      {
        txt: "灯具零售",
        id: "F5282"
      },
      {
        txt: "家具零售",
        id: "F5283"
      },
      {
        txt: "涂料零售",
        id: "F5284"
      },
      {
        txt: "卫生洁具零售",
        id: "F5285"
      },
      {
        txt: "木质装饰材料零售",
        id: "F5286"
      },
      {
        txt: "陶瓷、石材装饰材料零售",
        id: "F5287"
      },
      {
        txt: "其他室内装饰材料零售",
        id: "F5289"
      },
      {
        txt: "流动货摊零售",
        id: "F5291"
      },
      {
        txt: "互联网零售",
        id: "F5292"
      },
      {
        txt: "邮购及电视、电话零售",
        id: "F5293"
      },
      {
        txt: "自动售货机零售",
        id: "F5294"
      },
      {
        txt: "旧货零售",
        id: "F5295"
      },
      {
        txt: "生活用燃料零售",
        id: "F5296"
      },
      {
        txt: "宠物食品用品零售",
        id: "F5297"
      },
      {
        txt: "其他未列明零售业",
        id: "F5299"
      },
      {
        txt: "高速铁路旅客运输",
        id: "G5311"
      },
      {
        txt: "城际铁路旅客运输",
        id: "G5312"
      },
      {
        txt: "普通铁路旅客运输",
        id: "G5313"
      },
      {
        txt: "铁路货物运输",
        id: "G5320"
      },
      {
        txt: "客运火车站",
        id: "G5331"
      },
      {
        txt: "货运火车站（场）",
        id: "G5332"
      },
      {
        txt: "铁路运输维护活动",
        id: "G5333"
      },
      {
        txt: "其他铁路运输辅助活动",
        id: "G5339"
      },
      {
        txt: "公共电汽车客运",
        id: "G5411"
      },
      {
        txt: "城市轨道交通",
        id: "G5412"
      },
      {
        txt: "出租车客运",
        id: "G5413"
      },
      {
        txt: "公共自行车服务",
        id: "G5414"
      },
      {
        txt: "其他城市公共交通运输",
        id: "G5419"
      },
      {
        txt: "长途客运",
        id: "G5421"
      },
      {
        txt: "旅游客运",
        id: "G5422"
      },
      {
        txt: "其他公路客运",
        id: "G5429"
      },
      {
        txt: "普通货物道路运输",
        id: "G5431"
      },
      {
        txt: "冷藏车道路运输",
        id: "G5432"
      },
      {
        txt: "集装箱道路运输",
        id: "G5433"
      },
      {
        txt: "大型货物道路运输",
        id: "G5434"
      },
      {
        txt: "危险货物道路运输",
        id: "G5435"
      },
      {
        txt: "邮件包裹道路运输",
        id: "G5436"
      },
      {
        txt: "城市配送",
        id: "G5437"
      },
      {
        txt: "搬家运输",
        id: "G5438"
      },
      {
        txt: "其他道路货物运输",
        id: "G5439"
      },
      {
        txt: "客运汽车站",
        id: "G5441"
      },
      {
        txt: "货运枢纽（站）",
        id: "G5442"
      },
      {
        txt: "公路管理与养护",
        id: "G5443"
      },
      {
        txt: "其他道路运输辅助活动",
        id: "G5449"
      },
      {
        txt: "海上旅客运输",
        id: "G5511"
      },
      {
        txt: "内河旅客运输",
        id: "G5512"
      },
      {
        txt: "客运轮渡运输",
        id: "G5513"
      },
      {
        txt: "远洋货物运输",
        id: "G5521"
      },
      {
        txt: "沿海货物运输",
        id: "G5522"
      },
      {
        txt: "内河货物运输",
        id: "G5523"
      },
      {
        txt: "客运港口",
        id: "G5531"
      },
      {
        txt: "货运港口",
        id: "G5532"
      },
      {
        txt: "其他水上运输辅助活动",
        id: "G5539"
      },
      {
        txt: "航空旅客运输",
        id: "G5611"
      },
      {
        txt: "航空货物运输",
        id: "G5612"
      },
      {
        txt: "通用航空生产服务",
        id: "G5621"
      },
      {
        txt: "观光游览航空服务",
        id: "G5622"
      },
      {
        txt: "体育航空运动服务",
        id: "G5623"
      },
      {
        txt: "其他通用航空服务",
        id: "G5629"
      },
      {
        txt: "机场",
        id: "G5631"
      },
      {
        txt: "空中交通管理",
        id: "G5632"
      },
      {
        txt: "其他航空运输辅助活动",
        id: "G5639"
      },
      {
        txt: "海底管道运输",
        id: "G5710"
      },
      {
        txt: "陆地管道运输",
        id: "G5720"
      },
      {
        txt: "多式联运",
        id: "G5810"
      },
      {
        txt: "货物运输代理",
        id: "G5821"
      },
      {
        txt: "旅客票务代理",
        id: "G5822"
      },
      {
        txt: "其他运输代理业",
        id: "G5829"
      },
      {
        txt: "装卸搬运",
        id: "G5910"
      },
      {
        txt: "通用仓储",
        id: "G5920"
      },
      {
        txt: "低温仓储",
        id: "G5930"
      },
      {
        txt: "油气仓储",
        id: "G5941"
      },
      {
        txt: "危险化学品仓储",
        id: "G5942"
      },
      {
        txt: "其他危险品仓储",
        id: "G5949"
      },
      {
        txt: "谷物仓储",
        id: "G5951"
      },
      {
        txt: "棉花仓储",
        id: "G5952"
      },
      {
        txt: "其他农产品仓储",
        id: "G5959"
      },
      {
        txt: "中药材仓储",
        id: "G5960"
      },
      {
        txt: "其他仓储业",
        id: "G5990"
      },
      {
        txt: "邮政基本服务",
        id: "G6010"
      },
      {
        txt: "快递服务",
        id: "G6020"
      },
      {
        txt: "其他寄递服务",
        id: "G6090"
      },
      {
        txt: "旅游饭店",
        id: "H6110"
      },
      {
        txt: "经济型连锁酒店",
        id: "H6121"
      },
      {
        txt: "其他一般旅馆",
        id: "H6129"
      },
      {
        txt: "民宿服务",
        id: "H6130"
      },
      {
        txt: "露营地服务",
        id: "H6140"
      },
      {
        txt: "其他住宿业",
        id: "H6190"
      },
      {
        txt: "正餐服务",
        id: "H6210"
      },
      {
        txt: "快餐服务",
        id: "H6220"
      },
      {
        txt: "茶馆服务",
        id: "H6231"
      },
      {
        txt: "咖啡馆服务",
        id: "H6232"
      },
      {
        txt: "酒吧服务",
        id: "H6233"
      },
      {
        txt: "其他饮料及冷饮服务",
        id: "H6239"
      },
      {
        txt: "餐饮配送服务",
        id: "H6241"
      },
      {
        txt: "外卖送餐服务",
        id: "H6242"
      },
      {
        txt: "小吃服务",
        id: "H6291"
      },
      {
        txt: "其他未列明餐饮业",
        id: "H6299"
      },
      {
        txt: "固定电信服务",
        id: "I6311"
      },
      {
        txt: "移动电信服务",
        id: "I6312"
      },
      {
        txt: "其他电信服务",
        id: "I6319"
      },
      {
        txt: "有线广播电视传输服务",
        id: "I6321"
      },
      {
        txt: "无线广播电视传输服务",
        id: "I6322"
      },
      {
        txt: "广播电视卫星传输服务",
        id: "I6331"
      },
      {
        txt: "其他卫星传输服务",
        id: "I6339"
      },
      {
        txt: "互联网接入及相关服务",
        id: "I6410"
      },
      {
        txt: "互联网搜索服务",
        id: "I6421"
      },
      {
        txt: "互联网游戏服务",
        id: "I6422"
      },
      {
        txt: "互联网其他信息服务",
        id: "I6429"
      },
      {
        txt: "互联网生产服务平台",
        id: "I6431"
      },
      {
        txt: "互联网生活服务平台",
        id: "I6432"
      },
      {
        txt: "互联网科技创新平台",
        id: "I6433"
      },
      {
        txt: "互联网公共服务平台",
        id: "I6434"
      },
      {
        txt: "其他互联网平台",
        id: "I6439"
      },
      {
        txt: "互联网安全服务",
        id: "I6440"
      },
      {
        txt: "互联网数据服务",
        id: "I6450"
      },
      {
        txt: "其他互联网服务",
        id: "I6490"
      },
      {
        txt: "基础软件开发",
        id: "I6511"
      },
      {
        txt: "支撑软件开发",
        id: "I6512"
      },
      {
        txt: "应用软件开发",
        id: "I6513"
      },
      {
        txt: "其他软件开发",
        id: "I6519"
      },
      {
        txt: "集成电路设计",
        id: "I6520"
      },
      {
        txt: "信息系统集成服务",
        id: "I6531"
      },
      {
        txt: "物联网技术服务",
        id: "I6532"
      },
      {
        txt: "运行维护服务",
        id: "I6540"
      },
      {
        txt: "信息处理和存储支持服务",
        id: "I6550"
      },
      {
        txt: "信息技术咨询服务",
        id: "I6560"
      },
      {
        txt: "地理遥感信息服务",
        id: "I6571"
      },
      {
        txt: "动漫、游戏数字内容服务",
        id: "I6572"
      },
      {
        txt: "其他数字内容服务",
        id: "I6579"
      },
      {
        txt: "呼叫中心",
        id: "I6591"
      },
      {
        txt: "其他未列明信息技术服务业",
        id: "I6599"
      },
      {
        txt: "中央银行服务",
        id: "J6610"
      },
      {
        txt: "商业银行服务",
        id: "J6621"
      },
      {
        txt: "政策性银行服务",
        id: "J6622"
      },
      {
        txt: "信用合作社服务",
        id: "J6623"
      },
      {
        txt: "农村资金互助社服务",
        id: "J6624"
      },
      {
        txt: "其他货币银行服务",
        id: "J6629"
      },
      {
        txt: "金融租赁服务",
        id: "J6631"
      },
      {
        txt: "财务公司服务 ",
        id: "J6632"
      },
      {
        txt: "典当",
        id: "J6633"
      },
      {
        txt: "汽车金融公司服务",
        id: "J6634"
      },
      {
        txt: "小额贷款公司服务",
        id: "J6635"
      },
      {
        txt: "消费金融公司服务",
        id: "J6636"
      },
      {
        txt: "网络借贷服务",
        id: "J6637"
      },
      {
        txt: "其他非货币银行服务",
        id: "J6639"
      },
      {
        txt: "银行理财服务",
        id: "J6640"
      },
      {
        txt: "银行监管服务",
        id: "J6650"
      },
      {
        txt: "证券市场管理服务",
        id: "J6711"
      },
      {
        txt: "证券经纪交易服务",
        id: "J6712"
      },
      {
        txt: "公开募集证券投资基金",
        id: "J6720"
      },
      {
        txt: "创业投资基金",
        id: "J6731"
      },
      {
        txt: "天使投资",
        id: "J6732"
      },
      {
        txt: "其他非公开募集证券投资基金",
        id: "J6739"
      },
      {
        txt: "期货市场管理服务",
        id: "J6741"
      },
      {
        txt: "其他期货市场服务",
        id: "J6749"
      },
      {
        txt: "证券期货监管服务",
        id: "J6750"
      },
      {
        txt: "资本投资服务",
        id: "J6760"
      },
      {
        txt: "其他资本市场服务",
        id: "J6790"
      },
      {
        txt: "金融信息服务",
        id: "J6940"
      },
      {
        txt: "金融资产管理公司",
        id: "J6950"
      },
      {
        txt: "货币经纪公司服务",
        id: "J6991"
      },
      {
        txt: "其他未包括金融业",
        id: "J6999"
      },
      {
        txt: "信托公司",
        id: "J6911"
      },
      {
        txt: "其他金融信托与管理服务",
        id: "J6919"
      },
      {
        txt: "控股公司服务",
        id: "J6920"
      },
      {
        txt: "非金融机构支付服务",
        id: "J6930"
      },
      {
        txt: "保险资产管理",
        id: "J6860"
      },
      {
        txt: "保险监管服务",
        id: "J6870"
      },
      {
        txt: "其他保险活动",
        id: "J6890"
      },
      {
        txt: "人寿保险",
        id: "J6811"
      },
      {
        txt: "年金保险",
        id: "J6812"
      },
      {
        txt: "健康保险",
        id: "J6813"
      },
      {
        txt: "意外伤害保险",
        id: "J6814"
      },
      {
        txt: "财产保险",
        id: "J6820"
      },
      {
        txt: "再保险",
        id: "J6830"
      },
      {
        txt: "商业养老金",
        id: "J6840"
      },
      {
        txt: "保险代理服务",
        id: "J6852"
      },
      {
        txt: "保险公估服务",
        id: "J6853"
      },
      {
        txt: "保险经纪服务",
        id: "J6851"
      },
      {
        txt: "房地产开发经营",
        id: "K7010"
      },
      {
        txt: "物业管理",
        id: "K7020"
      },
      {
        txt: "房地产中介服务",
        id: "K7030"
      },
      {
        txt: "房地产租赁经营",
        id: "K7040"
      },
      {
        txt: "其他房地产业",
        id: "K7090"
      },
      {
        txt: "汽车租赁",
        id: "L7111"
      },
      {
        txt: "农业机械经营租赁",
        id: "L7112"
      },
      {
        txt: "建筑工程机械与设备经营租赁",
        id: "L7113"
      },
      {
        txt: "计算机及通讯设备经营租赁",
        id: "L7114"
      },
      {
        txt: "医疗设备经营租赁",
        id: "L7115"
      },
      {
        txt: "其他机械与设备经营租赁",
        id: "L7119"
      },
      {
        txt: "休闲娱乐用品设备出租",
        id: "L7121"
      },
      {
        txt: "体育用品设备出租",
        id: "L7122"
      },
      {
        txt: "文化用品设备出租",
        id: "L7123"
      },
      {
        txt: "图书出租",
        id: "L7124"
      },
      {
        txt: "音像制品出租",
        id: "L7125"
      },
      {
        txt: "其他文体设备和用品出租",
        id: "L7129"
      },
      {
        txt: "日用品出租",
        id: "L7130"
      },
      {
        txt: "企业总部管理",
        id: "L7211"
      },
      {
        txt: "投资与资产管理",
        id: "L7212"
      },
      {
        txt: "资源与产权交易服务",
        id: "L7213"
      },
      {
        txt: "单位后勤管理服务",
        id: "L7214"
      },
      {
        txt: "农村集体经济组织管理",
        id: "L7215"
      },
      {
        txt: "其他组织管理服务",
        id: "L7219"
      },
      {
        txt: "园区管理服务",
        id: "L7221"
      },
      {
        txt: "商业综合体管理服务",
        id: "L7222"
      },
      {
        txt: "市场管理服务",
        id: "L7223"
      },
      {
        txt: "供应链管理服务",
        id: "L7224"
      },
      {
        txt: "其他综合管理服务",
        id: "L7229"
      },
      {
        txt: "园区管理服务",
        id: "L7221"
      },
      {
        txt: "商业综合体管理服务",
        id: "L7222"
      },
      {
        txt: "市场管理服务",
        id: "L7223"
      },
      {
        txt: "供应链管理服务",
        id: "L7224"
      },
      {
        txt: "其他综合管理服务",
        id: "L7229"
      },
      {
        txt: "律师及相关法律服务",
        id: "L7231"
      },
      {
        txt: "公证服务",
        id: "L7232"
      },
      {
        txt: "其他法律服务",
        id: "L7239"
      },
      {
        txt: "会计、审计及税务服务",
        id: "L7241"
      },
      {
        txt: "市场调查",
        id: "L7242"
      },
      {
        txt: "社会经济咨询",
        id: "L7243"
      },
      {
        txt: "健康咨询",
        id: "L7244"
      },
      {
        txt: "环保咨询",
        id: "L7245"
      },
      {
        txt: "体育咨询",
        id: "L7246"
      },
      {
        txt: "其他专业咨询与调查",
        id: "L7249"
      },
      {
        txt: "互联网广告服务",
        id: "L7251"
      },
      {
        txt: "其他广告服务",
        id: "L7259"
      },
      {
        txt: "公共就业服务",
        id: "L7261"
      },
      {
        txt: "职业中介服务",
        id: "L7262"
      },
      {
        txt: "劳务派遣服务",
        id: "L7263"
      },
      {
        txt: "创业指导服务",
        id: "L7264"
      },
      {
        txt: "其他人力资源服务",
        id: "L7269"
      },
      {
        txt: "安全服务",
        id: "L7271"
      },
      {
        txt: "安全系统监控服务",
        id: "L7272"
      },
      {
        txt: "其他安全保护服务",
        id: "L7279"
      },
      {
        txt: "科技会展服务",
        id: "L7281"
      },
      {
        txt: "旅游会展服务",
        id: "L7282"
      },
      {
        txt: "体育会展服务",
        id: "L7283"
      },
      {
        txt: "文化会展服务",
        id: "L7284"
      },
      {
        txt: "其他会议、展览及相关服务",
        id: "L7289"
      },
      {
        txt: "旅行社及相关服务",
        id: "L7291"
      },
      {
        txt: "包装服务",
        id: "L7292"
      },
      {
        txt: "办公服务",
        id: "L7293"
      },
      {
        txt: "翻译服务",
        id: "L7294"
      },
      {
        txt: "信用服务",
        id: "L7295"
      },
      {
        txt: "非融资担保服务",
        id: "L7296"
      },
      {
        txt: "商务代理代办服务",
        id: "L7297"
      },
      {
        txt: "票务代理服务",
        id: "L7298"
      },
      {
        txt: "其他未列明商务服务业",
        id: "L7299"
      },
      {
        txt: "自然科学研究和试验发展",
        id: "M7310"
      },
      {
        txt: "工程和技术研究和试验发展",
        id: "M7320"
      },
      {
        txt: "农业科学研究和试验发展",
        id: "M7330"
      },
      {
        txt: "医学研究和试验发展",
        id: "M7340"
      },
      {
        txt: "社会人文科学研究",
        id: "M7350"
      },
      {
        txt: "气象服务",
        id: "M7410"
      },
      {
        txt: "地震服务",
        id: "M7420"
      },
      {
        txt: "遥感测绘服务",
        id: "M7441"
      },
      {
        txt: "其他测绘地理信息服务",
        id: "M7449"
      },
      {
        txt: "检验检疫服务",
        id: "M7451"
      },
      {
        txt: "检测服务",
        id: "M7452"
      },
      {
        txt: "计量服务",
        id: "M7453"
      },
      {
        txt: "标准化服务",
        id: "M7454"
      },
      {
        txt: "认证认可服务",
        id: "M7455"
      },
      {
        txt: "其他质检技术服务",
        id: "M7459"
      },
      {
        txt: "环境保护监测",
        id: "M7461"
      },
      {
        txt: "生态资源监测",
        id: "M7462"
      },
      {
        txt: "野生动物疫源疫病防控监测",
        id: "M7463"
      },
      {
        txt: "能源矿产地质勘查",
        id: "M7471"
      },
      {
        txt: "固体矿产地质勘查",
        id: "M7472"
      },
      {
        txt: "水、二氧化碳等矿产地质勘查",
        id: "M7473"
      },
      {
        txt: "基础地质勘查",
        id: "M7474"
      },
      {
        txt: "地质勘查技术服务",
        id: "M7475"
      },
      {
        txt: "工程管理服务",
        id: "M7481"
      },
      {
        txt: "工程监理服务",
        id: "M7482"
      },
      {
        txt: "工程勘察活动",
        id: "M7483"
      },
      {
        txt: "工程设计活动",
        id: "M7484"
      },
      {
        txt: "规划设计管理",
        id: "M7485"
      },
      {
        txt: "土地规划服务",
        id: "M7486"
      },
      {
        txt: "工业设计服务",
        id: "M7491"
      },
      {
        txt: "专业设计服务",
        id: "M7492"
      },
      {
        txt: "兽医服务",
        id: "M7493"
      },
      {
        txt: "其他未列明专业技术服务业",
        id: "M7499"
      },
      {
        txt: "海洋气象服务",
        id: "M7431"
      },
      {
        txt: "海洋环境服务",
        id: "M7432"
      },
      {
        txt: "其他海洋服务",
        id: "M7439"
      },
      {
        txt: "农林牧渔技术推广服务",
        id: "M7511"
      },
      {
        txt: "生物技术推广服务",
        id: "M7512"
      },
      {
        txt: "新材料技术推广服务",
        id: "M7513"
      },
      {
        txt: "节能技术推广服务",
        id: "M7514"
      },
      {
        txt: "新能源技术推广服务",
        id: "M7515"
      },
      {
        txt: "环保技术推广服务",
        id: "M7516"
      },
      {
        txt: "三维（3D)打印技术推广服务",
        id: "M7517"
      },
      {
        txt: "其他技术推广服务",
        id: "M7519"
      },
      {
        txt: "知识产权服务",
        id: "M7520"
      },
      {
        txt: "科技中介服务",
        id: "M7530"
      },
      {
        txt: "创业空间服务",
        id: "M7540"
      },
      {
        txt: "其他科技推广服务业",
        id: "M7590"
      },
      {
        txt: "防洪除涝设施管理",
        id: "N7610"
      },
      {
        txt: "水资源管理",
        id: "N7620"
      },
      {
        txt: "天然水收集与分配",
        id: "N7630"
      },
      {
        txt: "水文服务",
        id: "N7640"
      },
      {
        txt: "其他水利管理业",
        id: "N7690"
      },
      {
        txt: "自然生态系统保护管理",
        id: "N7711"
      },
      {
        txt: "自然遗迹保护管理",
        id: "N7712"
      },
      {
        txt: "野生动物保护",
        id: "N7713"
      },
      {
        txt: "野生植物保护",
        id: "N7714"
      },
      {
        txt: "动物园、水族馆管理服务",
        id: "N7715"
      },
      {
        txt: "植物园管理服务",
        id: "N7716"
      },
      {
        txt: "其他自然保护",
        id: "N7719"
      },
      {
        txt: "水污染治理",
        id: "N7721"
      },
      {
        txt: "大气污染治理",
        id: "N7722"
      },
      {
        txt: "固体废物治理",
        id: "N7723"
      },
      {
        txt: "危险废物治理",
        id: "N7724"
      },
      {
        txt: "放射性废物治理",
        id: "N7725"
      },
      {
        txt: "土壤污染治理与修复服务",
        id: "N7726"
      },
      {
        txt: "噪声与振动控制服务",
        id: "N7727"
      },
      {
        txt: "其他污染治理",
        id: "N7729"
      },
      {
        txt: "市政设施管理",
        id: "N7810"
      },
      {
        txt: "环境卫生管理",
        id: "N7820"
      },
      {
        txt: "城乡市容管理",
        id: "N7830"
      },
      {
        txt: "绿化管理",
        id: "N7840"
      },
      {
        txt: "城市公园管理",
        id: "N7850"
      },
      {
        txt: "名胜风景区管理",
        id: "N7861"
      },
      {
        txt: "森林公园管理",
        id: "N7862"
      },
      {
        txt: "其他游览景区管理",
        id: "N7869"
      },
      {
        txt: "土地整治服务",
        id: "N7910"
      },
      {
        txt: "土地调查评估服务",
        id: "N7920"
      },
      {
        txt: "土地登记服务",
        id: "N7930"
      },
      {
        txt: "土地登记代理服务",
        id: "N7940"
      },
      {
        txt: "其他土地管理服务",
        id: "N7990"
      },
      {
        txt: "家庭服务",
        id: "O8010"
      },
      {
        txt: "托儿所服务",
        id: "O8020"
      },
      {
        txt: "洗染服务",
        id: "O8030"
      },
      {
        txt: "理发及美容服务",
        id: "O8040"
      },
      {
        txt: "洗浴服务",
        id: "O8051"
      },
      {
        txt: "足浴服务",
        id: "O8052"
      },
      {
        txt: "养生保健服务",
        id: "O8053"
      },
      {
        txt: "摄影扩印服务",
        id: "O8060"
      },
      {
        txt: "婚姻服务",
        id: "O8070"
      },
      {
        txt: "殡葬服务",
        id: "O8080"
      },
      {
        txt: "其他居民服务业",
        id: "O8090"
      },
      {
        txt: "汽车修理与维护",
        id: "O8111"
      },
      {
        txt: "大型车辆装备修理与维护",
        id: "O8112"
      },
      {
        txt: "摩托车修理与维护",
        id: "O8113"
      },
      {
        txt: "助动车等修理与维护",
        id: "O8114"
      },
      {
        txt: "计算机和辅助设备修理",
        id: "O8121"
      },
      {
        txt: "通讯设备修理",
        id: "O8122"
      },
      {
        txt: "其他办公设备维修",
        id: "O8129"
      },
      {
        txt: "家用电子产品修理",
        id: "O8131"
      },
      {
        txt: "日用电器修理",
        id: "O8132"
      },
      {
        txt: "自行车修理",
        id: "O8191"
      },
      {
        txt: "鞋和皮革修理",
        id: "O8192"
      },
      {
        txt: "家具和相关物品修理",
        id: "O8193"
      },
      {
        txt: "其他未列明日用产品修理业",
        id: "O8199"
      },
      {
        txt: "建筑物清洁服务",
        id: "O8211"
      },
      {
        txt: "其他清洁服务",
        id: "O8219"
      },
      {
        txt: "宠物饲养",
        id: "O8221"
      },
      {
        txt: "宠物医院服务",
        id: "O8222"
      },
      {
        txt: "宠物美容服务",
        id: "O8223"
      },
      {
        txt: "宠物寄托收养服务",
        id: "O8224"
      },
      {
        txt: "其他宠物服务",
        id: "O8229"
      },
      {
        txt: "其他未列明服务业",
        id: "O8290"
      },
      {
        txt: "学前教育",
        id: "P8310"
      },
      {
        txt: "普通小学教育",
        id: "P8321"
      },
      {
        txt: "成人小学教育",
        id: "P8322"
      },
      {
        txt: "普通初中教育",
        id: "P8331"
      },
      {
        txt: "职业初中教育",
        id: "P8332"
      },
      {
        txt: "成人初中教育",
        id: "P8333"
      },
      {
        txt: "普通高中教育",
        id: "P8334"
      },
      {
        txt: "成人高中教育",
        id: "P8335"
      },
      {
        txt: "中等职业学校教育",
        id: "P8336"
      },
      {
        txt: "普通高等教育",
        id: "P8341"
      },
      {
        txt: "成人高等教育",
        id: "P8342"
      },
      {
        txt: "特殊教育",
        id: "P8350"
      },
      {
        txt: "职业技能培训",
        id: "P8391"
      },
      {
        txt: "体校及体育培训",
        id: "P8392"
      },
      {
        txt: "文化艺术培训",
        id: "P8393"
      },
      {
        txt: "教育辅助服务",
        id: "P8394"
      },
      {
        txt: "其他未列明教育",
        id: "P8399"
      },
      {
        txt: "综合医院",
        id: "Q8411"
      },
      {
        txt: "中医医院",
        id: "Q8412"
      },
      {
        txt: "中西医结合医院",
        id: "Q8413"
      },
      {
        txt: "民族医院",
        id: "Q8414"
      },
      {
        txt: "专科医院",
        id: "Q8415"
      },
      {
        txt: "疗养院",
        id: "Q8416"
      },
      {
        txt: "社区卫生服务中心（站）",
        id: "Q8421"
      },
      {
        txt: "街道卫生院",
        id: "Q8422"
      },
      {
        txt: "乡镇卫生院",
        id: "Q8423"
      },
      {
        txt: "村卫生室",
        id: "Q8424"
      },
      {
        txt: "门诊部（所）",
        id: "Q8425"
      },
      {
        txt: "疾病预防控制中心",
        id: "Q8431"
      },
      {
        txt: "专科疾病防治院（所、站)",
        id: "Q8432"
      },
      {
        txt: "妇幼保健院（所、站）",
        id: "Q8433"
      },
      {
        txt: "急救中心（站）服务",
        id: "Q8434"
      },
      {
        txt: "采供血机构服务",
        id: "Q8435"
      },
      {
        txt: "计划生育技术服务活动",
        id: "Q8436"
      },
      {
        txt: "健康体检服务",
        id: "Q8491"
      },
      {
        txt: "临床检验服务",
        id: "Q8492"
      },
      {
        txt: "其他未列明卫生服务",
        id: "Q8499"
      },
      {
        txt: "干部休养所",
        id: "Q8511"
      },
      {
        txt: "护理机构服务",
        id: "Q8512"
      },
      {
        txt: "精神康复服务",
        id: "Q8513"
      },
      {
        txt: "老年人、残疾人养护服务",
        id: "Q8514"
      },
      {
        txt: "临终关怀服务",
        id: "Q8515"
      },
      {
        txt: "孤残儿童收养和庇护服务",
        id: "Q8516"
      },
      {
        txt: "其他提供住宿社会救助",
        id: "Q8519"
      },
      {
        txt: "社会看护与帮助服务",
        id: "Q8521"
      },
      {
        txt: "康复辅具适配服务",
        id: "Q8522"
      },
      {
        txt: "其他不提供住宿社会工作",
        id: "Q8529"
      },
      {
        txt: "新闻业",
        id: "R8610"
      },
      {
        txt: "图书出版",
        id: "R8621"
      },
      {
        txt: "报纸出版",
        id: "R8622"
      },
      {
        txt: "期刊出版",
        id: "R8623"
      },
      {
        txt: "音像制品出版",
        id: "R8624"
      },
      {
        txt: "电子出版物出版",
        id: "R8625"
      },
      {
        txt: "数字出版",
        id: "R8626"
      },
      {
        txt: "其他出版业",
        id: "R8629"
      },
      {
        txt: "广播",
        id: "R8710"
      },
      {
        txt: "电视",
        id: "R8720"
      },
      {
        txt: "影视节目制作",
        id: "R8730"
      },
      {
        txt: "广播电视集成播控",
        id: "R8740"
      },
      {
        txt: "电影和广播电视节目发行",
        id: "R8750"
      },
      {
        txt: "电影放映",
        id: "R8760"
      },
      {
        txt: "录音制作",
        id: "R8770"
      },
      {
        txt: "文艺创作与表演",
        id: "R8810"
      },
      {
        txt: "艺术表演场馆",
        id: "R8820"
      },
      {
        txt: "图书馆",
        id: "R8831"
      },
      {
        txt: "档案馆",
        id: "R8832"
      },
      {
        txt: "文物及非物质文化遗产保护",
        id: "R8840"
      },
      {
        txt: "博物馆",
        id: "R8850"
      },
      {
        txt: "烈士陵园、纪念馆",
        id: "R8860"
      },
      {
        txt: "群众文体活动",
        id: "R8870"
      },
      {
        txt: "其他文化艺术业",
        id: "R8890"
      },
      {
        txt: "体育竞赛组织",
        id: "R8911"
      },
      {
        txt: "体育保障组织",
        id: "R8912"
      },
      {
        txt: "其他体育组织",
        id: "R8919"
      },
      {
        txt: "体育场馆管理",
        id: "R8921"
      },
      {
        txt: "其他体育场地设施管理",
        id: "R8929"
      },
      {
        txt: "健身休闲活动",
        id: "R8930"
      },
      {
        txt: "体育中介代理服务",
        id: "R8991"
      },
      {
        txt: "体育健康服务",
        id: "R8992"
      },
      {
        txt: "其他未列明体育",
        id: "R8999"
      },
      {
        txt: "体育彩票服务",
        id: "R9041"
      },
      {
        txt: "福利彩票服务",
        id: "R9042"
      },
      {
        txt: "其他彩票服务",
        id: "R9049"
      },
      {
        txt: "文化活动服务",
        id: "R9051"
      },
      {
        txt: "体育表演服务",
        id: "R9052"
      },
      {
        txt: "文化娱乐经纪人",
        id: "R9053"
      },
      {
        txt: "体育经纪人",
        id: "R9054"
      },
      {
        txt: "其他文化艺术经纪代理",
        id: "R9059"
      },
      {
        txt: "其他娱乐业",
        id: "R9090"
      },
      {
        txt: "歌舞厅娱乐活动",
        id: "R9011"
      },
      {
        txt: "电子游艺厅娱乐活动",
        id: "R9012"
      },
      {
        txt: "网吧活动",
        id: "R9013"
      },
      {
        txt: "其他室内娱乐活动",
        id: "R9019"
      },
      {
        txt: "游乐园",
        id: "R9020"
      },
      {
        txt: "休闲观光活动",
        id: "R9030"
      },
      {
        txt: "中国共产党机关",
        id: "S9100"
      },
      {
        txt: "国家权力机构",
        id: "S9210"
      },
      {
        txt: "综合事务管理机构",
        id: "S9221"
      },
      {
        txt: "对外事务管理机构",
        id: "S9222"
      },
      {
        txt: "公共安全管理机构",
        id: "S9223"
      },
      {
        txt: "社会事务管理机构",
        id: "S9224"
      },
      {
        txt: "经济事务管理机构",
        id: "S9225"
      },
      {
        txt: "行政监督检查机构",
        id: "S9226"
      },
      {
        txt: "人民法院",
        id: "S9231"
      },
      {
        txt: "人民检察院",
        id: "S9232"
      },
      {
        txt: "消防管理机构",
        id: "S9291"
      },
      {
        txt: "其他未列明国家机构",
        id: "S9299"
      },
      {
        txt: "人民政协",
        id: "S9310"
      },
      {
        txt: "民主党派",
        id: "S9320"
      },
      {
        txt: "基本养老保险",
        id: "S9411"
      },
      {
        txt: "基本医疗保险",
        id: "S9412"
      },
      {
        txt: "失业保险",
        id: "S9413"
      },
      {
        txt: "工伤保险",
        id: "S9414"
      },
      {
        txt: "生育保险",
        id: "S9415"
      },
      {
        txt: "其他基本保险",
        id: "S9419"
      },
      {
        txt: "补充保险",
        id: "S9420"
      },
      {
        txt: "其他社会保障",
        id: "S9490"
      },
      {
        txt: "工会",
        id: "S9511"
      },
      {
        txt: "妇联",
        id: "S9512"
      },
      {
        txt: "共青团",
        id: "S9513"
      },
      {
        txt: "其他群众团体",
        id: "S9519"
      },
      {
        txt: "专业性团体",
        id: "S9521"
      },
      {
        txt: "行业性团体",
        id: "S9522"
      },
      {
        txt: "其他社会团体",
        id: "S9529"
      },
      {
        txt: "基金会",
        id: "S9530"
      },
      {
        txt: "宗教团体服务",
        id: "S9541"
      },
      {
        txt: "宗教活动场所服务",
        id: "S9542"
      },
      {
        txt: "社区居民自治组织",
        id: "S9610"
      },
      {
        txt: "村民自治组织",
        id: "S9620"
      },
      {
        txt: "国际组织",
        id: "T9700"
      },
    ],
    cardTypeList: [{
        id: "021",
        text: "第二代居民身份证"
      },
      {
        id: "031",
        text: "临时身份证"
      },
      {
        id: "042",
        text: "中国护照"
      },
      {
        id: "155",
        text: "香港通行证"
      },
      {
        id: "165",
        text: "澳门通行证"
      },
      {
        id: "175",
        text: "台湾通行证或有效旅行证件"
      },
      {
        id: "18A",
        text: "外国人永久居留证"
      },
      {
        id: "202",
        text: "外国护照"
      },
    ],
    tradeTypeList: [{
        txt: "农、林、牧、渔业",
        id: "A",
        child: [{
            txt: "农、林、牧、渔专业及辅助性活动",
            id: "A05",
            child: [{
                txt: "农业专业及辅助性活动",
                id: "A051",
                child: [{
                    txt: "种子种苗培育活动",
                    id: "A0511",
                  },
                  {
                    txt: "农业机械活动",
                    id: "A0512",
                  },
                  {
                    txt: "灌溉活动",
                    id: "A0513",
                  },
                  {
                    txt: "农产品初加工活动",
                    id: "A0514",
                  },
                  {
                    txt: "农作物病虫害防治活动",
                    id: "A0515",
                  },
                  {
                    txt: "其他农业专业及辅助性活动",
                    id: "A0519",
                  },
                ],
              },
              {
                txt: "林业专业及辅助性活动",
                id: "A052",
                child: [{
                    txt: "林业有害生物防治活动",
                    id: "A0521",
                  },
                  {
                    txt: "森林防火服务活动",
                    id: "A0522",
                  },
                  {
                    txt: "林产品初级加工活动",
                    id: "A0523",
                  },
                  {
                    txt: "其他林业专业及辅助性活动",
                    id: "A0529",
                  },
                ],
              },
              {
                txt: "畜牧专业及辅助性活动",
                id: "A053",
                child: [{
                    txt: "畜牧良种繁殖活动",
                    id: "A0531",
                  },
                  {
                    txt: "畜禽粪污处理活动",
                    id: "A0532",
                  },
                  {
                    txt: "其他畜牧专业及辅助性活动",
                    id: "A0539",
                  },
                ],
              },
              {
                txt: "渔业专业及辅助性活动",
                id: "A054",
                child: [{
                    txt: "鱼苗及鱼种场活动",
                    id: "A0541",
                  },
                  {
                    txt: "其他渔业专业及辅助性活动",
                    id: "A0549",
                  },
                ],
              },
            ],
          },
          {
            txt: "农业",
            id: "A01",
            child: [{
                txt: "谷物种植",
                id: "A011",
                child: [{
                    txt: "稻谷种植",
                    id: "A0111",
                  },
                  {
                    txt: "小麦种植",
                    id: "A0112",
                  },
                  {
                    txt: "玉米种植",
                    id: "A0113",
                  },
                  {
                    txt: "其他谷物种植",
                    id: "A0119",
                  },
                ],
              },
              {
                txt: "豆类、油料和薯类种植",
                id: "A012",
                child: [{
                    txt: "豆类种植",
                    id: "A0121",
                  },
                  {
                    txt: "油料种植",
                    id: "A0122",
                  },
                  {
                    txt: "薯类种植",
                    id: "A0123",
                  },
                ],
              },
              {
                txt: "棉、麻、糖、烟草种植",
                id: "A013",
                child: [{
                    txt: "棉花种植",
                    id: "A0131",
                  },
                  {
                    txt: "麻类种植",
                    id: "A0132",
                  },
                  {
                    txt: "糖料种植",
                    id: "A0133",
                  },
                  {
                    txt: "烟草种植",
                    id: "A0134",
                  },
                ],
              },
              {
                txt: "蔬菜、食用菌及园艺作物种植",
                id: "A014",
                child: [{
                    txt: "蔬菜种植",
                    id: "A0141",
                  },
                  {
                    txt: "食用菌种植",
                    id: "A0142",
                  },
                  {
                    txt: "花卉种植",
                    id: "A0143",
                  },
                  {
                    txt: "其他园艺作物种植",
                    id: "A0149",
                  },
                ],
              },
              {
                txt: "水果种植",
                id: "A015",
                child: [{
                    txt: "仁果类和核果类水果种植",
                    id: "A0151",
                  },
                  {
                    txt: "葡萄种植",
                    id: "A0152",
                  },
                  {
                    txt: "柑橘类种植",
                    id: "A0153",
                  },
                  {
                    txt: "香蕉等亚热带水果种植",
                    id: "A0154",
                  },
                  {
                    txt: "其他水果种植",
                    id: "A0159",
                  },
                ],
              },
              {
                txt: "坚果、含油果、香料和饮料作物种植",
                id: "A016",
                child: [{
                    txt: "坚果种植",
                    id: "A0161",
                  },
                  {
                    txt: "含油果种植",
                    id: "A0162",
                  },
                  {
                    txt: "香料作物种植",
                    id: "A0163",
                  },
                  {
                    txt: "茶叶种植",
                    id: "A0164",
                  },
                  {
                    txt: "其他饮料作物种植",
                    id: "A0169",
                  },
                ],
              },
              {
                txt: "中药材种植",
                id: "A017",
                child: [{
                    txt: "中草药种植",
                    id: "A0171",
                  },
                  {
                    txt: "其他中药材种植",
                    id: "A0179",
                  },
                ],
              },
              {
                txt: "草种植及割草",
                id: "A018",
                child: [{
                    txt: "草种植",
                    id: "A0181",
                  },
                  {
                    txt: "天然草原割草",
                    id: "A0182",
                  },
                ],
              },
              {
                txt: "其他农业",
                id: "A019",
                child: [{
                  txt: "其他农业",
                  id: "A0190",
                }, ],
              },
            ],
          },
          {
            txt: "林业",
            id: "A02",
            child: [{
                txt: "林木育种和育苗",
                id: "A021",
                child: [{
                    txt: "林木育种",
                    id: "A0211",
                  },
                  {
                    txt: "林木育苗",
                    id: "A0212",
                  },
                ],
              },
              {
                txt: "造林和更新",
                id: "A022",
                child: [{
                  txt: "造林和更新",
                  id: "A0220",
                }, ],
              },
              {
                txt: "森林经营、管护和改培",
                id: "A023",
                child: [{
                    txt: "森林经营和管护",
                    id: "A0231",
                  },
                  {
                    txt: "森林改培",
                    id: "A0232",
                  },
                ],
              },
              {
                txt: "木材和竹材采运",
                id: "A024",
                child: [{
                    txt: "木材采运",
                    id: "A0241",
                  },
                  {
                    txt: "竹材采运",
                    id: "A0242",
                  },
                ],
              },
              {
                txt: "林产品采集",
                id: "A025",
                child: [{
                    txt: "木竹材林产品采集",
                    id: "A0251",
                  },
                  {
                    txt: "非木竹材林产品采集",
                    id: "A0252",
                  },
                ],
              },
            ],
          },
          {
            txt: "畜牧业",
            id: "A03",
            child: [{
                txt: "牲畜饲养",
                id: "A031",
                child: [{
                    txt: "牛的饲养",
                    id: "A0311",
                  },
                  {
                    txt: "马的饲养",
                    id: "A0312",
                  },
                  {
                    txt: "猪的饲养",
                    id: "A0313",
                  },
                  {
                    txt: "羊的饲养",
                    id: "A0314",
                  },
                  {
                    txt: "骆驼饲养",
                    id: "A0315",
                  },
                  {
                    txt: "其他牲畜饲养",
                    id: "A0319",
                  },
                ],
              },
              {
                txt: "家禽饲养",
                id: "A032",
                child: [{
                    txt: "鸡的饲养",
                    id: "A0321",
                  },
                  {
                    txt: "鸭的饲养",
                    id: "A0322",
                  },
                  {
                    txt: "鹅的饲养",
                    id: "A0323",
                  },
                  {
                    txt: "其他家禽饲养",
                    id: "A0329",
                  },
                ],
              },
              {
                txt: "狩猎和捕捉动物",
                id: "A033",
                child: [{
                  txt: "狩猎和捕捉动物",
                  id: "A0330",
                }, ],
              },
              {
                txt: "其他畜牧业",
                id: "A039",
                child: [{
                    txt: "兔的饲养",
                    id: "A0391",
                  },
                  {
                    txt: "蜜蜂饲养",
                    id: "A0392",
                  },
                  {
                    txt: "其他未列明畜牧业",
                    id: "A0399",
                  },
                ],
              },
            ],
          },
          {
            txt: "渔业",
            id: "A04",
            child: [{
                txt: "水产养殖",
                id: "A041",
                child: [{
                    txt: "海水养殖",
                    id: "A0411",
                  },
                  {
                    txt: "内陆养殖",
                    id: "A0412",
                  },
                ],
              },
              {
                txt: "水产捕捞",
                id: "A042",
                child: [{
                    txt: "海水捕捞",
                    id: "A0421",
                  },
                  {
                    txt: "内陆捕捞",
                    id: "A0422",
                  },
                ],
              },
            ],
          },
        ],
      },
      {
        txt: "采矿业",
        id: "B",
        child: [{
            txt: "煤炭开采和洗选业",
            id: "B06",
            child: [{
                txt: "烟煤和无烟煤开采洗选",
                id: "B061",
                child: [{
                  txt: "烟煤和无烟煤开采洗选",
                  id: "B0610",
                }, ],
              },
              {
                txt: "褐煤开采洗选",
                id: "B062",
                child: [{
                  txt: "褐煤开采洗选",
                  id: "B0620",
                }, ],
              },
              {
                txt: "其他煤炭采选",
                id: "B069",
                child: [{
                  txt: "其他煤炭采选",
                  id: "B0690",
                }, ],
              },
            ],
          },
          {
            txt: "石油和天然气开采业",
            id: "B07",
            child: [{
                txt: "石油开采",
                id: "B071",
                child: [{
                    txt: "陆地石油开采",
                    id: "B0711",
                  },
                  {
                    txt: "海洋石油开采",
                    id: "B0712",
                  },
                ],
              },
              {
                txt: "天然气开采",
                id: "B072",
                child: [{
                    txt: "陆地天然气开采",
                    id: "B0721",
                  },
                  {
                    txt: "海洋天然气及可燃冰开采",
                    id: "B0722",
                  },
                ],
              },
            ],
          },
          {
            txt: "黑色金属矿采选业",
            id: "B08",
            child: [{
                txt: "铁矿采选",
                id: "B081",
                child: [{
                  txt: "铁矿采选",
                  id: "B0810",
                }, ],
              },
              {
                txt: "锰矿、铬矿采选",
                id: "B082",
                child: [{
                  txt: "锰矿、铬矿采选",
                  id: "B0820",
                }, ],
              },
              {
                txt: "其他黑色金属矿采选",
                id: "B089",
                child: [{
                  txt: "其他黑色金属矿采选",
                  id: "B0890",
                }, ],
              },
            ],
          },
          {
            txt: "有色金属矿采选业",
            id: "B09",
            child: [{
                txt: "常用有色金属矿采选",
                id: "B091",
                child: [{
                    txt: "铜矿采选",
                    id: "B0911",
                  },
                  {
                    txt: "铅锌矿采选",
                    id: "B0912",
                  },
                  {
                    txt: "镍钴矿采选",
                    id: "B0913",
                  },
                  {
                    txt: "锡矿采选",
                    id: "B0914",
                  },
                  {
                    txt: "锑矿采选",
                    id: "B0915",
                  },
                  {
                    txt: "铝矿采选",
                    id: "B0916",
                  },
                  {
                    txt: "镁矿采选",
                    id: "B0917",
                  },
                  {
                    txt: "其他常用有色金属矿采选",
                    id: "B0919",
                  },
                ],
              },
              {
                txt: "贵金属矿采选",
                id: "B092",
                child: [{
                    txt: "金矿采选",
                    id: "B0921",
                  },
                  {
                    txt: "银矿采选",
                    id: "B0922",
                  },
                  {
                    txt: "其他贵金属矿采选",
                    id: "B0929",
                  },
                ],
              },
              {
                txt: "稀有稀土金属矿采选",
                id: "B093",
                child: [{
                    txt: "钨钼矿采选",
                    id: "B0931",
                  },
                  {
                    txt: "稀土金属矿采选",
                    id: "B0932",
                  },
                  {
                    txt: "放射性金属矿采选",
                    id: "B0933",
                  },
                  {
                    txt: "其他稀有金属矿采选",
                    id: "B0939",
                  },
                ],
              },
            ],
          },
          {
            txt: "非金属矿采选业",
            id: "B10",
            child: [{
                txt: "土砂石开采",
                id: "B101",
                child: [{
                    txt: "石灰石、石膏开采",
                    id: "B1011",
                  },
                  {
                    txt: "建筑装饰用石开采",
                    id: "B1012",
                  },
                  {
                    txt: "耐火土石开采",
                    id: "B1013",
                  },
                  {
                    txt: "粘土及其他土砂石开采",
                    id: "B1019",
                  },
                ],
              },
              {
                txt: "化学矿开采",
                id: "B102",
                child: [{
                  txt: "化学矿开采",
                  id: "B1020",
                }, ],
              },
              {
                txt: "采盐",
                id: "B103",
                child: [{
                  txt: "采盐",
                  id: "B1030",
                }, ],
              },
              {
                txt: "石棉及其他非金属矿采选",
                id: "B109",
                child: [{
                    txt: "石棉、云母矿采选",
                    id: "B1091",
                  },
                  {
                    txt: "石墨、滑石采选",
                    id: "B1092",
                  },
                  {
                    txt: "宝石、玉石采选",
                    id: "B1093",
                  },
                  {
                    txt: "其他未列明非金属矿采选",
                    id: "B1099",
                  },
                ],
              },
            ],
          },
          {
            txt: "开采辅助活动",
            id: "B11",
            child: [{
                txt: "煤炭开采和洗选辅助活动",
                id: "B111",
                child: [{
                  txt: "煤炭开采和洗选辅助活动",
                  id: "B1110",
                }, ],
              },
              {
                txt: "石油和天然气开采辅助活动",
                id: "B112",
                child: [{
                  txt: "石油和天然气开采辅助活动",
                  id: "B1120",
                }, ],
              },
              {
                txt: "其他开采辅助活动",
                id: "B119",
                child: [{
                  txt: "其他开采辅助活动",
                  id: "B1190",
                }, ],
              },
            ],
          },
          {
            txt: "其他采矿业",
            id: "B12",
            child: [{
              txt: "其他采矿业",
              id: "B120",
              child: [{
                txt: "其他采矿业",
                id: "B1200",
              }, ],
            }, ],
          },
        ],
      },
      {
        txt: "制造业",
        id: "C",
        child: [{
            txt: "汽车制造业",
            id: "C36",
            child: [{
                txt: "汽车整车制造",
                id: "C361",
                child: [{
                    txt: "汽柴油车整车制造",
                    id: "C3611",
                  },
                  {
                    txt: "新能源车整车制造",
                    id: "C3612",
                  },
                ],
              },
              {
                txt: "汽车用发动机制造",
                id: "C362",
                child: [{
                  txt: "汽车用发动机制造",
                  id: "C3620",
                }, ],
              },
              {
                txt: "改装汽车制造",
                id: "C363",
                child: [{
                  txt: "改装汽车制造",
                  id: "C3630",
                }, ],
              },
              {
                txt: "低速汽车制造",
                id: "C364",
                child: [{
                  txt: "低速汽车制造",
                  id: "C3640",
                }, ],
              },
              {
                txt: "电车制造",
                id: "C365",
                child: [{
                  txt: "电车制造",
                  id: "C3650",
                }, ],
              },
              {
                txt: "汽车车身、挂车制造",
                id: "C366",
                child: [{
                  txt: "汽车车身、挂车制造",
                  id: "C3660",
                }, ],
              },
              {
                txt: "汽车零部件及配件制造",
                id: "C367",
                child: [{
                  txt: "汽车零部件及配件制造",
                  id: "C3670",
                }, ],
              },
            ],
          },
          {
            txt: "铁路、船舶、航空航天和其他运输设备制造业",
            id: "C37",
            child: [{
                txt: "铁路运输设备制造",
                id: "C371",
                child: [{
                    txt: "高铁车组制造",
                    id: "C3711",
                  },
                  {
                    txt: "铁路机车车辆制造",
                    id: "C3712",
                  },
                  {
                    txt: "窄轨机车车辆制造",
                    id: "C3713",
                  },
                  {
                    txt: "高铁设备、配件制造",
                    id: "C3714",
                  },
                  {
                    txt: "铁路机车车辆配件制造",
                    id: "C3715",
                  },
                  {
                    txt: "铁路专用设备及器材、配件制造",
                    id: "C3716",
                  },
                  {
                    txt: "其他铁路运输设备制造",
                    id: "C3719",
                  },
                ],
              },
              {
                txt: "城市轨道交通设备制造",
                id: "C372",
                child: [{
                  txt: "城市轨道交通设备制造",
                  id: "C3720",
                }, ],
              },
              {
                txt: "船舶及相关装置制造",
                id: "C373",
                child: [{
                    txt: "金属船舶制造",
                    id: "C3731",
                  },
                  {
                    txt: "非金属船舶制造",
                    id: "C3732",
                  },
                  {
                    txt: "娱乐船和运动船制造",
                    id: "C3733",
                  },
                  {
                    txt: "船用配套设备制造",
                    id: "C3734",
                  },
                  {
                    txt: "船舶改装",
                    id: "C3735",
                  },
                  {
                    txt: "船舶拆除",
                    id: "C3736",
                  },
                  {
                    txt: "海洋工程装备制造",
                    id: "C3737",
                  },
                  {
                    txt: "航标器材及其他相关装置制造",
                    id: "C3739",
                  },
                ],
              },
              {
                txt: "航空、航天器及设备制造",
                id: "C374",
                child: [{
                    txt: "飞机制造",
                    id: "C3741",
                  },
                  {
                    txt: "航天器及运载火箭制造",
                    id: "C3742",
                  },
                  {
                    txt: "航天相关设备制造",
                    id: "C3743",
                  },
                  {
                    txt: "航空相关设备制造",
                    id: "C3744",
                  },
                  {
                    txt: "其他航空航天器制造",
                    id: "C3749",
                  },
                ],
              },
              {
                txt: "摩托车制造",
                id: "C375",
                child: [{
                    txt: "摩托车整车制造",
                    id: "C3751",
                  },
                  {
                    txt: "摩托车零部件及配件制造",
                    id: "C3752",
                  },
                ],
              },
              {
                txt: "自行车和残疾人座车制造",
                id: "C376",
                child: [{
                    txt: "自行车制造",
                    id: "C3761",
                  },
                  {
                    txt: "残疾人座车制造",
                    id: "C3762",
                  },
                ],
              },
              {
                txt: "助动车制造",
                id: "C377",
                child: [{
                  txt: "助动车制造",
                  id: "C3770",
                }, ],
              },
              {
                txt: "非公路休闲车及零配件制造",
                id: "C378",
                child: [{
                  txt: "非公路休闲车及零配件制造",
                  id: "C3780",
                }, ],
              },
              {
                txt: "潜水救捞及其他未列明运输设备制造",
                id: "C379",
                child: [{
                    txt: "潜水装备制造",
                    id: "C3791",
                  },
                  {
                    txt: "水下救捞装备制造",
                    id: "C3792",
                  },
                  {
                    txt: "其他未列明运输设备制造",
                    id: "C3799",
                  },
                ],
              },
            ],
          },
          {
            txt: "电气机械和器材制造业",
            id: "C38",
            child: [{
                txt: "电机制造",
                id: "C381",
                child: [{
                    txt: "发电机及发电机组制造",
                    id: "C3811",
                  },
                  {
                    txt: "电动机制造",
                    id: "C3812",
                  },
                  {
                    txt: "微特电机及组件制造",
                    id: "C3813",
                  },
                  {
                    txt: "其他电机制造",
                    id: "C3819",
                  },
                ],
              },
              {
                txt: "输配电及控制设备制造",
                id: "C382",
                child: [{
                    txt: "变压器、整流器和电感器制造",
                    id: "C3821",
                  },
                  {
                    txt: "电容器及其配套设备制造",
                    id: "C3822",
                  },
                  {
                    txt: "配电开关控制设备制造",
                    id: "C3823",
                  },
                  {
                    txt: "电力电子元器件制造",
                    id: "C3824",
                  },
                  {
                    txt: "光伏设备及元器件制造",
                    id: "C3825",
                  },
                  {
                    txt: "其他输配电及控制设备制造",
                    id: "C3829",
                  },
                ],
              },
              {
                txt: "电线、电缆、光缆及电工器材制造",
                id: "C383",
                child: [{
                    txt: "电线、电缆制造",
                    id: "C3831",
                  },
                  {
                    txt: "光纤制造",
                    id: "C3832",
                  },
                  {
                    txt: "光缆制造",
                    id: "C3833",
                  },
                  {
                    txt: "绝缘制品制造",
                    id: "C3834",
                  },
                  {
                    txt: "其他电工器材制造",
                    id: "C3839",
                  },
                ],
              },
              {
                txt: "电池制造",
                id: "C384",
                child: [{
                    txt: "锂离子电池制造",
                    id: "C3841",
                  },
                  {
                    txt: "镍氢电池制造",
                    id: "C3842",
                  },
                  {
                    txt: "铅蓄电池制造",
                    id: "C3843",
                  },
                  {
                    txt: "锌锰电池制造",
                    id: "C3844",
                  },
                  {
                    txt: "其他电池制造",
                    id: "C3849",
                  },
                ],
              },
              {
                txt: "家用电力器具制造",
                id: "C385",
                child: [{
                    txt: "家用制冷电器具制造",
                    id: "C3851",
                  },
                  {
                    txt: "家用空气调节器制造",
                    id: "C3852",
                  },
                  {
                    txt: "家用通风电器具制造",
                    id: "C3853",
                  },
                  {
                    txt: "家用厨房电器具制造",
                    id: "C3854",
                  },
                  {
                    txt: "家用清洁卫生电器具制造",
                    id: "C3855",
                  },
                  {
                    txt: "家用美容、保健护理电器具制造",
                    id: "C3856",
                  },
                  {
                    txt: "家用电力器具专用配件制造",
                    id: "C3857",
                  },
                  {
                    txt: "其他家用电力器具制造",
                    id: "C3859",
                  },
                ],
              },
              {
                txt: "非电力家用器具制造",
                id: "C386",
                child: [{
                    txt: "燃气及类似能源家用器具制造",
                    id: "C3861",
                  },
                  {
                    txt: "太阳能器具制造 ",
                    id: "C3862",
                  },
                  {
                    txt: "其他非电力家用器具制造",
                    id: "C3869",
                  },
                ],
              },
              {
                txt: "照明器具制造",
                id: "C387",
                child: [{
                    txt: "电光源制造",
                    id: "C3871",
                  },
                  {
                    txt: "照明灯具制造",
                    id: "C3872",
                  },
                  {
                    txt: "舞台及场地用灯制造",
                    id: "C3873",
                  },
                  {
                    txt: "智能照明器具制造",
                    id: "C3874",
                  },
                  {
                    txt: "灯用电器附件及其他照明器具制造",
                    id: "C3879",
                  },
                ],
              },
              {
                txt: "其他电气机械及器材制造",
                id: "C389",
                child: [{
                    txt: "电气信号设备装置制造",
                    id: "C3891",
                  },
                  {
                    txt: "其他未列明电气机械及器材制造",
                    id: "C3899",
                  },
                ],
              },
            ],
          },
          {
            txt: "计算机、通信和其他电子设备制造业",
            id: "C39",
            child: [{
                txt: "计算机制造",
                id: "C391",
                child: [{
                    txt: "计算机整机制造",
                    id: "C3911",
                  },
                  {
                    txt: "计算机零部件制造",
                    id: "C3912",
                  },
                  {
                    txt: "计算机外围设备制造",
                    id: "C3913",
                  },
                  {
                    txt: "工业控制计算机及系统制造",
                    id: "C3914",
                  },
                  {
                    txt: "信息安全设备制造",
                    id: "C3915",
                  },
                  {
                    txt: "其他计算机制造",
                    id: "C3919",
                  },
                ],
              },
              {
                txt: "通信设备制造",
                id: "C392",
                child: [{
                    txt: "通信系统设备制造",
                    id: "C3921",
                  },
                  {
                    txt: "通信终端设备制造",
                    id: "C3922",
                  },
                ],
              },
              {
                txt: "广播电视设备制造",
                id: "C393",
                child: [{
                    txt: "广播电视节目制作及发射设备制造",
                    id: "C3931",
                  },
                  {
                    txt: "广播电视接收设备制造",
                    id: "C3932",
                  },
                  {
                    txt: "广播电视专用配件制造",
                    id: "C3933",
                  },
                  {
                    txt: "专业音响设备制造",
                    id: "C3934",
                  },
                  {
                    txt: "应用电视设备及其他广播电视设备制造",
                    id: "C3939",
                  },
                ],
              },
              {
                txt: "雷达及配套设备制造",
                id: "C394",
                child: [{
                  txt: "雷达及配套设备制造",
                  id: "C3940",
                }, ],
              },
              {
                txt: "视听设备制造",
                id: "C395",
                child: [{
                    txt: "电视机制造",
                    id: "C3951",
                  },
                  {
                    txt: "音响设备制造",
                    id: "C3952",
                  },
                  {
                    txt: "影视录放设备制造",
                    id: "C3953",
                  },
                ],
              },
              {
                txt: "智能消费设备制造",
                id: "C396",
                child: [{
                    txt: "可穿戴智能设备制造",
                    id: "C3961",
                  },
                  {
                    txt: "智能车载设备制造",
                    id: "C3962",
                  },
                  {
                    txt: "智能无人飞行器制造",
                    id: "C3963",
                  },
                  {
                    txt: "服务消费机器人制造",
                    id: "C3964",
                  },
                  {
                    txt: "其他智能消费设备制造",
                    id: "C3969",
                  },
                ],
              },
              {
                txt: "电子器件制造",
                id: "C397",
                child: [{
                    txt: "电子真空器件制造",
                    id: "C3971",
                  },
                  {
                    txt: "半导体分立器件制造",
                    id: "C3972",
                  },
                  {
                    txt: "集成电路制造",
                    id: "C3973",
                  },
                  {
                    txt: "显示器件制造",
                    id: "C3974",
                  },
                  {
                    txt: "半导体照明器件制造",
                    id: "C3975",
                  },
                  {
                    txt: "光电子器件制造",
                    id: "C3976",
                  },
                  {
                    txt: "其他电子器件制造",
                    id: "C3979",
                  },
                ],
              },
              {
                txt: "电子元件及电子专用材料制造",
                id: "C398",
                child: [{
                    txt: "电阻电容电感元件制造",
                    id: "C3981",
                  },
                  {
                    txt: "电子电路制造",
                    id: "C3982",
                  },
                  {
                    txt: "敏感元件及传感器制造",
                    id: "C3983",
                  },
                  {
                    txt: "电声器件及零件制造",
                    id: "C3984",
                  },
                  {
                    txt: "电子专用材料制造",
                    id: "C3985",
                  },
                  {
                    txt: "其他电子元件制造",
                    id: "C3989",
                  },
                ],
              },
              {
                txt: "其他电子设备制造",
                id: "C399",
                child: [{
                  txt: "其他电子设备制造",
                  id: "C3990",
                }, ],
              },
            ],
          },
          {
            txt: "专用设备制造业",
            id: "C35",
            child: [{
                txt: "医疗仪器设备及器械制造",
                id: "C358",
                child: [{
                    txt: "医疗诊断、监护及治疗设备制造",
                    id: "C3581",
                  },
                  {
                    txt: "口腔科用设备及器具制造",
                    id: "C3582",
                  },
                  {
                    txt: "医疗实验室及医用消毒设备和器具制造",
                    id: "C3583",
                  },
                  {
                    txt: "医疗、外科及兽医用器械制造",
                    id: "C3584",
                  },
                  {
                    txt: "机械治疗及病房护理设备制造",
                    id: "C3585",
                  },
                  {
                    txt: "康复辅具制造",
                    id: "C3586",
                  },
                  {
                    txt: "眼镜制造",
                    id: "C3587",
                  },
                  {
                    txt: "其他医疗设备及器械制造",
                    id: "C3589",
                  },
                ],
              },
              {
                txt: "环保、社会公共服务及其他专用设备制造",
                id: "C359",
                child: [{
                    txt: "环境保护专用设备制造",
                    id: "C3591",
                  },
                  {
                    txt: "地质勘查专用设备制造",
                    id: "C3592",
                  },
                  {
                    txt: "邮政专用机械及器材制造",
                    id: "C3593",
                  },
                  {
                    txt: "商业、饮食、服务专用设备制造",
                    id: "C3594",
                  },
                  {
                    txt: "社会公共安全设备及器材制造",
                    id: "C3595",
                  },
                  {
                    txt: "交通安全、管制及类似专用设备制造",
                    id: "C3596",
                  },
                  {
                    txt: "水资源专用机械制造",
                    id: "C3597",
                  },
                  {
                    txt: "其他专用设备制造",
                    id: "C3599",
                  },
                ],
              },
              {
                txt: "采矿、冶金、建筑专用设备制造",
                id: "C351",
                child: [{
                    txt: "矿山机械制造",
                    id: "C3511",
                  },
                  {
                    txt: "石油钻采专用设备制造",
                    id: "C3512",
                  },
                  {
                    txt: "深海石油钻探设备制造",
                    id: "C3513",
                  },
                  {
                    txt: "建筑工程用机械制造",
                    id: "C3514",
                  },
                  {
                    txt: "建筑材料生产专用机械制造",
                    id: "C3515",
                  },
                  {
                    txt: "冶金专用设备制造",
                    id: "C3516",
                  },
                  {
                    txt: "隧道施工专用机械制造",
                    id: "C3517",
                  },
                ],
              },
              {
                txt: "化工、木材、非金属加工专用设备制造",
                id: "C352",
                child: [{
                    txt: "炼油、化工生产专用设备制造",
                    id: "C3521",
                  },
                  {
                    txt: "橡胶加工专用设备制造",
                    id: "C3522",
                  },
                  {
                    txt: "塑料加工专用设备制造",
                    id: "C3523",
                  },
                  {
                    txt: "木材加工机械制造",
                    id: "C3524",
                  },
                  {
                    txt: "模具制造",
                    id: "C3525",
                  },
                  {
                    txt: "其他非金属加工专用设备制造",
                    id: "C3529",
                  },
                ],
              },
              {
                txt: "食品、饮料、烟草及饲料生产专用设备制造　　　",
                id: "C353",
                child: [{
                    txt: "食品、酒、饮料及茶生产专用设备制造",
                    id: "C3531",
                  },
                  {
                    txt: "农副食品加工专用设备制造",
                    id: "C3532",
                  },
                  {
                    txt: "烟草生产专用设备制造",
                    id: "C3533",
                  },
                  {
                    txt: "饲料生产专用设备制造",
                    id: "C3534",
                  },
                ],
              },
              {
                txt: "印刷、制药、日化及日用品生产专用设备制造",
                id: "C354",
                child: [{
                    txt: "制浆和造纸专用设备制造",
                    id: "C3541",
                  },
                  {
                    txt: "印刷专用设备制造",
                    id: "C3542",
                  },
                  {
                    txt: "日用化工专用设备制造",
                    id: "C3543",
                  },
                  {
                    txt: "制药专用设备制造",
                    id: "C3544",
                  },
                  {
                    txt: "照明器具生产专用设备制造",
                    id: "C3545",
                  },
                  {
                    txt: "玻璃、陶瓷和搪瓷制品生产专用设备制造",
                    id: "C3546",
                  },
                  {
                    txt: "其他日用品生产专用设备制造",
                    id: "C3549",
                  },
                ],
              },
              {
                txt: "纺织、服装和皮革加工专用设备制造",
                id: "C355",
                child: [{
                    txt: "纺织专用设备制造",
                    id: "C3551",
                  },
                  {
                    txt: "皮革、毛皮及其制品加工专用设备制造",
                    id: "C3552",
                  },
                  {
                    txt: "缝制机械制造",
                    id: "C3553",
                  },
                  {
                    txt: "洗涤机械制造",
                    id: "C3554",
                  },
                ],
              },
              {
                txt: "电子和电工机械专用设备制造",
                id: "C356",
                child: [{
                    txt: "电工机械专用设备制造",
                    id: "C3561",
                  },
                  {
                    txt: "半导体器件专用设备制造",
                    id: "C3562",
                  },
                  {
                    txt: "电子元器件与机电组件设备制造",
                    id: "C3563",
                  },
                  {
                    txt: "其他电子专用设备制造",
                    id: "C3569",
                  },
                ],
              },
              {
                txt: "农、林、牧、渔专用机械制造",
                id: "C357",
                child: [{
                    txt: "渔业机械制造",
                    id: "C3575",
                  },
                  {
                    txt: "农林牧渔机械配件制造",
                    id: "C3576",
                  },
                  {
                    txt: "棉花加工机械制造",
                    id: "C3577",
                  },
                  {
                    txt: "其他农、林、牧、渔业机械制造",
                    id: "C3579",
                  },
                  {
                    txt: "拖拉机制造",
                    id: "C3571",
                  },
                  {
                    txt: "机械化农业及园艺机具制造",
                    id: "C3572",
                  },
                  {
                    txt: "营林及木竹采伐机械制造",
                    id: "C3573",
                  },
                  {
                    txt: "畜牧机械制造",
                    id: "C3574",
                  },
                ],
              },
            ],
          },
          {
            txt: "纺织服装、服饰业",
            id: "C18",
            child: [{
                txt: "机织服装制造",
                id: "C181",
                child: [{
                    txt: "运动机织服装制造",
                    id: "C1811",
                  },
                  {
                    txt: "其他机织服装制造",
                    id: "C1819",
                  },
                ],
              },
              {
                txt: "针织或钩针编织服装制造",
                id: "C182",
                child: [{
                    txt: "运动休闲针织服装制造",
                    id: "C1821",
                  },
                  {
                    txt: "其他针织或钩针编织服装制造",
                    id: "C1829",
                  },
                ],
              },
              {
                txt: "服饰制造",
                id: "C183",
                child: [{
                  txt: "服饰制造",
                  id: "C1830",
                }, ],
              },
            ],
          },
          {
            txt: "皮革、毛皮、羽毛及其制品和制鞋业",
            id: "C19",
            child: [{
                txt: "皮革鞣制加工",
                id: "C191",
                child: [{
                  txt: "皮革鞣制加工",
                  id: "C1910",
                }, ],
              },
              {
                txt: "皮革制品制造",
                id: "C192",
                child: [{
                    txt: "皮革服装制造",
                    id: "C1921",
                  },
                  {
                    txt: "皮箱、包(袋)制造",
                    id: "C1922",
                  },
                  {
                    txt: "皮手套及皮装饰制品制造",
                    id: "C1923",
                  },
                  {
                    txt: "其他皮革制品制造",
                    id: "C1929",
                  },
                ],
              },
              {
                txt: "毛皮鞣制及制品加工",
                id: "C193",
                child: [{
                    txt: "毛皮鞣制加工",
                    id: "C1931",
                  },
                  {
                    txt: "毛皮服装加工",
                    id: "C1932",
                  },
                  {
                    txt: "其他毛皮制品加工",
                    id: "C1939",
                  },
                ],
              },
              {
                txt: "羽毛(绒)加工及制品制造",
                id: "C194",
                child: [{
                    txt: "羽毛(绒)加工",
                    id: "C1941",
                  },
                  {
                    txt: "羽毛(绒)制品加工",
                    id: "C1942",
                  },
                ],
              },
              {
                txt: "制鞋业",
                id: "C195",
                child: [{
                    txt: "纺织面料鞋制造",
                    id: "C1951",
                  },
                  {
                    txt: "皮鞋制造",
                    id: "C1952",
                  },
                  {
                    txt: "塑料鞋制造",
                    id: "C1953",
                  },
                  {
                    txt: "橡胶鞋制造",
                    id: "C1954",
                  },
                  {
                    txt: "其他制鞋业",
                    id: "C1959",
                  },
                ],
              },
            ],
          },
          {
            txt: "木材加工和木、竹、藤、棕、草制品业",
            id: "C20",
            child: [{
                txt: "木材加工",
                id: "C201",
                child: [{
                    txt: "锯材加工",
                    id: "C2011",
                  },
                  {
                    txt: "木片加工",
                    id: "C2012",
                  },
                  {
                    txt: "单板加工",
                    id: "C2013",
                  },
                  {
                    txt: "其他木材加工",
                    id: "C2019",
                  },
                ],
              },
              {
                txt: "人造板制造",
                id: "C202",
                child: [{
                    txt: "胶合板制造",
                    id: "C2021",
                  },
                  {
                    txt: "纤维板制造",
                    id: "C2022",
                  },
                  {
                    txt: "刨花板制造",
                    id: "C2023",
                  },
                  {
                    txt: "其他人造板制造",
                    id: "C2029",
                  },
                ],
              },
              {
                txt: "木制品制造",
                id: "C203",
                child: [{
                    txt: "建筑用木料及木材组件加工",
                    id: "C2031",
                  },
                  {
                    txt: "木门窗制造",
                    id: "C2032",
                  },
                  {
                    txt: "木楼梯制造",
                    id: "C2033",
                  },
                  {
                    txt: "木地板制造",
                    id: "C2034",
                  },
                  {
                    txt: "木制容器制造",
                    id: "C2035",
                  },
                  {
                    txt: "软木制品及其他木制品制造",
                    id: "C2039",
                  },
                ],
              },
              {
                txt: "竹、藤、棕、草等制品制造",
                id: "C204",
                child: [{
                    txt: "竹制品制造",
                    id: "C2041",
                  },
                  {
                    txt: "藤制品制造",
                    id: "C2042",
                  },
                  {
                    txt: "棕制品制造",
                    id: "C2043",
                  },
                  {
                    txt: "草及其他制品制造",
                    id: "C2049",
                  },
                ],
              },
            ],
          },
          {
            txt: "家具制造业",
            id: "C21",
            child: [{
                txt: "木质家具制造",
                id: "C211",
                child: [{
                  txt: "木质家具制造",
                  id: "C2110",
                }, ],
              },
              {
                txt: "竹、藤家具制造",
                id: "C212",
                child: [{
                  txt: "竹、藤家具制造",
                  id: "C2120",
                }, ],
              },
              {
                txt: "金属家具制造",
                id: "C213",
                child: [{
                  txt: "金属家具制造",
                  id: "C2130",
                }, ],
              },
              {
                txt: "塑料家具制造",
                id: "C214",
                child: [{
                  txt: "塑料家具制造",
                  id: "C2140",
                }, ],
              },
              {
                txt: "其他家具制造",
                id: "C219",
                child: [{
                  txt: "其他家具制造",
                  id: "C2190",
                }, ],
              },
            ],
          },
          {
            txt: "造纸和纸制品业",
            id: "C22",
            child: [{
                txt: "纸浆制造",
                id: "C221",
                child: [{
                    txt: "木竹浆制造",
                    id: "C2211",
                  },
                  {
                    txt: "非木竹浆制造",
                    id: "C2212",
                  },
                ],
              },
              {
                txt: "造纸",
                id: "C222",
                child: [{
                    txt: "机制纸及纸板制造",
                    id: "C2221",
                  },
                  {
                    txt: "手工纸制造",
                    id: "C2222",
                  },
                  {
                    txt: "加工纸制造",
                    id: "C2223",
                  },
                ],
              },
              {
                txt: "纸制品制造",
                id: "C223",
                child: [{
                    txt: "纸和纸板容器制造",
                    id: "C2231",
                  },
                  {
                    txt: "其他纸制品制造",
                    id: "C2239",
                  },
                ],
              },
            ],
          },
          {
            txt: "印刷和记录媒介复制业",
            id: "C23",
            child: [{
                txt: "印刷",
                id: "C231",
                child: [{
                    txt: "书、报刊印刷",
                    id: "C2311",
                  },
                  {
                    txt: "本册印制",
                    id: "C2312",
                  },
                  {
                    txt: "包装装潢及其他印刷",
                    id: "C2319",
                  },
                ],
              },
              {
                txt: "装订及印刷相关服务",
                id: "C232",
                child: [{
                  txt: "装订及印刷相关服务",
                  id: "C2320",
                }, ],
              },
              {
                txt: "记录媒介复制",
                id: "C233",
                child: [{
                  txt: "记录媒介复制",
                  id: "C2330",
                }, ],
              },
            ],
          },
          {
            txt: "文教、工美、体育和娱乐用品制造业",
            id: "C24",
            child: [{
                txt: "文教办公用品制造",
                id: "C241",
                child: [{
                    txt: "文具制造",
                    id: "C2411",
                  },
                  {
                    txt: "笔的制造",
                    id: "C2412",
                  },
                  {
                    txt: "教学用模型及教具制造",
                    id: "C2413",
                  },
                  {
                    txt: "墨水、墨汁制造",
                    id: "C2414",
                  },
                  {
                    txt: "其他文教办公用品制造",
                    id: "C2419",
                  },
                ],
              },
              {
                txt: "乐器制造",
                id: "C242",
                child: [{
                    txt: "中乐器制造",
                    id: "C2421",
                  },
                  {
                    txt: "西乐器制造",
                    id: "C2422",
                  },
                  {
                    txt: "电子乐器制造",
                    id: "C2423",
                  },
                  {
                    txt: "其他乐器及零件制造",
                    id: "C2429",
                  },
                ],
              },
              {
                txt: "工艺美术及礼仪用品制造",
                id: "C243",
                child: [{
                    txt: "雕塑工艺品制造",
                    id: "C2431",
                  },
                  {
                    txt: "金属工艺品制造",
                    id: "C2432",
                  },
                  {
                    txt: "漆器工艺品制造",
                    id: "C2433",
                  },
                  {
                    txt: "花画工艺品制造",
                    id: "C2434",
                  },
                  {
                    txt: "天然植物纤维编织工艺品制造",
                    id: "C2435",
                  },
                  {
                    txt: "抽纱刺绣工艺品制造",
                    id: "C2436",
                  },
                  {
                    txt: "地毯、挂毯制造",
                    id: "C2437",
                  },
                  {
                    txt: "珠宝首饰及有关物品制造",
                    id: "C2438",
                  },
                  {
                    txt: "其他工艺美术及礼仪用品制造",
                    id: "C2439",
                  },
                ],
              },
              {
                txt: "体育用品制造",
                id: "C244",
                child: [{
                    txt: "球类制造",
                    id: "C2441",
                  },
                  {
                    txt: "专项运动器材及配件制造",
                    id: "C2442",
                  },
                  {
                    txt: "健身器材制造",
                    id: "C2443",
                  },
                  {
                    txt: "运动防护用具制造",
                    id: "C2444",
                  },
                  {
                    txt: "其他体育用品制造",
                    id: "C2449",
                  },
                ],
              },
              {
                txt: "玩具制造",
                id: "C245",
                child: [{
                    txt: "电玩具制造",
                    id: "C2451",
                  },
                  {
                    txt: "塑胶玩具制造",
                    id: "C2452",
                  },
                  {
                    txt: "金属玩具制造",
                    id: "C2453",
                  },
                  {
                    txt: "弹射玩具制造",
                    id: "C2454",
                  },
                  {
                    txt: "娃娃玩具制造",
                    id: "C2455",
                  },
                  {
                    txt: "儿童乘骑玩耍的童车类产品制造",
                    id: "C2456",
                  },
                  {
                    txt: "其他玩具制造",
                    id: "C2459",
                  },
                ],
              },
              {
                txt: "游艺器材及娱乐用品制造",
                id: "C246",
                child: [{
                    txt: "露天游乐场所游乐设备制造",
                    id: "C2461",
                  },
                  {
                    txt: "游艺用品及室内游艺器材制造",
                    id: "C2462",
                  },
                  {
                    txt: "其他娱乐用品制造",
                    id: "C2469",
                  },
                ],
              },
            ],
          },
          {
            txt: "石油、煤炭及其他燃料加工业",
            id: "C25",
            child: [{
                txt: "精炼石油产品制造",
                id: "C251",
                child: [{
                    txt: "原油加工及石油制品制造",
                    id: "C2511",
                  },
                  {
                    txt: "其他原油制造",
                    id: "C2519",
                  },
                ],
              },
              {
                txt: "煤炭加工",
                id: "C252",
                child: [{
                    txt: "炼焦",
                    id: "C2521",
                  },
                  {
                    txt: "煤制合成气生产",
                    id: "C2522",
                  },
                  {
                    txt: "煤制液体燃料生产",
                    id: "C2523",
                  },
                  {
                    txt: "煤制品制造",
                    id: "C2524",
                  },
                  {
                    txt: "其他煤炭加工",
                    id: "C2529",
                  },
                ],
              },
              {
                txt: "核燃料加工",
                id: "C253",
                child: [{
                  txt: "核燃料加工",
                  id: "C2530",
                }, ],
              },
              {
                txt: "生物质燃料加工",
                id: "C254",
                child: [{
                    txt: "生物质液体燃料生产",
                    id: "C2541",
                  },
                  {
                    txt: "生物质致密成型燃料加工",
                    id: "C2542",
                  },
                ],
              },
            ],
          },
          {
            txt: "化学原料和化学制品制造业",
            id: "C26",
            child: [{
                txt: "基础化学原料制造",
                id: "C261",
                child: [{
                    txt: "无机酸制造",
                    id: "C2611",
                  },
                  {
                    txt: "无机碱制造",
                    id: "C2612",
                  },
                  {
                    txt: "无机盐制造",
                    id: "C2613",
                  },
                  {
                    txt: "有机化学原料制造",
                    id: "C2614",
                  },
                  {
                    txt: "其他基础化学原料制造",
                    id: "C2619",
                  },
                ],
              },
              {
                txt: "肥料制造",
                id: "C262",
                child: [{
                    txt: "氮肥制造",
                    id: "C2621",
                  },
                  {
                    txt: "磷肥制造",
                    id: "C2622",
                  },
                  {
                    txt: "钾肥制造",
                    id: "C2623",
                  },
                  {
                    txt: "复混肥料制造",
                    id: "C2624",
                  },
                  {
                    txt: "有机肥料及微生物肥料制造",
                    id: "C2625",
                  },
                  {
                    txt: "其他肥料制造",
                    id: "C2629",
                  },
                ],
              },
              {
                txt: "农药制造",
                id: "C263",
                child: [{
                    txt: "化学农药制造",
                    id: "C2631",
                  },
                  {
                    txt: "生物化学农药及微生物农药制造",
                    id: "C2632",
                  },
                ],
              },
              {
                txt: "涂料、油墨、颜料及类似产品制造",
                id: "C264",
                child: [{
                    txt: "涂料制造",
                    id: "C2641",
                  },
                  {
                    txt: "油墨及类似产品制造",
                    id: "C2642",
                  },
                  {
                    txt: "工业颜料制造",
                    id: "C2643",
                  },
                  {
                    txt: "工艺美术颜料制造",
                    id: "C2644",
                  },
                  {
                    txt: "染料制造",
                    id: "C2645",
                  },
                  {
                    txt: "密封用填料及类似品制造",
                    id: "C2646",
                  },
                ],
              },
              {
                txt: "合成材料制造",
                id: "C265",
                child: [{
                    txt: "初级形态塑料及合成树脂制造",
                    id: "C2651",
                  },
                  {
                    txt: "合成橡胶制造",
                    id: "C2652",
                  },
                  {
                    txt: "合成纤维单(聚合)体制造",
                    id: "C2653",
                  },
                  {
                    txt: "其他合成材料制造",
                    id: "C2659",
                  },
                ],
              },
              {
                txt: "专用化学产品制造",
                id: "C266",
                child: [{
                    txt: "化学试剂和助剂制造",
                    id: "C2661",
                  },
                  {
                    txt: "专项化学用品制造",
                    id: "C2662",
                  },
                  {
                    txt: "林产化学产品制造",
                    id: "C2663",
                  },
                  {
                    txt: "文化用信息化学品制造",
                    id: "C2664",
                  },
                  {
                    txt: "医学生产用信息化学品制造",
                    id: "C2665",
                  },
                  {
                    txt: "环境污染处理专用药剂材料制造",
                    id: "C2666",
                  },
                  {
                    txt: "动物胶制造",
                    id: "C2667",
                  },
                  {
                    txt: "其他专用化学产品制造",
                    id: "C2669",
                  },
                ],
              },
              {
                txt: "炸药、火工及焰火产品制造",
                id: "C267",
                child: [{
                    txt: "炸药及火工产品制造",
                    id: "C2671",
                  },
                  {
                    txt: "焰火、鞭炮产品制造",
                    id: "C2672",
                  },
                ],
              },
              {
                txt: "日用化学产品制造",
                id: "C268",
                child: [{
                    txt: "肥皂及洗涤剂制造",
                    id: "C2681",
                  },
                  {
                    txt: "化妆品制造",
                    id: "C2682",
                  },
                  {
                    txt: "口腔清洁用品制造",
                    id: "C2683",
                  },
                  {
                    txt: "香料、香精制造",
                    id: "C2684",
                  },
                  {
                    txt: "其他日用化学产品制造",
                    id: "C2689",
                  },
                ],
              },
            ],
          },
          {
            txt: "医药制造业",
            id: "C27",
            child: [{
                txt: "化学药品原料药制造",
                id: "C271",
                child: [{
                  txt: "化学药品原料药制造",
                  id: "C2710",
                }, ],
              },
              {
                txt: "化学药品制剂制造",
                id: "C272",
                child: [{
                  txt: "化学药品制剂制造",
                  id: "C2720",
                }, ],
              },
              {
                txt: "中药饮片加工",
                id: "C273",
                child: [{
                  txt: "中药饮片加工",
                  id: "C2730",
                }, ],
              },
              {
                txt: "中成药生产",
                id: "C274",
                child: [{
                  txt: "中成药生产",
                  id: "C2740",
                }, ],
              },
              {
                txt: "兽用药品制造",
                id: "C275",
                child: [{
                  txt: "兽用药品制造",
                  id: "C2750",
                }, ],
              },
              {
                txt: "生物药品制品制造",
                id: "C276",
                child: [{
                    txt: "生物药品制造",
                    id: "C2761",
                  },
                  {
                    txt: "基因工程药物和疫苗制造",
                    id: "C2762",
                  },
                ],
              },
              {
                txt: "卫生材料及医药用品制造",
                id: "C277",
                child: [{
                  txt: "卫生材料及医药用品制造",
                  id: "C2770",
                }, ],
              },
              {
                txt: "药用辅料及包装材料",
                id: "C278",
                child: [{
                  txt: "药用辅料及包装材料",
                  id: "C2780",
                }, ],
              },
            ],
          },
          {
            txt: "化学纤维制造业",
            id: "C28",
            child: [{
                txt: "纤维素纤维原料及纤维制造",
                id: "C281",
                child: [{
                    txt: "化纤浆粕制造",
                    id: "C2811",
                  },
                  {
                    txt: "人造纤维（纤维素纤维）制造",
                    id: "C2812",
                  },
                ],
              },
              {
                txt: "合成纤维制造",
                id: "C282",
                child: [{
                    txt: "锦纶纤维制造",
                    id: "C2821",
                  },
                  {
                    txt: "涤纶纤维制造",
                    id: "C2822",
                  },
                  {
                    txt: "腈纶纤维制造",
                    id: "C2823",
                  },
                  {
                    txt: "维纶纤维制造",
                    id: "C2824",
                  },
                  {
                    txt: "丙纶纤维制造",
                    id: "C2825",
                  },
                  {
                    txt: "氨纶纤维制造",
                    id: "C2826",
                  },
                  {
                    txt: "其他合成纤维制造",
                    id: "C2829",
                  },
                ],
              },
              {
                txt: "生物基材料制造",
                id: "C283",
                child: [{
                    txt: "生物基化学纤维制造",
                    id: "C2831",
                  },
                  {
                    txt: "生物基、淀粉基新材料制造",
                    id: "C2832",
                  },
                ],
              },
            ],
          },
          {
            txt: "橡胶和塑料制品业",
            id: "C29",
            child: [{
                txt: "橡胶制品业",
                id: "C291",
                child: [{
                    txt: "轮胎制造",
                    id: "C2911",
                  },
                  {
                    txt: "橡胶板、管、带制造",
                    id: "C2912",
                  },
                  {
                    txt: "橡胶零件制造",
                    id: "C2913",
                  },
                  {
                    txt: "再生橡胶制造",
                    id: "C2914",
                  },
                  {
                    txt: "日用及医用橡胶制品制造",
                    id: "C2915",
                  },
                  {
                    txt: "运动场地用塑胶制造",
                    id: "C2916",
                  },
                  {
                    txt: "其他橡胶制品制造",
                    id: "C2919",
                  },
                ],
              },
              {
                txt: "塑料制品业",
                id: "C292",
                child: [{
                    txt: "塑料薄膜制造",
                    id: "C2921",
                  },
                  {
                    txt: "塑料板、管、型材制造",
                    id: "C2922",
                  },
                  {
                    txt: "塑料丝、绳及编织品制造",
                    id: "C2923",
                  },
                  {
                    txt: "泡沫塑料制造",
                    id: "C2924",
                  },
                  {
                    txt: "塑料人造革、合成革制造",
                    id: "C2925",
                  },
                  {
                    txt: "塑料包装箱及容器制造",
                    id: "C2926",
                  },
                  {
                    txt: "日用塑料制品制造",
                    id: "C2927",
                  },
                  {
                    txt: "人造草坪制造",
                    id: "C2928",
                  },
                  {
                    txt: "塑料零件及其他塑料制品制造",
                    id: "C2929",
                  },
                ],
              },
            ],
          },
          {
            txt: "非金属矿物制品业",
            id: "C30",
            child: [{
                txt: "水泥、石灰和石膏制造",
                id: "C301",
                child: [{
                    txt: "水泥制造",
                    id: "C3011",
                  },
                  {
                    txt: "石灰和石膏制造",
                    id: "C3012",
                  },
                ],
              },
              {
                txt: "石膏、水泥制品及类似制品制造",
                id: "C302",
                child: [{
                    txt: "水泥制品制造",
                    id: "C3021",
                  },
                  {
                    txt: "砼结构构件制造",
                    id: "C3022",
                  },
                  {
                    txt: "石棉水泥制品制造",
                    id: "C3023",
                  },
                  {
                    txt: "轻质建筑材料制造",
                    id: "C3024",
                  },
                  {
                    txt: "其他水泥类似制品制造",
                    id: "C3029",
                  },
                ],
              },
              {
                txt: "砖瓦、石材等建筑材料制造",
                id: "C303",
                child: [{
                    txt: "粘土砖瓦及建筑砌块制造",
                    id: "C3031",
                  },
                  {
                    txt: "建筑用石加工",
                    id: "C3032",
                  },
                  {
                    txt: "防水建筑材料制造",
                    id: "C3033",
                  },
                  {
                    txt: "隔热和隔音材料制造",
                    id: "C3034",
                  },
                  {
                    txt: "其他建筑材料制造",
                    id: "C3039",
                  },
                ],
              },
              {
                txt: "玻璃制造",
                id: "C304",
                child: [{
                    txt: "平板玻璃制造",
                    id: "C3041",
                  },
                  {
                    txt: "特种玻璃制造",
                    id: "C3042",
                  },
                  {
                    txt: "其他玻璃制造",
                    id: "C3049",
                  },
                ],
              },
              {
                txt: "玻璃制品制造",
                id: "C305",
                child: [{
                    txt: "技术玻璃制品制造",
                    id: "C3051",
                  },
                  {
                    txt: "光学玻璃制造",
                    id: "C3052",
                  },
                  {
                    txt: "玻璃仪器制造",
                    id: "C3053",
                  },
                  {
                    txt: "日用玻璃制品制造",
                    id: "C3054",
                  },
                  {
                    txt: "玻璃包装容器制造",
                    id: "C3055",
                  },
                  {
                    txt: "玻璃保温容器制造",
                    id: "C3056",
                  },
                  {
                    txt: "制镜及类似品加工",
                    id: "C3057",
                  },
                  {
                    txt: "其他玻璃制品制造",
                    id: "C3059",
                  },
                ],
              },
              {
                txt: "玻璃纤维和玻璃纤维增强塑料制品制造",
                id: "C306",
                child: [{
                    txt: "玻璃纤维及制品制造",
                    id: "C3061",
                  },
                  {
                    txt: "玻璃纤维增强塑料制品制造",
                    id: "C3062",
                  },
                ],
              },
              {
                txt: "陶瓷制品制造",
                id: "C307",
                child: [{
                    txt: "建筑陶瓷制品制造",
                    id: "C3071",
                  },
                  {
                    txt: "卫生陶瓷制品制造",
                    id: "C3072",
                  },
                  {
                    txt: "特种陶瓷制品制造",
                    id: "C3073",
                  },
                  {
                    txt: "日用陶瓷制品制造",
                    id: "C3074",
                  },
                  {
                    txt: "陈设艺术陶瓷制造",
                    id: "C3075",
                  },
                  {
                    txt: "园艺陶瓷制造",
                    id: "C3076",
                  },
                  {
                    txt: "其他陶瓷制品制造",
                    id: "C3079",
                  },
                ],
              },
              {
                txt: "耐火材料制品制造",
                id: "C308",
                child: [{
                    txt: "石棉制品制造",
                    id: "C3081",
                  },
                  {
                    txt: "云母制品制造",
                    id: "C3082",
                  },
                  {
                    txt: "耐火陶瓷制品及其他耐火材料制造",
                    id: "C3089",
                  },
                ],
              },
              {
                txt: "石墨及其他非金属矿物制品制造",
                id: "C309",
                child: [{
                    txt: "石墨及碳素制品制造",
                    id: "C3091",
                  },
                  {
                    txt: "其他非金属矿物制品制造",
                    id: "C3099",
                  },
                ],
              },
            ],
          },
          {
            txt: "黑色金属冶炼和压延加工业",
            id: "C31",
            child: [{
                txt: "炼铁",
                id: "C311",
                child: [{
                  txt: "炼铁",
                  id: "C3110",
                }, ],
              },
              {
                txt: "炼钢",
                id: "C312",
                child: [{
                  txt: "炼钢",
                  id: "C3120",
                }, ],
              },
              {
                txt: "钢压延加工",
                id: "C313",
                child: [{
                  txt: "钢压延加工",
                  id: "C3130",
                }, ],
              },
              {
                txt: "铁合金冶炼",
                id: "C314",
                child: [{
                  txt: "铁合金冶炼",
                  id: "C3140",
                }, ],
              },
            ],
          },
          {
            txt: "有色金属冶炼和压延加工业",
            id: "C32",
            child: [{
                txt: "常用有色金属冶炼",
                id: "C321",
                child: [{
                    txt: "铜冶炼",
                    id: "C3211",
                  },
                  {
                    txt: "铅锌冶炼",
                    id: "C3212",
                  },
                  {
                    txt: "镍钴冶炼",
                    id: "C3213",
                  },
                  {
                    txt: "锡冶炼",
                    id: "C3214",
                  },
                  {
                    txt: "锑冶炼",
                    id: "C3215",
                  },
                  {
                    txt: "铝冶炼",
                    id: "C3216",
                  },
                  {
                    txt: "镁冶炼",
                    id: "C3217",
                  },
                  {
                    txt: "硅冶炼",
                    id: "C3218",
                  },
                  {
                    txt: "其他常用有色金属冶炼",
                    id: "C3219",
                  },
                ],
              },
              {
                txt: "贵金属冶炼",
                id: "C322",
                child: [{
                    txt: "金冶炼",
                    id: "C3221",
                  },
                  {
                    txt: "银冶炼",
                    id: "C3222",
                  },
                  {
                    txt: "其他贵金属冶炼",
                    id: "C3229",
                  },
                ],
              },
              {
                txt: "稀有稀土金属冶炼",
                id: "C323",
                child: [{
                    txt: "钨钼冶炼",
                    id: "C3231",
                  },
                  {
                    txt: "稀土金属冶炼",
                    id: "C3232",
                  },
                  {
                    txt: "其他稀有金属冶炼",
                    id: "C3239",
                  },
                ],
              },
              {
                txt: "有色金属合金制造",
                id: "C324",
                child: [{
                  txt: "有色金属合金制造",
                  id: "C3240",
                }, ],
              },
              {
                txt: "有色金属铸造",
                id: "C325",
                child: [{
                    txt: "铜压延加工",
                    id: "C3251",
                  },
                  {
                    txt: "铝压延加工",
                    id: "C3252",
                  },
                  {
                    txt: "贵金属压延加工",
                    id: "C3253",
                  },
                  {
                    txt: "稀有稀土金属压延加工",
                    id: "C3254",
                  },
                  {
                    txt: "其他有色金属压延加工",
                    id: "C3259",
                  },
                ],
              },
            ],
          },
          {
            txt: "金属制品业",
            id: "C33",
            child: [{
                txt: "结构性金属制品制造",
                id: "C331",
                child: [{
                    txt: "金属结构制造",
                    id: "C3311",
                  },
                  {
                    txt: "金属门窗制造",
                    id: "C3312",
                  },
                ],
              },
              {
                txt: "金属工具制造",
                id: "C332",
                child: [{
                    txt: "切削工具制造",
                    id: "C3321",
                  },
                  {
                    txt: "手工具制造",
                    id: "C3322",
                  },
                  {
                    txt: "农用及园林用金属工具制造",
                    id: "C3323",
                  },
                  {
                    txt: "刀剪及类似日用金属工具制造",
                    id: "C3324",
                  },
                  {
                    txt: "其他金属工具制造",
                    id: "C3329",
                  },
                ],
              },
              {
                txt: "集装箱及金属包装容器制造",
                id: "C333",
                child: [{
                    txt: "集装箱制造",
                    id: "C3331",
                  },
                  {
                    txt: "金属压力容器制造",
                    id: "C3332",
                  },
                  {
                    txt: "金属包装容器及材料制造",
                    id: "C3333",
                  },
                ],
              },
              {
                txt: "金属丝绳及其制品制造",
                id: "C334",
                child: [{
                  txt: "金属丝绳及其制品制造",
                  id: "C3340",
                }, ],
              },
              {
                txt: "建筑、安全用金属制品制造",
                id: "C335",
                child: [{
                    txt: "建筑、家具用金属配件制造",
                    id: "C3351",
                  },
                  {
                    txt: "建筑装饰及水暖管道零件制造",
                    id: "C3352",
                  },
                  {
                    txt: "安全、消防用金属制品制造",
                    id: "C3353",
                  },
                  {
                    txt: "其他建筑、安全用金属制品制造",
                    id: "C3359",
                  },
                ],
              },
              {
                txt: "金属表面处理及热处理加工",
                id: "C336",
                child: [{
                  txt: "金属表面处理及热处理加工",
                  id: "C3360",
                }, ],
              },
              {
                txt: "搪瓷制品制造",
                id: "C337",
                child: [{
                    txt: "生产专用搪瓷制品制造",
                    id: "C3371",
                  },
                  {
                    txt: "建筑装饰搪瓷制品制造",
                    id: "C3372",
                  },
                  {
                    txt: "搪瓷卫生洁具制造",
                    id: "C3373",
                  },
                  {
                    txt: "搪瓷日用品及其他搪瓷制品制造",
                    id: "C3379",
                  },
                ],
              },
              {
                txt: "金属制日用品制造",
                id: "C338",
                child: [{
                    txt: "金属制厨房用器具制造",
                    id: "C3381",
                  },
                  {
                    txt: "金属制餐具和器皿制造",
                    id: "C3382",
                  },
                  {
                    txt: "金属制卫生器具制造",
                    id: "C3383",
                  },
                  {
                    txt: "其他金属制日用品制造",
                    id: "C3389",
                  },
                ],
              },
              {
                txt: "锻造及其他金属制品制造",
                id: "C339",
                child: [{
                    txt: "黑色金属铸造",
                    id: "C3391",
                  },
                  {
                    txt: "有色金属铸造",
                    id: "C3392",
                  },
                  {
                    txt: "锻件及粉末冶金制品制造",
                    id: "C3393",
                  },
                  {
                    txt: "交通及公共管理用金属标牌制造",
                    id: "C3394",
                  },
                  {
                    txt: "其他未列明金属制品制造",
                    id: "C3399",
                  },
                ],
              },
            ],
          },
          {
            txt: "通用设备制造业",
            id: "C34",
            child: [{
                txt: "金属加工机械制造",
                id: "C342",
                child: [{
                    txt: "金属切削机床制造",
                    id: "C3421",
                  },
                  {
                    txt: "金属成形机床制造",
                    id: "C3422",
                  },
                  {
                    txt: "铸造机械制造",
                    id: "C3423",
                  },
                  {
                    txt: "金属切割及焊接设备制造",
                    id: "C3424",
                  },
                  {
                    txt: "机床功能部件及附件制造",
                    id: "C3425",
                  },
                  {
                    txt: "其他金属加工机械制造",
                    id: "C3429",
                  },
                ],
              },
              {
                txt: "物料搬运设备制造",
                id: "C343",
                child: [{
                    txt: "轻小型起重设备制造",
                    id: "C3431",
                  },
                  {
                    txt: "生产专用起重机制造",
                    id: "C3432",
                  },
                  {
                    txt: "生产专用车辆制造",
                    id: "C3433",
                  },
                  {
                    txt: "连续搬运设备制造",
                    id: "C3434",
                  },
                  {
                    txt: "电梯、自动扶梯及升降机制造",
                    id: "C3435",
                  },
                  {
                    txt: "客运索道制造",
                    id: "C3436",
                  },
                  {
                    txt: "机械式停车设备制造",
                    id: "C3437",
                  },
                  {
                    txt: "其他物料搬运设备制造",
                    id: "C3439",
                  },
                ],
              },
              {
                txt: "泵、阀门、压缩机及类似机械制造",
                id: "C344",
                child: [{
                    txt: "泵及真空设备制造",
                    id: "C3441",
                  },
                  {
                    txt: "气体压缩机械制造",
                    id: "C3442",
                  },
                  {
                    txt: "阀门和旋塞制造",
                    id: "C3443",
                  },
                  {
                    txt: "液压动力机械及元件制造",
                    id: "C3444",
                  },
                  {
                    txt: "液力动力机械元件制造",
                    id: "C3445",
                  },
                  {
                    txt: "气压动力机械及元件制造",
                    id: "C3446",
                  },
                ],
              },
              {
                txt: "轴承、齿轮和传动部件制造",
                id: "C345",
                child: [{
                    txt: "滚动轴承制造",
                    id: "C3451",
                  },
                  {
                    txt: "滑动轴承制造",
                    id: "C3452",
                  },
                  {
                    txt: "齿轮及齿轮减、变速箱制造",
                    id: "C3453",
                  },
                  {
                    txt: "其他传动部件制造",
                    id: "C3459",
                  },
                ],
              },
              {
                txt: "烘炉、风机、包装等设备制造",
                id: "C346",
                child: [{
                    txt: "烘炉、熔炉及电炉制造",
                    id: "C3461",
                  },
                  {
                    txt: "风机、风扇制造",
                    id: "C3462",
                  },
                  {
                    txt: "气体、液体分离及纯净设备制造",
                    id: "C3463",
                  },
                  {
                    txt: "制冷、空调设备制造",
                    id: "C3464",
                  },
                  {
                    txt: "风动和电动工具制造",
                    id: "C3465",
                  },
                  {
                    txt: "喷枪及类似器具制造",
                    id: "C3466",
                  },
                  {
                    txt: "包装专用设备制造",
                    id: "C3467",
                  },
                ],
              },
              {
                txt: "文化、办公用机械制造",
                id: "C347",
                child: [{
                    txt: "电影机械制造",
                    id: "C3471",
                  },
                  {
                    txt: "幻灯及投影设备制造",
                    id: "C3472",
                  },
                  {
                    txt: "照相机及器材制造",
                    id: "C3473",
                  },
                  {
                    txt: "复印和胶印设备制造",
                    id: "C3474",
                  },
                  {
                    txt: "计算器及货币专用设备制造",
                    id: "C3475",
                  },
                  {
                    txt: "其他文化、办公用机械制造",
                    id: "C3479",
                  },
                ],
              },
              {
                txt: "通用零部件制造",
                id: "C348",
                child: [{
                    txt: "金属密封件制造",
                    id: "C3481",
                  },
                  {
                    txt: "紧固件制造",
                    id: "C3482",
                  },
                  {
                    txt: "弹簧制造",
                    id: "C3483",
                  },
                  {
                    txt: "机械零部件加工",
                    id: "C3484",
                  },
                  {
                    txt: "其他通用零部件制造",
                    id: "C3489",
                  },
                ],
              },
              {
                txt: "其他通用设备制造",
                id: "C349",
                child: [{
                    txt: "工业机器人制造",
                    id: "C3491",
                  },
                  {
                    txt: "特殊作业机器人制造",
                    id: "C3492",
                  },
                  {
                    txt: "增材制造装备制造",
                    id: "C3493",
                  },
                  {
                    txt: "其他未列明通用设备制造业",
                    id: "C3499",
                  },
                ],
              },
              {
                txt: "锅炉及原动设备制造",
                id: "C341",
                child: [{
                    txt: "锅炉及辅助设备制造",
                    id: "C3411",
                  },
                  {
                    txt: "内燃机及配件制造",
                    id: "C3412",
                  },
                  {
                    txt: "汽轮机及辅机制造",
                    id: "C3413",
                  },
                  {
                    txt: "水轮机及辅机制造",
                    id: "C3414",
                  },
                  {
                    txt: "风能原动设备制造",
                    id: "C3415",
                  },
                  {
                    txt: "其他原动设备制造",
                    id: "C3419",
                  },
                ],
              },
            ],
          },
          {
            txt: "仪器仪表制造业",
            id: "C40",
            child: [{
                txt: "通用仪器仪表制造",
                id: "C401",
                child: [{
                    txt: "工业自动控制系统装置制造",
                    id: "C4011",
                  },
                  {
                    txt: "电工仪器仪表制造",
                    id: "C4012",
                  },
                  {
                    txt: "绘图、计算及测量仪器制造",
                    id: "C4013",
                  },
                  {
                    txt: "实验分析仪器制造",
                    id: "C4014",
                  },
                  {
                    txt: "试验机制造",
                    id: "C4015",
                  },
                  {
                    txt: "供应用仪器仪表制造",
                    id: "C4016",
                  },
                  {
                    txt: "其他通用仪器制造",
                    id: "C4019",
                  },
                ],
              },
              {
                txt: "专用仪器仪表制造",
                id: "C402",
                child: [{
                    txt: "环境监测专用仪器仪表制造",
                    id: "C4021",
                  },
                  {
                    txt: "运输设备及生产用计数仪表制造",
                    id: "C4022",
                  },
                  {
                    txt: "导航、测绘、气象及海洋专用仪器制造",
                    id: "C4023",
                  },
                  {
                    txt: "农林牧渔专用仪器仪表制造",
                    id: "C4024",
                  },
                  {
                    txt: "地质勘探和地震专用仪器制造",
                    id: "C4025",
                  },
                  {
                    txt: "教学专用仪器制造",
                    id: "C4026",
                  },
                  {
                    txt: "核子及核辐射测量仪器制造",
                    id: "C4027",
                  },
                  {
                    txt: "电子测量仪器制造",
                    id: "C4028",
                  },
                  {
                    txt: "其他专用仪器制造",
                    id: "C4029",
                  },
                ],
              },
              {
                txt: "钟表与计时仪器制造",
                id: "C403",
                child: [{
                  txt: "钟表与计时仪器制造",
                  id: "C4030",
                }, ],
              },
              {
                txt: "光学仪器制造",
                id: "C404",
                child: [{
                  txt: "光学仪器制造",
                  id: "C4040",
                }, ],
              },
              {
                txt: "衡器制造",
                id: "C405",
                child: [{
                  txt: "衡器制造",
                  id: "C4050",
                }, ],
              },
              {
                txt: "其他仪器仪表制造业",
                id: "C409",
                child: [{
                  txt: "其他仪器仪表制造业",
                  id: "C4090",
                }, ],
              },
            ],
          },
          {
            txt: "其他制造业",
            id: "C41",
            child: [{
                txt: "日用杂品制造",
                id: "C411",
                child: [{
                    txt: "鬃毛加工、制刷及清扫工具制造",
                    id: "C4111",
                  },
                  {
                    txt: "其他日用杂品制造",
                    id: "C4119",
                  },
                ],
              },
              {
                txt: "核辐射加工",
                id: "C412",
                child: [{
                  txt: "核辐射加工",
                  id: "C4120",
                }, ],
              },
              {
                txt: "其他未列明制造业",
                id: "C419",
                child: [{
                  txt: "其他未列明制造业",
                  id: "C4190",
                }, ],
              },
            ],
          },
          {
            txt: "废弃资源综合利用业",
            id: "C42",
            child: [{
                txt: "金属废料和碎屑加工处理",
                id: "C421",
                child: [{
                  txt: "金属废料和碎屑加工处理",
                  id: "C4210",
                }, ],
              },
              {
                txt: "非金属废料和碎屑加工处理",
                id: "C422",
                child: [{
                  txt: "非金属废料和碎屑加工处理",
                  id: "C4220",
                }, ],
              },
            ],
          },
          {
            txt: "金属制品、机械和设备修理业",
            id: "C43",
            child: [{
                txt: "金属制品修理",
                id: "C431",
                child: [{
                  txt: "金属制品修理",
                  id: "C4310",
                }, ],
              },
              {
                txt: "通用设备修理",
                id: "C432",
                child: [{
                  txt: "通用设备修理",
                  id: "C4320",
                }, ],
              },
              {
                txt: "专用设备修理",
                id: "C433",
                child: [{
                  txt: "专用设备修理",
                  id: "C4330",
                }, ],
              },
              {
                txt: "铁路、船舶、航空航天等运输设备修理",
                id: "C434",
                child: [{
                    txt: "铁路运输设备修理",
                    id: "C4341",
                  },
                  {
                    txt: "船舶修理",
                    id: "C4342",
                  },
                  {
                    txt: "航空航天器修理",
                    id: "C4343",
                  },
                  {
                    txt: "其他运输设备修理",
                    id: "C4349",
                  },
                ],
              },
              {
                txt: "电气设备修理",
                id: "C435",
                child: [{
                  txt: "电气设备修理",
                  id: "C4350",
                }, ],
              },
              {
                txt: "仪器仪表修理",
                id: "C436",
                child: [{
                  txt: "仪器仪表修理",
                  id: "C4360",
                }, ],
              },
              {
                txt: "其他机械和设备修理业",
                id: "C439",
                child: [{
                  txt: "其他机械和设备修理业",
                  id: "C4390",
                }, ],
              },
            ],
          },
          {
            txt: "农副食品加工业",
            id: "C13",
            child: [{
                txt: "谷物磨制",
                id: "C131",
                child: [{
                    txt: "稻谷加工",
                    id: "C1311",
                  },
                  {
                    txt: "小麦加工",
                    id: "C1312",
                  },
                  {
                    txt: "玉米加工",
                    id: "C1313",
                  },
                  {
                    txt: "杂粮加工",
                    id: "C1314",
                  },
                  {
                    txt: "其他谷物磨制",
                    id: "C1319",
                  },
                ],
              },
              {
                txt: "饲料加工",
                id: "C132",
                child: [{
                    txt: "宠物饲料加工",
                    id: "C1321",
                  },
                  {
                    txt: "其他饲料加工",
                    id: "C1329",
                  },
                ],
              },
              {
                txt: "植物油加工",
                id: "C133",
                child: [{
                    txt: "食用植物油加工",
                    id: "C1331",
                  },
                  {
                    txt: "非食用植物油加工",
                    id: "C1332",
                  },
                ],
              },
              {
                txt: "制糖业",
                id: "C134",
                child: [{
                  txt: "制糖业",
                  id: "C1340",
                }, ],
              },
              {
                txt: "屠宰及肉类加工",
                id: "C135",
                child: [{
                    txt: "牲畜屠宰",
                    id: "C1351",
                  },
                  {
                    txt: "禽类屠宰",
                    id: "C1352",
                  },
                  {
                    txt: "肉制品及副产品加工",
                    id: "C1353",
                  },
                ],
              },
              {
                txt: "水产品加工",
                id: "C136",
                child: [{
                    txt: "水产品冷冻加工",
                    id: "C1361",
                  },
                  {
                    txt: "鱼糜制品及水产品干腌制加工",
                    id: "C1362",
                  },
                  {
                    txt: "鱼油提取及制品制造",
                    id: "C1363",
                  },
                  {
                    txt: "其他水产品加工",
                    id: "C1369",
                  },
                ],
              },
              {
                txt: "蔬菜、菌类、水果和坚果加工",
                id: "C137",
                child: [{
                    txt: "蔬菜加工",
                    id: "C1371",
                  },
                  {
                    txt: "食用菌加工",
                    id: "C1372",
                  },
                  {
                    txt: "水果和坚果加工",
                    id: "C1373",
                  },
                ],
              },
              {
                txt: "其他农副食品加工",
                id: "C139",
                child: [{
                    txt: "淀粉及淀粉制品制造",
                    id: "C1391",
                  },
                  {
                    txt: "豆制品制造",
                    id: "C1392",
                  },
                  {
                    txt: "蛋品加工",
                    id: "C1393",
                  },
                  {
                    txt: "其他未列明农副食品加工",
                    id: "C1399",
                  },
                ],
              },
            ],
          },
          {
            txt: "食品制造业",
            id: "C14",
            child: [{
                txt: "焙烤食品制造",
                id: "C141",
                child: [{
                    txt: "糕点、面包制造",
                    id: "C1411",
                  },
                  {
                    txt: "饼干及其他焙烤食品制造",
                    id: "C1419",
                  },
                ],
              },
              {
                txt: "糖果、巧克力及蜜饯制造",
                id: "C142",
                child: [{
                    txt: "糖果、巧克力制造",
                    id: "C1421",
                  },
                  {
                    txt: "蜜饯制作",
                    id: "C1422",
                  },
                ],
              },
              {
                txt: "方便食品制造",
                id: "C143",
                child: [{
                    txt: "米、面制品制造",
                    id: "C1431",
                  },
                  {
                    txt: "速冻食品制造",
                    id: "C1432",
                  },
                  {
                    txt: "方便面制造",
                    id: "C1433",
                  },
                  {
                    txt: "其他方便食品制造",
                    id: "C1439",
                  },
                ],
              },
              {
                txt: "乳制品制造",
                id: "C144",
                child: [{
                    txt: "液体乳制造",
                    id: "C1441",
                  },
                  {
                    txt: "乳粉制造",
                    id: "C1442",
                  },
                  {
                    txt: "其他乳制品制造",
                    id: "C1449",
                  },
                ],
              },
              {
                txt: "罐头食品制造",
                id: "C145",
                child: [{
                    txt: "肉、禽类罐头制造",
                    id: "C1451",
                  },
                  {
                    txt: "水产品罐头制造",
                    id: "C1452",
                  },
                  {
                    txt: "蔬菜、水果罐头制造",
                    id: "C1453",
                  },
                  {
                    txt: "其他罐头食品制造",
                    id: "C1459",
                  },
                ],
              },
              {
                txt: "调味品、发酵制品制造",
                id: "C146",
                child: [{
                    txt: "味精制造",
                    id: "C1461",
                  },
                  {
                    txt: "酱油、食醋及类似制品制造",
                    id: "C1462",
                  },
                  {
                    txt: "其他调味品、发酵制品制造",
                    id: "C1469",
                  },
                ],
              },
              {
                txt: "其他食品制造",
                id: "C149",
                child: [{
                    txt: "营养食品制造",
                    id: "C1491",
                  },
                  {
                    txt: "保健食品制造",
                    id: "C1492",
                  },
                  {
                    txt: "冷冻饮品及食用冰制造",
                    id: "C1493",
                  },
                  {
                    txt: "盐加工",
                    id: "C1494",
                  },
                  {
                    txt: "食品及饲料添加剂制造",
                    id: "C1495",
                  },
                  {
                    txt: "其他未列明食品制造",
                    id: "C1499",
                  },
                ],
              },
            ],
          },
          {
            txt: "酒、饮料和精制茶制造业",
            id: "C15",
            child: [{
                txt: "酒的制造",
                id: "C151",
                child: [{
                    txt: "酒精制造",
                    id: "C1511",
                  },
                  {
                    txt: "白酒制造",
                    id: "C1512",
                  },
                  {
                    txt: "啤酒制造",
                    id: "C1513",
                  },
                  {
                    txt: "黄酒制造",
                    id: "C1514",
                  },
                  {
                    txt: "葡萄酒制造",
                    id: "C1515",
                  },
                  {
                    txt: "其他酒制造",
                    id: "C1519",
                  },
                ],
              },
              {
                txt: "饮料制造",
                id: "C152",
                child: [{
                    txt: "碳酸饮料制造",
                    id: "C1521",
                  },
                  {
                    txt: "瓶（罐）装饮用水制造",
                    id: "C1522",
                  },
                  {
                    txt: "果菜汁及果菜汁饮料制造",
                    id: "C1523",
                  },
                  {
                    txt: "含乳饮料和植物蛋白饮料制造",
                    id: "C1524",
                  },
                  {
                    txt: "固体饮料制造",
                    id: "C1525",
                  },
                  {
                    txt: "茶饮料及其他饮料制造",
                    id: "C1529",
                  },
                ],
              },
              {
                txt: "精制茶加工",
                id: "C153",
                child: [{
                  txt: "精制茶加工",
                  id: "C1530",
                }, ],
              },
            ],
          },
          {
            txt: "烟草制品业",
            id: "C16",
            child: [{
                txt: "烟叶复烤",
                id: "C161",
                child: [{
                  txt: "烟叶复烤",
                  id: "C1610",
                }, ],
              },
              {
                txt: "卷烟制造",
                id: "C162",
                child: [{
                  txt: "卷烟制造",
                  id: "C1620",
                }, ],
              },
              {
                txt: "其他烟草制品制造",
                id: "C169",
                child: [{
                  txt: "其他烟草制品制造",
                  id: "C1690",
                }, ],
              },
            ],
          },
          {
            txt: "纺织业",
            id: "C17",
            child: [{
                txt: "丝绢纺织及印染精加工",
                id: "C174",
                child: [{
                    txt: "缫丝加工",
                    id: "C1741",
                  },
                  {
                    txt: "绢纺和丝织加工",
                    id: "C1742",
                  },
                  {
                    txt: "丝印染精加工",
                    id: "C1743",
                  },
                ],
              },
              {
                txt: "化纤织造及印染精加工",
                id: "C175",
                child: [{
                    txt: "化纤织造加工",
                    id: "C1751",
                  },
                  {
                    txt: "化纤织物染整精加工",
                    id: "C1752",
                  },
                ],
              },
              {
                txt: "针织或钩针编织物及其制品制造",
                id: "C176",
                child: [{
                    txt: "针织或钩针编织物织造",
                    id: "C1761",
                  },
                  {
                    txt: "针织或钩针编织物印染精加工",
                    id: "C1762",
                  },
                  {
                    txt: "针织或钩针编织品制造",
                    id: "C1763",
                  },
                ],
              },
              {
                txt: "家用纺织制成品制造",
                id: "C177",
                child: [{
                    txt: "床上用品制造",
                    id: "C1771",
                  },
                  {
                    txt: "毛巾类制品制造",
                    id: "C1772",
                  },
                  {
                    txt: "窗帘、布艺类产品制造",
                    id: "C1773",
                  },
                  {
                    txt: "其他家用纺织制成品制造",
                    id: "C1779",
                  },
                ],
              },
              {
                txt: "产业用纺织制成品制造",
                id: "C178",
                child: [{
                    txt: "非织造布制造",
                    id: "C1781",
                  },
                  {
                    txt: "绳、索、缆制造",
                    id: "C1782",
                  },
                  {
                    txt: "纺织带和帘子布制造",
                    id: "C1783",
                  },
                  {
                    txt: "篷、帆布制造",
                    id: "C1784",
                  },
                  {
                    txt: "其他产业用纺织制成品制造",
                    id: "C1789",
                  },
                ],
              },
              {
                txt: "棉纺织及印染精加工",
                id: "C171",
                child: [{
                    txt: "棉纺纱加工",
                    id: "C1711",
                  },
                  {
                    txt: "棉织造加工",
                    id: "C1712",
                  },
                  {
                    txt: "棉印染精加工",
                    id: "C1713",
                  },
                ],
              },
              {
                txt: "毛纺织及染整精加工",
                id: "C172",
                child: [{
                    txt: "毛条和毛纱线加工",
                    id: "C1721",
                  },
                  {
                    txt: "毛织造加工",
                    id: "C1722",
                  },
                  {
                    txt: "毛染整精加工",
                    id: "C1723",
                  },
                ],
              },
              {
                txt: "麻纺织及染整精加工",
                id: "C173",
                child: [{
                    txt: "麻纤维纺前加工和纺纱",
                    id: "C1731",
                  },
                  {
                    txt: "麻织造加工",
                    id: "C1732",
                  },
                  {
                    txt: "麻染整精加工",
                    id: "C1733",
                  },
                ],
              },
            ],
          },
        ],
      },
      {
        txt: "电力、热力、燃气及水生产和供应业",
        id: "D",
        child: [{
            txt: "电力、热力生产和供应业",
            id: "D44",
            child: [{
                txt: "电力生产",
                id: "D441",
                child: [{
                    txt: "火力发电",
                    id: "D4411",
                  },
                  {
                    txt: "热电联产",
                    id: "D4412",
                  },
                  {
                    txt: "水力发电",
                    id: "D4413",
                  },
                  {
                    txt: "核力发电",
                    id: "D4414",
                  },
                  {
                    txt: "风力发电",
                    id: "D4415",
                  },
                  {
                    txt: "太阳能发电",
                    id: "D4416",
                  },
                  {
                    txt: "生物质能发电",
                    id: "D4417",
                  },
                  {
                    txt: "其他电力生产",
                    id: "D4419",
                  },
                ],
              },
              {
                txt: "电力供应",
                id: "D442",
                child: [{
                  txt: "电力供应",
                  id: "D4420",
                }, ],
              },
              {
                txt: "热力生产和供应",
                id: "D443",
                child: [{
                  txt: "热力生产和供应",
                  id: "D4430",
                }, ],
              },
            ],
          },
          {
            txt: "燃气生产和供应业",
            id: "D45",
            child: [{
                txt: "燃气生产和供应业",
                id: "D451",
                child: [{
                    txt: "天然气生产和供应业",
                    id: "D4511",
                  },
                  {
                    txt: "液化石油气生产和供应业",
                    id: "D4512",
                  },
                  {
                    txt: "煤气生产和供应业",
                    id: "D4513",
                  },
                ],
              },
              {
                txt: "生物质燃气生产和供应业",
                id: "D452",
                child: [{
                  txt: "生物质燃气生产和供应业",
                  id: "D4520",
                }, ],
              },
            ],
          },
          {
            txt: "水的生产和供应业",
            id: "D46",
            child: [{
                txt: "自来水生产和供应",
                id: "D461",
                child: [{
                  txt: "自来水生产和供应",
                  id: "D4610",
                }, ],
              },
              {
                txt: "污水处理及其再生利用",
                id: "D462",
                child: [{
                  txt: "污水处理及其再生利用",
                  id: "D4620",
                }, ],
              },
              {
                txt: "海水淡化处理",
                id: "D463",
                child: [{
                  txt: "海水淡化处理",
                  id: "D4630",
                }, ],
              },
              {
                txt: "其他水的处理、利用与分配",
                id: "D469",
                child: [{
                  txt: "其他水的处理、利用与分配",
                  id: "D4690",
                }, ],
              },
            ],
          },
        ],
      },
      {
        txt: "建筑业",
        id: "E",
        child: [{
            txt: "房屋建筑业",
            id: "E47",
            child: [{
                txt: "住宅房屋建筑",
                id: "E471",
                child: [{
                  txt: "住宅房屋建筑",
                  id: "E4710",
                }, ],
              },
              {
                txt: "体育场馆建筑",
                id: "E472",
                child: [{
                  txt: "体育场馆建筑",
                  id: "E4720",
                }, ],
              },
              {
                txt: "其他房屋建筑业",
                id: "E479",
                child: [{
                  txt: "其他房屋建筑业",
                  id: "E4790",
                }, ],
              },
            ],
          },
          {
            txt: "土木工程建筑业",
            id: "E48",
            child: [{
                txt: "铁路、道路、隧道和桥梁工程建筑",
                id: "E481",
                child: [{
                    txt: "铁路工程建筑",
                    id: "E4811",
                  },
                  {
                    txt: "公路工程建筑",
                    id: "E4812",
                  },
                  {
                    txt: "市政道路工程建筑",
                    id: "E4813",
                  },
                  {
                    txt: "城市轨道交通工程建筑",
                    id: "E4814",
                  },
                  {
                    txt: "其他道路、隧道和桥梁工程建筑",
                    id: "E4819",
                  },
                ],
              },
              {
                txt: "水利和水运工程建筑",
                id: "E482",
                child: [{
                    txt: "水源及供水设施工程建筑",
                    id: "E4821",
                  },
                  {
                    txt: "河湖治理及防洪设施工程建筑",
                    id: "E4822",
                  },
                  {
                    txt: "港口及航运设施工程建筑",
                    id: "E4823",
                  },
                ],
              },
              {
                txt: "海洋工程建筑",
                id: "E483",
                child: [{
                    txt: "海洋油气资源开发利用工程建筑",
                    id: "E4831",
                  },
                  {
                    txt: "海洋能源开发利用工程建筑",
                    id: "E4832",
                  },
                  {
                    txt: "海底隧道工程建筑",
                    id: "E4833",
                  },
                  {
                    txt: "海底设施铺设工程建筑",
                    id: "E4834",
                  },
                  {
                    txt: "其他海洋工程建筑",
                    id: "E4839",
                  },
                ],
              },
              {
                txt: "工矿工程建筑",
                id: "E484",
                child: [{
                  txt: "工矿工程建筑",
                  id: "E4840",
                }, ],
              },
              {
                txt: "架线和管道工程建筑",
                id: "E485",
                child: [{
                    txt: "架线及设备工程建筑",
                    id: "E4851",
                  },
                  {
                    txt: "管道工程建筑",
                    id: "E4852",
                  },
                  {
                    txt: "地下综合管廊工程建筑",
                    id: "E4853",
                  },
                ],
              },
              {
                txt: "节能环保工程施工",
                id: "E486",
                child: [{
                    txt: "节能工程施工",
                    id: "E4861",
                  },
                  {
                    txt: "环保工程施工",
                    id: "E4862",
                  },
                  {
                    txt: "生态保护工程施工",
                    id: "E4863",
                  },
                ],
              },
              {
                txt: "电力工程施工",
                id: "E487",
                child: [{
                    txt: "火力发电工程施工",
                    id: "E4871",
                  },
                  {
                    txt: "水力发电工程施工",
                    id: "E4872",
                  },
                  {
                    txt: "核电工程施工",
                    id: "E4873",
                  },
                  {
                    txt: "风能发电工程施工",
                    id: "E4874",
                  },
                  {
                    txt: "太阳能发电工程施工",
                    id: "E4875",
                  },
                  {
                    txt: "其他电力工程施工",
                    id: "E4879",
                  },
                ],
              },
              {
                txt: "其他土木工程建筑",
                id: "E489",
                child: [{
                    txt: "园林绿化工程施工",
                    id: "E4891",
                  },
                  {
                    txt: "体育场地设施工程施工",
                    id: "E4892",
                  },
                  {
                    txt: "游乐设施工程施工",
                    id: "E4893",
                  },
                  {
                    txt: "其他土木工程建筑施工",
                    id: "E4899",
                  },
                ],
              },
            ],
          },
          {
            txt: "建筑安装业",
            id: "E49",
            child: [{
                txt: "电气安装",
                id: "E491",
                child: [{
                  txt: "电气安装",
                  id: "E4910",
                }, ],
              },
              {
                txt: "管道和设备安装",
                id: "E492",
                child: [{
                  txt: "管道和设备安装",
                  id: "E4920",
                }, ],
              },
              {
                txt: "其他建筑安装业",
                id: "E499",
                child: [{
                    txt: "体育场地设施安装",
                    id: "E4991",
                  },
                  {
                    txt: "其他建筑安装",
                    id: "E4999",
                  },
                ],
              },
            ],
          },
          {
            txt: "建筑装饰、装修和其他建筑业",
            id: "E50",
            child: [{
                txt: "建筑装饰和装修业",
                id: "E501",
                child: [{
                    txt: "公共建筑装饰和装修",
                    id: "E5011",
                  },
                  {
                    txt: "住宅装饰和装修",
                    id: "E5012",
                  },
                  {
                    txt: "建筑幕墙装饰和装修",
                    id: "E5013",
                  },
                ],
              },
              {
                txt: "建筑物拆除和场地准备活动",
                id: "E502",
                child: [{
                    txt: "建筑物拆除活动",
                    id: "E5021",
                  },
                  {
                    txt: "场地准备活动",
                    id: "E5022",
                  },
                ],
              },
              {
                txt: "提供施工设备服务",
                id: "E503",
                child: [{
                  txt: "提供施工设备服务",
                  id: "E5030",
                }, ],
              },
              {
                txt: "其他未列明建筑业",
                id: "E509",
                child: [{
                  txt: "其他未列明建筑业",
                  id: "E5090",
                }, ],
              },
            ],
          },
        ],
      },
      {
        txt: "批发和零售业",
        id: "F",
        child: [{
            txt: "批发业",
            id: "F51",
            child: [{
                txt: "农、林、牧、渔产品批发",
                id: "F511",
                child: [{
                    txt: "谷物、豆及薯类批发",
                    id: "F5111",
                  },
                  {
                    txt: "种子批发",
                    id: "F5112",
                  },
                  {
                    txt: "畜牧渔业饲料批发",
                    id: "F5113",
                  },
                  {
                    txt: "棉、麻批发",
                    id: "F5114",
                  },
                  {
                    txt: "林业产品批发",
                    id: "F5115",
                  },
                  {
                    txt: "牲畜批发",
                    id: "F5116",
                  },
                  {
                    txt: "渔业产品批发",
                    id: "F5117",
                  },
                  {
                    txt: "其他农牧产品批发",
                    id: "F5119",
                  },
                ],
              },
              {
                txt: "食品、饮料及烟草制品批发",
                id: "F512",
                child: [{
                    txt: "米、面制品及食用油批发",
                    id: "F5121",
                  },
                  {
                    txt: "糕点、糖果及糖批发",
                    id: "F5122",
                  },
                  {
                    txt: "果品、蔬菜批发",
                    id: "F5123",
                  },
                  {
                    txt: "肉、禽、蛋、奶及水产品批发",
                    id: "F5124",
                  },
                  {
                    txt: "盐及调味品批发",
                    id: "F5125",
                  },
                  {
                    txt: "营养和保健品批发",
                    id: "F5126",
                  },
                  {
                    txt: "酒、饮料及茶叶批发",
                    id: "F5127",
                  },
                  {
                    txt: "烟草制品批发",
                    id: "F5128",
                  },
                  {
                    txt: "其他食品批发",
                    id: "F5129",
                  },
                ],
              },
              {
                txt: "纺织、服装及家庭用品批发",
                id: "F513",
                child: [{
                    txt: "纺织品、针织品及原料批发",
                    id: "F5131",
                  },
                  {
                    txt: "服装批发",
                    id: "F5132",
                  },
                  {
                    txt: "鞋帽批发",
                    id: "F5133",
                  },
                  {
                    txt: "化妆品及卫生用品批发",
                    id: "F5134",
                  },
                  {
                    txt: "厨具卫具及日用杂品批发",
                    id: "F5135",
                  },
                  {
                    txt: "灯具、装饰物品批发",
                    id: "F5136",
                  },
                  {
                    txt: "家用视听设备批发",
                    id: "F5137",
                  },
                  {
                    txt: "日用家电批发",
                    id: "F5138",
                  },
                  {
                    txt: "其他家庭用品批发",
                    id: "F5139",
                  },
                ],
              },
              {
                txt: "文化、体育用品及器材批发",
                id: "F514",
                child: [{
                    txt: "文具用品批发",
                    id: "F5141",
                  },
                  {
                    txt: "体育用品及器材批发",
                    id: "F5142",
                  },
                  {
                    txt: "图书批发",
                    id: "F5143",
                  },
                  {
                    txt: "报刊批发",
                    id: "F5144",
                  },
                  {
                    txt: "音像制品、电子和数字出版物批发",
                    id: "F5145",
                  },
                  {
                    txt: "首饰、工艺品及收藏品批发",
                    id: "F5146",
                  },
                  {
                    txt: "乐器批发",
                    id: "F5147",
                  },
                  {
                    txt: "其他文化用品批发",
                    id: "F5149",
                  },
                ],
              },
              {
                txt: "医药及医疗器材批发",
                id: "F515",
                child: [{
                    txt: "西药批发",
                    id: "F5151",
                  },
                  {
                    txt: "中药批发",
                    id: "F5152",
                  },
                  {
                    txt: "动物用药品批发",
                    id: "F5153",
                  },
                  {
                    txt: "医疗用品及器材批发",
                    id: "F5154",
                  },
                ],
              },
              {
                txt: "矿产品、建材及化工产品批发",
                id: "F516",
                child: [{
                    txt: "煤炭及制品批发",
                    id: "F5161",
                  },
                  {
                    txt: "石油及制品批发",
                    id: "F5162",
                  },
                  {
                    txt: "非金属矿及制品批发",
                    id: "F5163",
                  },
                  {
                    txt: "金属及金属矿批发",
                    id: "F5164",
                  },
                  {
                    txt: "建材批发",
                    id: "F5165",
                  },
                  {
                    txt: "化肥批发",
                    id: "F5166",
                  },
                  {
                    txt: "农药批发",
                    id: "F5167",
                  },
                  {
                    txt: "农用薄膜批发",
                    id: "F5168",
                  },
                  {
                    txt: "其他化工产品批发",
                    id: "F5169",
                  },
                ],
              },
              {
                txt: "机械设备、五金产品及电子产品批发",
                id: "F517",
                child: [{
                    txt: "农业机械批发",
                    id: "F5171",
                  },
                  {
                    txt: "汽车及零配件批发",
                    id: "F5172",
                  },
                  {
                    txt: "摩托车及零配件批发",
                    id: "F5173",
                  },
                  {
                    txt: "五金产品批发",
                    id: "F5174",
                  },
                  {
                    txt: "电气设备批发",
                    id: "F5175",
                  },
                  {
                    txt: "计算机、软件及辅助设备批发",
                    id: "F5176",
                  },
                  {
                    txt: "通讯设备批发",
                    id: "F5177",
                  },
                  {
                    txt: "广播影视设备批发",
                    id: "F5178",
                  },
                  {
                    txt: "其他机械设备及电子产品批发",
                    id: "F5179",
                  },
                ],
              },
              {
                txt: "贸易经纪与代理",
                id: "F518",
                child: [{
                    txt: "贸易代理",
                    id: "F5181",
                  },
                  {
                    txt: "一般物品拍卖",
                    id: "F5182",
                  },
                  {
                    txt: "艺术品、收藏品拍卖",
                    id: "F5183",
                  },
                  {
                    txt: "艺术品代理",
                    id: "F5184",
                  },
                  {
                    txt: "其他贸易经纪与代理",
                    id: "F5189",
                  },
                ],
              },
              {
                txt: "其他批发业",
                id: "F519",
                child: [{
                    txt: "再生物资回收与批发",
                    id: "F5191",
                  },
                  {
                    txt: "宠物食品用品批发",
                    id: "F5192",
                  },
                  {
                    txt: "互联网批发",
                    id: "F5193",
                  },
                  {
                    txt: "其他未列明批发业",
                    id: "F5199",
                  },
                ],
              },
            ],
          },
          {
            txt: "零售业",
            id: "F52",
            child: [{
                txt: "综合零售",
                id: "F521",
                child: [{
                    txt: "百货零售",
                    id: "F5211",
                  },
                  {
                    txt: "超级市场零售",
                    id: "F5212",
                  },
                  {
                    txt: "便利店零售",
                    id: "F5213",
                  },
                  {
                    txt: "其他综合零售",
                    id: "F5219",
                  },
                ],
              },
              {
                txt: "食品、饮料及烟草制品专门零售",
                id: "F522",
                child: [{
                    txt: "粮油零售",
                    id: "F5221",
                  },
                  {
                    txt: "糕点、面包零售",
                    id: "F5222",
                  },
                  {
                    txt: "果品、蔬菜零售",
                    id: "F5223",
                  },
                  {
                    txt: "肉、禽、蛋、奶及水产品零售",
                    id: "F5224",
                  },
                  {
                    txt: "营养和保健品零售",
                    id: "F5225",
                  },
                  {
                    txt: "酒、饮料及茶叶零售",
                    id: "F5226",
                  },
                  {
                    txt: "烟草制品零售",
                    id: "F5227",
                  },
                  {
                    txt: "其他食品零售",
                    id: "F5229",
                  },
                ],
              },
              {
                txt: "纺织、服装及日用品专门零售",
                id: "F523",
                child: [{
                    txt: "纺织品及针织品零售",
                    id: "F5231",
                  },
                  {
                    txt: "服装零售",
                    id: "F5232",
                  },
                  {
                    txt: "鞋帽零售",
                    id: "F5233",
                  },
                  {
                    txt: "化妆品及卫生用品零售",
                    id: "F5234",
                  },
                  {
                    txt: "厨具卫具及日用杂品零售",
                    id: "F5235",
                  },
                  {
                    txt: "钟表、眼镜零售",
                    id: "F5236",
                  },
                  {
                    txt: "箱包零售",
                    id: "F5237",
                  },
                  {
                    txt: "自行车等代步设备零售",
                    id: "F5238",
                  },
                  {
                    txt: "其他日用品零售",
                    id: "F5239",
                  },
                ],
              },
              {
                txt: "文化、体育用品及器材专门零售",
                id: "F524",
                child: [{
                    txt: "文具用品零售",
                    id: "F5241",
                  },
                  {
                    txt: "体育用品及器材零售",
                    id: "F5242",
                  },
                  {
                    txt: "图书、报刊零售",
                    id: "F5243",
                  },
                  {
                    txt: "音像制品、电子和数字出版物零售",
                    id: "F5244",
                  },
                  {
                    txt: "珠宝首饰零售",
                    id: "F5245",
                  },
                  {
                    txt: "工艺美术品及收藏品零售",
                    id: "F5246",
                  },
                  {
                    txt: "乐器零售",
                    id: "F5247",
                  },
                  {
                    txt: "照相器材零售",
                    id: "F5248",
                  },
                  {
                    txt: "其他文化用品零售",
                    id: "F5249",
                  },
                ],
              },
              {
                txt: "医药及医疗器材专门零售",
                id: "F525",
                child: [{
                    txt: "西药零售",
                    id: "F5251",
                  },
                  {
                    txt: "中药零售",
                    id: "F5252",
                  },
                  {
                    txt: "动物用药品零售",
                    id: "F5253",
                  },
                  {
                    txt: "医疗用品及器材零售",
                    id: "F5254",
                  },
                  {
                    txt: "保健辅助治疗器材零售",
                    id: "F5255",
                  },
                ],
              },
              {
                txt: "汽车、摩托车、零配件和燃料及其他动力销售",
                id: "F526",
                child: [{
                    txt: "汽车新车零售",
                    id: "F5261",
                  },
                  {
                    txt: "汽车旧车零售",
                    id: "F5262",
                  },
                  {
                    txt: "汽车零配件零售",
                    id: "F5263",
                  },
                  {
                    txt: "摩托车及零配件零售",
                    id: "F5264",
                  },
                  {
                    txt: "机动车燃油零售",
                    id: "F5265",
                  },
                  {
                    txt: "机动车燃气零售",
                    id: "F5266",
                  },
                  {
                    txt: "机动车充电销售",
                    id: "F5267",
                  },
                ],
              },
              {
                txt: "家用电器及电子产品专门零售",
                id: "F527",
                child: [{
                    txt: "家用视听设备零售",
                    id: "F5271",
                  },
                  {
                    txt: "日用家电零售",
                    id: "F5272",
                  },
                  {
                    txt: "计算机、软件及辅助设备零售",
                    id: "F5273",
                  },
                  {
                    txt: "通信设备零售",
                    id: "F5274",
                  },
                  {
                    txt: "其他电子产品零售",
                    id: "F5279",
                  },
                ],
              },
              {
                txt: "五金、家具及室内装饰材料专门零售",
                id: "F528",
                child: [{
                    txt: "五金零售",
                    id: "F5281",
                  },
                  {
                    txt: "灯具零售",
                    id: "F5282",
                  },
                  {
                    txt: "家具零售",
                    id: "F5283",
                  },
                  {
                    txt: "涂料零售",
                    id: "F5284",
                  },
                  {
                    txt: "卫生洁具零售",
                    id: "F5285",
                  },
                  {
                    txt: "木质装饰材料零售",
                    id: "F5286",
                  },
                  {
                    txt: "陶瓷、石材装饰材料零售",
                    id: "F5287",
                  },
                  {
                    txt: "其他室内装饰材料零售",
                    id: "F5289",
                  },
                ],
              },
              {
                txt: "货摊、无店铺及其他零售业",
                id: "F529",
                child: [{
                    txt: "流动货摊零售",
                    id: "F5291",
                  },
                  {
                    txt: "互联网零售",
                    id: "F5292",
                  },
                  {
                    txt: "邮购及电视、电话零售",
                    id: "F5293",
                  },
                  {
                    txt: "自动售货机零售",
                    id: "F5294",
                  },
                  {
                    txt: "旧货零售",
                    id: "F5295",
                  },
                  {
                    txt: "生活用燃料零售",
                    id: "F5296",
                  },
                  {
                    txt: "宠物食品用品零售",
                    id: "F5297",
                  },
                  {
                    txt: "其他未列明零售业",
                    id: "F5299",
                  },
                ],
              },
            ],
          },
        ],
      },
      {
        txt: "交通运输、仓储和邮政业",
        id: "G",
        child: [{
            txt: "铁路运输业",
            id: "G53",
            child: [{
                txt: "铁路旅客运输",
                id: "G531",
                child: [{
                    txt: "高速铁路旅客运输",
                    id: "G5311",
                  },
                  {
                    txt: "城际铁路旅客运输",
                    id: "G5312",
                  },
                  {
                    txt: "普通铁路旅客运输",
                    id: "G5313",
                  },
                ],
              },
              {
                txt: "铁路货物运输",
                id: "G532",
                child: [{
                  txt: "铁路货物运输",
                  id: "G5320",
                }, ],
              },
              {
                txt: "铁路运输辅助活动",
                id: "G533",
                child: [{
                    txt: "客运火车站",
                    id: "G5331",
                  },
                  {
                    txt: "货运火车站（场）",
                    id: "G5332",
                  },
                  {
                    txt: "铁路运输维护活动",
                    id: "G5333",
                  },
                  {
                    txt: "其他铁路运输辅助活动",
                    id: "G5339",
                  },
                ],
              },
            ],
          },
          {
            txt: "道路运输业",
            id: "G54",
            child: [{
                txt: "城市公共交通运输",
                id: "G541",
                child: [{
                    txt: "公共电汽车客运",
                    id: "G5411",
                  },
                  {
                    txt: "城市轨道交通",
                    id: "G5412",
                  },
                  {
                    txt: "出租车客运",
                    id: "G5413",
                  },
                  {
                    txt: "公共自行车服务",
                    id: "G5414",
                  },
                  {
                    txt: "其他城市公共交通运输",
                    id: "G5419",
                  },
                ],
              },
              {
                txt: "公路旅客运输",
                id: "G542",
                child: [{
                    txt: "长途客运",
                    id: "G5421",
                  },
                  {
                    txt: "旅游客运",
                    id: "G5422",
                  },
                  {
                    txt: "其他公路客运",
                    id: "G5429",
                  },
                ],
              },
              {
                txt: "道路货物运输",
                id: "G543",
                child: [{
                    txt: "普通货物道路运输",
                    id: "G5431",
                  },
                  {
                    txt: "冷藏车道路运输",
                    id: "G5432",
                  },
                  {
                    txt: "集装箱道路运输",
                    id: "G5433",
                  },
                  {
                    txt: "大型货物道路运输",
                    id: "G5434",
                  },
                  {
                    txt: "危险货物道路运输",
                    id: "G5435",
                  },
                  {
                    txt: "邮件包裹道路运输",
                    id: "G5436",
                  },
                  {
                    txt: "城市配送",
                    id: "G5437",
                  },
                  {
                    txt: "搬家运输",
                    id: "G5438",
                  },
                  {
                    txt: "其他道路货物运输",
                    id: "G5439",
                  },
                ],
              },
              {
                txt: "道路运输辅助活动",
                id: "G544",
                child: [{
                    txt: "客运汽车站",
                    id: "G5441",
                  },
                  {
                    txt: "货运枢纽（站）",
                    id: "G5442",
                  },
                  {
                    txt: "公路管理与养护",
                    id: "G5443",
                  },
                  {
                    txt: "其他道路运输辅助活动",
                    id: "G5449",
                  },
                ],
              },
            ],
          },
          {
            txt: "水上运输业",
            id: "G55",
            child: [{
                txt: "水上旅客运输",
                id: "G551",
                child: [{
                    txt: "海上旅客运输",
                    id: "G5511",
                  },
                  {
                    txt: "内河旅客运输",
                    id: "G5512",
                  },
                  {
                    txt: "客运轮渡运输",
                    id: "G5513",
                  },
                ],
              },
              {
                txt: "水上货物运输",
                id: "G552",
                child: [{
                    txt: "远洋货物运输",
                    id: "G5521",
                  },
                  {
                    txt: "沿海货物运输",
                    id: "G5522",
                  },
                  {
                    txt: "内河货物运输",
                    id: "G5523",
                  },
                ],
              },
              {
                txt: "水上运输辅助活动",
                id: "G553",
                child: [{
                    txt: "客运港口",
                    id: "G5531",
                  },
                  {
                    txt: "货运港口",
                    id: "G5532",
                  },
                  {
                    txt: "其他水上运输辅助活动",
                    id: "G5539",
                  },
                ],
              },
            ],
          },
          {
            txt: "航空运输业",
            id: "G56",
            child: [{
                txt: "航空客货运输",
                id: "G561",
                child: [{
                    txt: "航空旅客运输",
                    id: "G5611",
                  },
                  {
                    txt: "航空货物运输",
                    id: "G5612",
                  },
                ],
              },
              {
                txt: "通用航空服务",
                id: "G562",
                child: [{
                    txt: "通用航空生产服务",
                    id: "G5621",
                  },
                  {
                    txt: "观光游览航空服务",
                    id: "G5622",
                  },
                  {
                    txt: "体育航空运动服务",
                    id: "G5623",
                  },
                  {
                    txt: "其他通用航空服务",
                    id: "G5629",
                  },
                ],
              },
              {
                txt: "航空运输辅助活动",
                id: "G563",
                child: [{
                    txt: "机场",
                    id: "G5631",
                  },
                  {
                    txt: "空中交通管理",
                    id: "G5632",
                  },
                  {
                    txt: "其他航空运输辅助活动",
                    id: "G5639",
                  },
                ],
              },
            ],
          },
          {
            txt: "管道运输业",
            id: "G57",
            child: [{
                txt: "海底管道运输",
                id: "G571",
                child: [{
                  txt: "海底管道运输",
                  id: "G5710",
                }, ],
              },
              {
                txt: "陆地管道运输",
                id: "G572",
                child: [{
                  txt: "陆地管道运输",
                  id: "G5720",
                }, ],
              },
            ],
          },
          {
            txt: "多式联运和运输代理业",
            id: "G58",
            child: [{
                txt: "多式联运",
                id: "G581",
                child: [{
                  txt: "多式联运",
                  id: "G5810",
                }, ],
              },
              {
                txt: "运输代理业",
                id: "G582",
                child: [{
                    txt: "货物运输代理",
                    id: "G5821",
                  },
                  {
                    txt: "旅客票务代理",
                    id: "G5822",
                  },
                  {
                    txt: "其他运输代理业",
                    id: "G5829",
                  },
                ],
              },
            ],
          },
          {
            txt: "装卸搬运和仓储业",
            id: "G59",
            child: [{
                txt: "装卸搬运",
                id: "G591",
                child: [{
                  txt: "装卸搬运",
                  id: "G5910",
                }, ],
              },
              {
                txt: "通用仓储",
                id: "G592",
                child: [{
                  txt: "通用仓储",
                  id: "G5920",
                }, ],
              },
              {
                txt: "低温仓储",
                id: "G593",
                child: [{
                  txt: "低温仓储",
                  id: "G5930",
                }, ],
              },
              {
                txt: "危险品仓储",
                id: "G594",
                child: [{
                    txt: "油气仓储",
                    id: "G5941",
                  },
                  {
                    txt: "危险化学品仓储",
                    id: "G5942",
                  },
                  {
                    txt: "其他危险品仓储",
                    id: "G5949",
                  },
                ],
              },
              {
                txt: "谷物、棉花等农产品仓储",
                id: "G595",
                child: [{
                    txt: "谷物仓储",
                    id: "G5951",
                  },
                  {
                    txt: "棉花仓储",
                    id: "G5952",
                  },
                  {
                    txt: "其他农产品仓储",
                    id: "G5959",
                  },
                ],
              },
              {
                txt: "中药材仓储",
                id: "G596",
                child: [{
                  txt: "中药材仓储",
                  id: "G5960",
                }, ],
              },
              {
                txt: "其他仓储业",
                id: "G599",
                child: [{
                  txt: "其他仓储业",
                  id: "G5990",
                }, ],
              },
            ],
          },
          {
            txt: "邮政业",
            id: "G60",
            child: [{
                txt: "邮政基本服务",
                id: "G601",
                child: [{
                  txt: "邮政基本服务",
                  id: "G6010",
                }, ],
              },
              {
                txt: "快递服务",
                id: "G602",
                child: [{
                  txt: "快递服务",
                  id: "G6020",
                }, ],
              },
              {
                txt: "其他寄递服务",
                id: "G609",
                child: [{
                  txt: "其他寄递服务",
                  id: "G6090",
                }, ],
              },
            ],
          },
        ],
      },

      {
        txt: "住宿和餐饮业",
        id: "H",
        child: [{
            txt: "住宿业",
            id: "H61",
            child: [{
                txt: "旅游饭店",
                id: "H611",
                child: [{
                  txt: "旅游饭店",
                  id: "H6110",
                }, ],
              },
              {
                txt: "一般旅馆",
                id: "H612",
                child: [{
                    txt: "经济型连锁酒店",
                    id: "H6121",
                  },
                  {
                    txt: "其他一般旅馆",
                    id: "H6129",
                  },
                ],
              },
              {
                txt: "民宿服务",
                id: "H613",
                child: [{
                  txt: "民宿服务",
                  id: "H6130",
                }, ],
              },
              {
                txt: "露营地服务",
                id: "H614",
                child: [{
                  txt: "露营地服务",
                  id: "H6140",
                }, ],
              },
              {
                txt: "其他住宿业",
                id: "H619",
                child: [{
                  txt: "其他住宿业",
                  id: "H6190",
                }, ],
              },
            ],
          },
          {
            txt: "餐饮业",
            id: "H62",
            child: [{
                txt: "正餐服务",
                id: "H621",
                child: [{
                  txt: "正餐服务",
                  id: "H6210",
                }, ],
              },
              {
                txt: "快餐服务",
                id: "H622",
                child: [{
                  txt: "快餐服务",
                  id: "H6220",
                }, ],
              },
              {
                txt: "饮料及冷饮服务",
                id: "H623",
                child: [{
                    txt: "茶馆服务",
                    id: "H6231",
                  },
                  {
                    txt: "咖啡馆服务",
                    id: "H6232",
                  },
                  {
                    txt: "酒吧服务",
                    id: "H6233",
                  },
                  {
                    txt: "其他饮料及冷饮服务",
                    id: "H6239",
                  },
                ],
              },
              {
                txt: "餐饮配送及外卖送餐服务",
                id: "H624",
                child: [{
                    txt: "餐饮配送服务",
                    id: "H6241",
                  },
                  {
                    txt: "外卖送餐服务",
                    id: "H6242",
                  },
                ],
              },
              {
                txt: "其他餐饮业",
                id: "H629",
                child: [{
                    txt: "小吃服务",
                    id: "H6291",
                  },
                  {
                    txt: "其他未列明餐饮业",
                    id: "H6299",
                  },
                ],
              },
            ],
          },
        ],
      },
      {
        txt: "信息传输、软件和信息技术服务业",
        id: "I",
        child: [{
            txt: "电信、广播电视和卫星传输服务",
            id: "I63",
            child: [{
                txt: "电信",
                id: "I631",
                child: [{
                    txt: "固定电信服务",
                    id: "I6311",
                  },
                  {
                    txt: "移动电信服务",
                    id: "I6312",
                  },
                  {
                    txt: "其他电信服务",
                    id: "I6319",
                  },
                ],
              },
              {
                txt: "广播电视传输服务",
                id: "I632",
                child: [{
                    txt: "有线广播电视传输服务",
                    id: "I6321",
                  },
                  {
                    txt: "无线广播电视传输服务",
                    id: "I6322",
                  },
                ],
              },
              {
                txt: "卫星传输服务",
                id: "I633",
                child: [{
                    txt: "广播电视卫星传输服务",
                    id: "I6331",
                  },
                  {
                    txt: "其他卫星传输服务",
                    id: "I6339",
                  },
                ],
              },
            ],
          },
          {
            txt: "互联网和相关服务",
            id: "I64",
            child: [{
                txt: "互联网接入及相关服务",
                id: "I641",
                child: [{
                  txt: "互联网接入及相关服务",
                  id: "I6410",
                }, ],
              },
              {
                txt: "互联网信息服务",
                id: "I642",
                child: [{
                    txt: "互联网搜索服务",
                    id: "I6421",
                  },
                  {
                    txt: "互联网游戏服务",
                    id: "I6422",
                  },
                  {
                    txt: "互联网其他信息服务",
                    id: "I6429",
                  },
                ],
              },
              {
                txt: "互联网平台",
                id: "I643",
                child: [{
                    txt: "互联网生产服务平台",
                    id: "I6431",
                  },
                  {
                    txt: "互联网生活服务平台",
                    id: "I6432",
                  },
                  {
                    txt: "互联网科技创新平台",
                    id: "I6433",
                  },
                  {
                    txt: "互联网公共服务平台",
                    id: "I6434",
                  },
                  {
                    txt: "其他互联网平台",
                    id: "I6439",
                  },
                ],
              },
              {
                txt: "互联网安全服务",
                id: "I644",
                child: [{
                  txt: "互联网安全服务",
                  id: "I6440",
                }, ],
              },
              {
                txt: "互联网数据服务",
                id: "I645",
                child: [{
                  txt: "互联网数据服务",
                  id: "I6450",
                }, ],
              },
              {
                txt: "其他互联网服务",
                id: "I649",
                child: [{
                  txt: "其他互联网服务",
                  id: "I6490",
                }, ],
              },
            ],
          },
          {
            txt: "软件和信息技术服务业",
            id: "I65",
            child: [{
                txt: "软件开发",
                id: "I651",
                child: [{
                    txt: "基础软件开发",
                    id: "I6511",
                  },
                  {
                    txt: "支撑软件开发",
                    id: "I6512",
                  },
                  {
                    txt: "应用软件开发",
                    id: "I6513",
                  },
                  {
                    txt: "其他软件开发",
                    id: "I6519",
                  },
                ],
              },
              {
                txt: "集成电路设计",
                id: "I652",
                child: [{
                  txt: "集成电路设计",
                  id: "I6520",
                }, ],
              },
              {
                txt: "信息系统集成和物联网技术服务",
                id: "I653",
                child: [{
                    txt: "信息系统集成服务",
                    id: "I6531",
                  },
                  {
                    txt: "物联网技术服务",
                    id: "I6532",
                  },
                ],
              },
              {
                txt: "运行维护服务",
                id: "I654",
                child: [{
                  txt: "运行维护服务",
                  id: "I6540",
                }, ],
              },
              {
                txt: "信息处理和存储支持服务",
                id: "I655",
                child: [{
                  txt: "信息处理和存储支持服务",
                  id: "I6550",
                }, ],
              },
              {
                txt: "信息技术咨询服务",
                id: "I656",
                child: [{
                  txt: "信息技术咨询服务",
                  id: "I6560",
                }, ],
              },
              {
                txt: "数字内容服务",
                id: "I657",
                child: [{
                    txt: "地理遥感信息服务",
                    id: "I6571",
                  },
                  {
                    txt: "动漫、游戏数字内容服务",
                    id: "I6572",
                  },
                  {
                    txt: "其他数字内容服务",
                    id: "I6579",
                  },
                ],
              },
              {
                txt: "其他信息技术服务业",
                id: "I659",
                child: [{
                    txt: "呼叫中心",
                    id: "I6591",
                  },
                  {
                    txt: "其他未列明信息技术服务业",
                    id: "I6599",
                  },
                ],
              },
            ],
          },
        ],
      },
      {
        txt: "金融业",
        id: "J",
        child: [{
            txt: "货币金融服务",
            id: "J66",
            child: [{
                txt: "中央银行服务",
                id: "J661",
                child: [{
                  txt: "中央银行服务",
                  id: "J6610",
                }, ],
              },
              {
                txt: "货币银行服务",
                id: "J662",
                child: [{
                    txt: "商业银行服务",
                    id: "J6621",
                  },
                  {
                    txt: "政策性银行服务",
                    id: "J6622",
                  },
                  {
                    txt: "信用合作社服务",
                    id: "J6623",
                  },
                  {
                    txt: "农村资金互助社服务",
                    id: "J6624",
                  },
                  {
                    txt: "其他货币银行服务",
                    id: "J6629",
                  },
                ],
              },
              {
                txt: "非货币银行服务",
                id: "J663",
                child: [{
                    txt: "金融租赁服务",
                    id: "J6631",
                  },
                  {
                    txt: "财务公司服务 ",
                    id: "J6632",
                  },
                  {
                    txt: "典当",
                    id: "J6633",
                  },
                  {
                    txt: "汽车金融公司服务",
                    id: "J6634",
                  },
                  {
                    txt: "小额贷款公司服务",
                    id: "J6635",
                  },
                  {
                    txt: "消费金融公司服务",
                    id: "J6636",
                  },
                  {
                    txt: "网络借贷服务",
                    id: "J6637",
                  },
                  {
                    txt: "其他非货币银行服务",
                    id: "J6639",
                  },
                ],
              },
              {
                txt: "银行理财服务",
                id: "J664",
                child: [{
                  txt: "银行理财服务",
                  id: "J6640",
                }, ],
              },
              {
                txt: "银行监管服务",
                id: "J665",
                child: [{
                  txt: "银行监管服务",
                  id: "J6650",
                }, ],
              },
            ],
          },
          {
            txt: "资本市场服务",
            id: "J67",
            child: [{
                txt: "证券市场服务",
                id: "J671",
                child: [{
                    txt: "证券市场管理服务",
                    id: "J6711",
                  },
                  {
                    txt: "证券经纪交易服务",
                    id: "J6712",
                  },
                ],
              },
              {
                txt: "公开募集证券投资基金",
                id: "J672",
                child: [{
                  txt: "公开募集证券投资基金",
                  id: "J6720",
                }, ],
              },
              {
                txt: "非公开募集证券投资基金",
                id: "J673",
                child: [{
                    txt: "创业投资基金",
                    id: "J6731",
                  },
                  {
                    txt: "天使投资",
                    id: "J6732",
                  },
                  {
                    txt: "其他非公开募集证券投资基金",
                    id: "J6739",
                  },
                ],
              },
              {
                txt: "期货市场服务",
                id: "J674",
                child: [{
                    txt: "期货市场管理服务",
                    id: "J6741",
                  },
                  {
                    txt: "其他期货市场服务",
                    id: "J6749",
                  },
                ],
              },
              {
                txt: "证券期货监管服务",
                id: "J675",
                child: [{
                  txt: "证券期货监管服务",
                  id: "J6750",
                }, ],
              },
              {
                txt: "资本投资服务",
                id: "J676",
                child: [{
                  txt: "资本投资服务",
                  id: "J6760",
                }, ],
              },
              {
                txt: "其他资本市场服务",
                id: "J679",
                child: [{
                  txt: "其他资本市场服务",
                  id: "J6790",
                }, ],
              },
            ],
          },
          {
            txt: "其他金融业",
            id: "J69",
            child: [{
                txt: "金融信息服务",
                id: "J694",
                child: [{
                  txt: "金融信息服务",
                  id: "J6940",
                }, ],
              },
              {
                txt: "金融资产管理公司",
                id: "J695",
                child: [{
                  txt: "金融资产管理公司",
                  id: "J6950",
                }, ],
              },
              {
                txt: "其他未列明金融业",
                id: "J699",
                child: [{
                    txt: "货币经纪公司服务",
                    id: "J6991",
                  },
                  {
                    txt: "其他未包括金融业",
                    id: "J6999",
                  },
                ],
              },
              {
                txt: "金融信托与管理服务",
                id: "J691",
                child: [{
                    txt: "信托公司",
                    id: "J6911",
                  },
                  {
                    txt: "其他金融信托与管理服务",
                    id: "J6919",
                  },
                ],
              },
              {
                txt: "控股公司服务",
                id: "J692",
                child: [{
                  txt: "控股公司服务",
                  id: "J6920",
                }, ],
              },
              {
                txt: "非金融机构支付服务",
                id: "J693",
                child: [{
                  txt: "非金融机构支付服务",
                  id: "J6930",
                }, ],
              },
            ],
          },
          {
            txt: "保险业",
            id: "J68",
            child: [{
                txt: "保险资产管理",
                id: "J686",
                child: [{
                  txt: "保险资产管理",
                  id: "J6860",
                }, ],
              },
              {
                txt: "保险监管服务",
                id: "J687",
                child: [{
                  txt: "保险监管服务",
                  id: "J6870",
                }, ],
              },
              {
                txt: "其他保险活动",
                id: "J689",
                child: [{
                  txt: "其他保险活动",
                  id: "J6890",
                }, ],
              },
              {
                txt: "人身保险",
                id: "J681",
                child: [{
                    txt: "人寿保险",
                    id: "J6811",
                  },
                  {
                    txt: "年金保险",
                    id: "J6812",
                  },
                  {
                    txt: "健康保险",
                    id: "J6813",
                  },
                  {
                    txt: "意外伤害保险",
                    id: "J6814",
                  },
                ],
              },
              {
                txt: "财产保险",
                id: "J682",
                child: [{
                  txt: "财产保险",
                  id: "J6820",
                }, ],
              },
              {
                txt: "再保险",
                id: "J683",
                child: [{
                  txt: "再保险",
                  id: "J6830",
                }, ],
              },
              {
                txt: "商业养老金",
                id: "J684",
                child: [{
                  txt: "商业养老金",
                  id: "J6840",
                }, ],
              },
              {
                txt: "保险中介服务",
                id: "J685",
                child: [{
                    txt: "保险代理服务",
                    id: "J6852",
                  },
                  {
                    txt: "保险公估服务",
                    id: "J6853",
                  },
                  {
                    txt: "保险经纪服务",
                    id: "J6851",
                  },
                ],
              },
            ],
          },
        ],
      },
      {
        txt: "房地产业",
        id: "K",
        child: [{
          txt: "房地产业",
          id: "K70",
          child: [{
              txt: "房地产开发经营",
              id: "K701",
              child: [{
                txt: "房地产开发经营",
                id: "K7010",
              }, ],
            },
            {
              txt: "物业管理",
              id: "K702",
              child: [{
                txt: "物业管理",
                id: "K7020",
              }, ],
            },
            {
              txt: "房地产中介服务",
              id: "K703",
              child: [{
                txt: "房地产中介服务",
                id: "K7030",
              }, ],
            },
            {
              txt: "房地产租赁经营",
              id: "K704",
              child: [{
                txt: "房地产租赁经营",
                id: "K7040",
              }, ],
            },
            {
              txt: "其他房地产业",
              id: "K709",
              child: [{
                txt: "其他房地产业",
                id: "K7090",
              }, ],
            },
          ],
        }, ],
      },
      {
        txt: "租赁和商务服务业",
        id: "L",
        child: [{
            txt: "租赁业",
            id: "L71",
            child: [{
                txt: "机械设备经营租赁",
                id: "L711",
                child: [{
                    txt: "汽车租赁",
                    id: "L7111"
                  },
                  {
                    txt: "农业机械经营租赁",
                    id: "L7112"
                  },
                  {
                    txt: "建筑工程机械与设备经营租赁",
                    id: "L7113"
                  },
                  {
                    txt: "计算机及通讯设备经营租赁",
                    id: "L7114"
                  },
                  {
                    txt: "医疗设备经营租赁",
                    id: "L7115"
                  },
                  {
                    txt: "其他机械与设备经营租赁",
                    id: "L7119"
                  },
                ],
              },
              {
                txt: "文体设备和用品出租",
                id: "L712",
                child: [{
                    txt: "休闲娱乐用品设备出租",
                    id: "L7121"
                  },
                  {
                    txt: "体育用品设备出租",
                    id: "L7122"
                  },
                  {
                    txt: "文化用品设备出租",
                    id: "L7123"
                  },
                  {
                    txt: "图书出租",
                    id: "L7124"
                  },
                  {
                    txt: "音像制品出租",
                    id: "L7125"
                  },
                  {
                    txt: "其他文体设备和用品出租",
                    id: "L7129"
                  },
                ],
              },
              {
                txt: "日用品出租",
                id: "L713",
                child: [{
                  txt: "日用品出租",
                  id: "L7130"
                }],
              },
            ],
          },
          {
            txt: "商务服务业",
            id: "L72",
            child: [{
                txt: "组织管理服务",
                id: "L721",
                child: [{
                    txt: "企业总部管理",
                    id: "L7211"
                  },
                  {
                    txt: "投资与资产管理",
                    id: "L7212"
                  },
                  {
                    txt: "资源与产权交易服务",
                    id: "L7213"
                  },
                  {
                    txt: "单位后勤管理服务",
                    id: "L7214"
                  },
                  {
                    txt: "农村集体经济组织管理",
                    id: "L7215"
                  },
                  {
                    txt: "其他组织管理服务",
                    id: "L7219"
                  },
                ],
              },
              {
                txt: "综合管理服务",
                id: "L722",
                child: [{
                    txt: "园区管理服务",
                    id: "L7221"
                  },
                  {
                    txt: "商业综合体管理服务",
                    id: "L7222"
                  },
                  {
                    txt: "市场管理服务",
                    id: "L7223"
                  },
                  {
                    txt: "供应链管理服务",
                    id: "L7224"
                  },
                  {
                    txt: "其他综合管理服务",
                    id: "L7229"
                  },
                ],
              },
              {
                txt: "法律服务",
                id: "L723",
                child: [{
                    txt: "律师及相关法律服务",
                    id: "L7231"
                  },
                  {
                    txt: "公证服务",
                    id: "L7232"
                  },
                  {
                    txt: "其他法律服务",
                    id: "L7239"
                  },
                ],
              },
              {
                txt: "咨询与调查",
                id: "L724",
                child: [{
                    txt: "会计、审计及税务服务",
                    id: "L7241"
                  },
                  {
                    txt: "市场调查",
                    id: "L7242"
                  },
                  {
                    txt: "社会经济咨询",
                    id: "L7243"
                  },
                  {
                    txt: "健康咨询",
                    id: "L7244"
                  },
                  {
                    txt: "环保咨询",
                    id: "L7245"
                  },
                  {
                    txt: "体育咨询",
                    id: "L7246"
                  },
                  {
                    txt: "其他专业咨询与调查",
                    id: "L7249"
                  },
                ],
              },
              {
                txt: "广告业",
                id: "L725",
                child: [{
                    txt: "互联网广告服务",
                    id: "L7251"
                  },
                  {
                    txt: "其他广告服务",
                    id: "L7259"
                  },
                ],
              },
              {
                txt: "人力资源服务",
                id: "L726",
                child: [{
                    txt: "公共就业服务",
                    id: "L7261"
                  },
                  {
                    txt: "职业中介服务",
                    id: "L7262"
                  },
                  {
                    txt: "劳务派遣服务",
                    id: "L7263"
                  },
                  {
                    txt: "创业指导服务",
                    id: "L7264"
                  },
                  {
                    txt: "其他人力资源服务",
                    id: "L7269"
                  },
                ],
              },
              {
                txt: "安全保护服务",
                id: "L727",
                child: [{
                    txt: "安全服务",
                    id: "L7271"
                  },
                  {
                    txt: "安全系统监控服务",
                    id: "L7272"
                  },
                  {
                    txt: "其他安全保护服务",
                    id: "L7279"
                  },
                ],
              },
              {
                txt: "会议、展览及相关服务",
                id: "L728",
                child: [{
                    txt: "科技会展服务",
                    id: "L7281"
                  },
                  {
                    txt: "旅游会展服务",
                    id: "L7282"
                  },
                  {
                    txt: "体育会展服务",
                    id: "L7283"
                  },
                  {
                    txt: "文化会展服务",
                    id: "L7284"
                  },
                  {
                    txt: "其他会议、展览及相关服务",
                    id: "L7289"
                  },
                ],
              },
              {
                txt: "其他商务服务业",
                id: "L729",
                child: [{
                    txt: "旅行社及相关服务",
                    id: "L7291"
                  },
                  {
                    txt: "包装服务",
                    id: "L7292"
                  },
                  {
                    txt: "办公服务",
                    id: "L7293"
                  },
                  {
                    txt: "翻译服务",
                    id: "L7294"
                  },
                  {
                    txt: "信用服务",
                    id: "L7295"
                  },
                  {
                    txt: "非融资担保服务",
                    id: "L7296"
                  },
                  {
                    txt: "商务代理代办服务",
                    id: "L7297"
                  },
                  {
                    txt: "票务代理服务",
                    id: "L7298"
                  },
                  {
                    txt: "其他未列明商务服务业",
                    id: "L7299"
                  },
                ],
              },
            ],
          },
        ],
      },

      {
        txt: "科学研究和技术服务业",
        id: "M",
        child: [{
            txt: "研究和试验发展",
            id: "M73",
            child: [{
                txt: "自然科学研究和试验发展",
                id: "M731",
                child: [{
                  txt: "自然科学研究和试验发展",
                  id: "M7310",
                }, ],
              },
              {
                txt: "工程和技术研究和试验发展",
                id: "M732",
                child: [{
                  txt: "工程和技术研究和试验发展",
                  id: "M7320",
                }, ],
              },
              {
                txt: "农业科学研究和试验发展",
                id: "M733",
                child: [{
                  txt: "农业科学研究和试验发展",
                  id: "M7330",
                }, ],
              },
              {
                txt: "医学研究和试验发展",
                id: "M734",
                child: [{
                  txt: "医学研究和试验发展",
                  id: "M7340",
                }, ],
              },
              {
                txt: "社会人文科学研究",
                id: "M735",
                child: [{
                  txt: "社会人文科学研究",
                  id: "M7350",
                }, ],
              },
            ],
          },
          {
            txt: "专业技术服务业",
            id: "M74",
            child: [{
                txt: "气象服务",
                id: "M741",
                child: [{
                  txt: "气象服务",
                  id: "M7410",
                }, ],
              },
              {
                txt: "地震服务",
                id: "M742",
                child: [{
                  txt: "地震服务",
                  id: "M7420",
                }, ],
              },
              {
                txt: "测绘地理信息服务",
                id: "M744",
                child: [{
                    txt: "遥感测绘服务",
                    id: "M7441",
                  },
                  {
                    txt: "其他测绘地理信息服务",
                    id: "M7449",
                  },
                ],
              },
              {
                txt: "质检技术服务",
                id: "M745",
                child: [{
                    txt: "检验检疫服务",
                    id: "M7451",
                  },
                  {
                    txt: "检测服务",
                    id: "M7452",
                  },
                  {
                    txt: "计量服务",
                    id: "M7453",
                  },
                  {
                    txt: "标准化服务",
                    id: "M7454",
                  },
                  {
                    txt: "认证认可服务",
                    id: "M7455",
                  },
                  {
                    txt: "其他质检技术服务",
                    id: "M7459",
                  },
                ],
              },
              {
                txt: "环境与生态监测",
                id: "M746",
                child: [{
                    txt: "环境保护监测",
                    id: "M7461",
                  },
                  {
                    txt: "生态资源监测",
                    id: "M7462",
                  },
                  {
                    txt: "野生动物疫源疫病防控监测",
                    id: "M7463",
                  },
                ],
              },
              {
                txt: "地质勘查",
                id: "M747",
                child: [{
                    txt: "能源矿产地质勘查",
                    id: "M7471",
                  },
                  {
                    txt: "固体矿产地质勘查",
                    id: "M7472",
                  },
                  {
                    txt: "水、二氧化碳等矿产地质勘查",
                    id: "M7473",
                  },
                  {
                    txt: "基础地质勘查",
                    id: "M7474",
                  },
                  {
                    txt: "地质勘查技术服务",
                    id: "M7475",
                  },
                ],
              },
              {
                txt: "工程技术与设计服务",
                id: "M748",
                child: [{
                    txt: "工程管理服务",
                    id: "M7481",
                  },
                  {
                    txt: "工程监理服务",
                    id: "M7482",
                  },
                  {
                    txt: "工程勘察活动",
                    id: "M7483",
                  },
                  {
                    txt: "工程设计活动",
                    id: "M7484",
                  },
                  {
                    txt: "规划设计管理",
                    id: "M7485",
                  },
                  {
                    txt: "土地规划服务",
                    id: "M7486",
                  },
                ],
              },
              {
                txt: "工业与专业设计及其他专业技术服务",
                id: "M749",
                child: [{
                    txt: "工业设计服务",
                    id: "M7491",
                  },
                  {
                    txt: "专业设计服务",
                    id: "M7492",
                  },
                  {
                    txt: "兽医服务",
                    id: "M7493",
                  },
                  {
                    txt: "其他未列明专业技术服务业",
                    id: "M7499",
                  },
                ],
              },
              {
                txt: "海洋服务",
                id: "M743",
                child: [{
                    txt: "海洋气象服务",
                    id: "M7431",
                  },
                  {
                    txt: "海洋环境服务",
                    id: "M7432",
                  },
                  {
                    txt: "其他海洋服务",
                    id: "M7439",
                  },
                ],
              },
            ],
          },
          {
            txt: "科技推广和应用服务",
            id: "M75",
            child: [{
                txt: "技术推广服务",
                id: "M751",
                child: [{
                    txt: "农林牧渔技术推广服务",
                    id: "M7511",
                  },
                  {
                    txt: "生物技术推广服务",
                    id: "M7512",
                  },
                  {
                    txt: "新材料技术推广服务",
                    id: "M7513",
                  },
                  {
                    txt: "节能技术推广服务",
                    id: "M7514",
                  },
                  {
                    txt: "新能源技术推广服务",
                    id: "M7515",
                  },
                  {
                    txt: "环保技术推广服务",
                    id: "M7516",
                  },
                  {
                    txt: "三维（3D)打印技术推广服务",
                    id: "M7517",
                  },
                  {
                    txt: "其他技术推广服务",
                    id: "M7519",
                  },
                ],
              },
              {
                txt: "知识产权服务",
                id: "M752",
                child: [{
                  txt: "知识产权服务",
                  id: "M7520",
                }, ],
              },
              {
                txt: "科技中介服务",
                id: "M753",
                child: [{
                  txt: "科技中介服务",
                  id: "M7530",
                }, ],
              },
              {
                txt: "创业空间服务",
                id: "M754",
                child: [{
                  txt: "创业空间服务",
                  id: "M7540",
                }, ],
              },
              {
                txt: "其他科技推广服务业",
                id: "M759",
                child: [{
                  txt: "其他科技推广服务业",
                  id: "M7590",
                }, ],
              },
            ],
          },
        ],
      },
      {
        txt: "水利、环境和公共设施管理业",
        id: "N",
        child: [{
            txt: "水利管理业",
            id: "N76",
            child: [{
                txt: "防洪除涝设施管理",
                id: "N761",
                child: [{
                  txt: "防洪除涝设施管理",
                  id: "N7610",
                }, ],
              },
              {
                txt: "水资源管理",
                id: "N762",
                child: [{
                  txt: "水资源管理",
                  id: "N7620",
                }, ],
              },
              {
                txt: "天然水收集与分配",
                id: "N763",
                child: [{
                  txt: "天然水收集与分配",
                  id: "N7630",
                }, ],
              },
              {
                txt: "水文服务",
                id: "N764",
                child: [{
                  txt: "水文服务",
                  id: "N7640",
                }, ],
              },
              {
                txt: "其他水利管理业",
                id: "N769",
                child: [{
                  txt: "其他水利管理业",
                  id: "N7690",
                }, ],
              },
            ],
          },
          {
            txt: "生态保护和环境治理业",
            id: "N77",
            child: [{
                txt: "生态保护",
                id: "N771",
                child: [{
                    txt: "自然生态系统保护管理",
                    id: "N7711",
                  },
                  {
                    txt: "自然遗迹保护管理",
                    id: "N7712",
                  },
                  {
                    txt: "野生动物保护",
                    id: "N7713",
                  },
                  {
                    txt: "野生植物保护",
                    id: "N7714",
                  },
                  {
                    txt: "动物园、水族馆管理服务",
                    id: "N7715",
                  },
                  {
                    txt: "植物园管理服务",
                    id: "N7716",
                  },
                  {
                    txt: "其他自然保护",
                    id: "N7719",
                  },
                ],
              },
              {
                txt: "环境治理业",
                id: "N772",
                child: [{
                    txt: "水污染治理",
                    id: "N7721",
                  },
                  {
                    txt: "大气污染治理",
                    id: "N7722",
                  },
                  {
                    txt: "固体废物治理",
                    id: "N7723",
                  },
                  {
                    txt: "危险废物治理",
                    id: "N7724",
                  },
                  {
                    txt: "放射性废物治理",
                    id: "N7725",
                  },
                  {
                    txt: "土壤污染治理与修复服务",
                    id: "N7726",
                  },
                  {
                    txt: "噪声与振动控制服务",
                    id: "N7727",
                  },
                  {
                    txt: "其他污染治理",
                    id: "N7729",
                  },
                ],
              },
            ],
          },
          {
            txt: "公共设施管理业",
            id: "N78",
            child: [{
                txt: "市政设施管理",
                id: "N781",
                child: [{
                  txt: "市政设施管理",
                  id: "N7810",
                }, ],
              },
              {
                txt: "环境卫生管理",
                id: "N782",
                child: [{
                  txt: "环境卫生管理",
                  id: "N7820",
                }, ],
              },
              {
                txt: "城乡市容管理",
                id: "N783",
                child: [{
                  txt: "城乡市容管理",
                  id: "N7830",
                }, ],
              },
              {
                txt: "绿化管理",
                id: "N784",
                child: [{
                  txt: "绿化管理",
                  id: "N7840",
                }, ],
              },
              {
                txt: "城市公园管理",
                id: "N785",
                child: [{
                  txt: "城市公园管理",
                  id: "N7850",
                }, ],
              },
              {
                txt: "游览景区管理",
                id: "N786",
                child: [{
                    txt: "名胜风景区管理",
                    id: "N7861",
                  },
                  {
                    txt: "森林公园管理",
                    id: "N7862",
                  },
                  {
                    txt: "其他游览景区管理",
                    id: "N7869",
                  },
                ],
              },
            ],
          },
          {
            txt: "土地管理业",
            id: "N79",
            child: [{
                txt: "土地整治服务",
                id: "N791",
                child: [{
                  txt: "土地整治服务",
                  id: "N7910",
                }, ],
              },
              {
                txt: "土地调查评估服务",
                id: "N792",
                child: [{
                  txt: "土地调查评估服务",
                  id: "N7920",
                }, ],
              },
              {
                txt: "土地登记服务",
                id: "N793",
                child: [{
                  txt: "土地登记服务",
                  id: "N7930",
                }, ],
              },
              {
                txt: "土地登记代理服务",
                id: "N794",
                child: [{
                  txt: "土地登记代理服务",
                  id: "N7940",
                }, ],
              },
              {
                txt: "其他土地管理服务",
                id: "N799",
                child: [{
                  txt: "其他土地管理服务",
                  id: "N7990",
                }, ],
              },
            ],
          },
        ],
      },
      {
        txt: "居民服务、修理和其他服务业",
        id: "O",
        child: [{
            txt: "居民服务业",
            id: "O80",
            child: [{
                txt: "家庭服务",
                id: "O801",
                child: [{
                  txt: "家庭服务",
                  id: "O8010",
                }, ],
              },
              {
                txt: "托儿所服务",
                id: "O802",
                child: [{
                  txt: "托儿所服务",
                  id: "O8020",
                }, ],
              },
              {
                txt: "洗染服务",
                id: "O803",
                child: [{
                  txt: "洗染服务",
                  id: "O8030",
                }, ],
              },
              {
                txt: "理发及美容服务",
                id: "O804",
                child: [{
                  txt: "理发及美容服务",
                  id: "O8040",
                }, ],
              },
              {
                txt: "洗浴和保健养生服务",
                id: "O805",
                child: [{
                    txt: "洗浴服务",
                    id: "O8051",
                  },
                  {
                    txt: "足浴服务",
                    id: "O8052",
                  },
                  {
                    txt: "养生保健服务",
                    id: "O8053",
                  },
                ],
              },
              {
                txt: "摄影扩印服务",
                id: "O806",
                child: [{
                  txt: "摄影扩印服务",
                  id: "O8060",
                }, ],
              },
              {
                txt: "婚姻服务",
                id: "O807",
                child: [{
                  txt: "婚姻服务",
                  id: "O8070",
                }, ],
              },
              {
                txt: "殡葬服务",
                id: "O808",
                child: [{
                  txt: "殡葬服务",
                  id: "O8080",
                }, ],
              },
              {
                txt: "其他居民服务业",
                id: "O809",
                child: [{
                  txt: "其他居民服务业",
                  id: "O8090",
                }, ],
              },
            ],
          },
          {
            txt: "机动车、电子产品和日用产品修理业",
            id: "O81",
            child: [{
                txt: "汽车、摩托车等修理与维护",
                id: "O811",
                child: [{
                    txt: "汽车修理与维护",
                    id: "O8111",
                  },
                  {
                    txt: "大型车辆装备修理与维护",
                    id: "O8112",
                  },
                  {
                    txt: "摩托车修理与维护",
                    id: "O8113",
                  },
                  {
                    txt: "助动车等修理与维护",
                    id: "O8114",
                  },
                ],
              },
              {
                txt: "计算机和办公设备维修",
                id: "O812",
                child: [{
                    txt: "计算机和辅助设备修理",
                    id: "O8121",
                  },
                  {
                    txt: "通讯设备修理",
                    id: "O8122",
                  },
                  {
                    txt: "其他办公设备维修",
                    id: "O8129",
                  },
                ],
              },
              {
                txt: "家用电器修理",
                id: "O813",
                child: [{
                    txt: "家用电子产品修理",
                    id: "O8131",
                  },
                  {
                    txt: "日用电器修理",
                    id: "O8132",
                  },
                ],
              },
              {
                txt: "其他日用产品修理业",
                id: "O819",
                child: [{
                    txt: "自行车修理",
                    id: "O8191",
                  },
                  {
                    txt: "鞋和皮革修理",
                    id: "O8192",
                  },
                  {
                    txt: "家具和相关物品修理",
                    id: "O8193",
                  },
                  {
                    txt: "其他未列明日用产品修理业",
                    id: "O8199",
                  },
                ],
              },
            ],
          },
          {
            txt: "其他服务业",
            id: "O82",
            child: [{
                txt: "清洁服务",
                id: "O821",
                child: [{
                    txt: "建筑物清洁服务",
                    id: "O8211",
                  },
                  {
                    txt: "其他清洁服务",
                    id: "O8219",
                  },
                ],
              },
              {
                txt: "宠物服务",
                id: "O822",
                child: [{
                    txt: "宠物饲养",
                    id: "O8221",
                  },
                  {
                    txt: "宠物医院服务",
                    id: "O8222",
                  },
                  {
                    txt: "宠物美容服务",
                    id: "O8223",
                  },
                  {
                    txt: "宠物寄托收养服务",
                    id: "O8224",
                  },
                  {
                    txt: "其他宠物服务",
                    id: "O8229",
                  },
                ],
              },
              {
                txt: "其他未列明服务业",
                id: "O829",
                child: [{
                  txt: "其他未列明服务业",
                  id: "O8290",
                }, ],
              },
            ],
          },
        ],
      },
      {
        txt: "教育",
        id: "P",
        child: [{
          txt: "教育",
          id: "P83",
          child: [{
              txt: "学前教育",
              id: "P831",
              child: [{
                txt: "学前教育",
                id: "P8310",
              }, ],
            },
            {
              txt: "初等教育",
              id: "P832",
              child: [{
                  txt: "普通小学教育",
                  id: "P8321",
                },
                {
                  txt: "成人小学教育",
                  id: "P8322",
                },
              ],
            },
            {
              txt: "中等教育",
              id: "P833",
              child: [{
                  txt: "普通初中教育",
                  id: "P8331",
                },
                {
                  txt: "职业初中教育",
                  id: "P8332",
                },
                {
                  txt: "成人初中教育",
                  id: "P8333",
                },
                {
                  txt: "普通高中教育",
                  id: "P8334",
                },
                {
                  txt: "成人高中教育",
                  id: "P8335",
                },
                {
                  txt: "中等职业学校教育",
                  id: "P8336",
                },
              ],
            },
            {
              txt: "高等教育",
              id: "P834",
              child: [{
                  txt: "普通高等教育",
                  id: "P8341",
                },
                {
                  txt: "成人高等教育",
                  id: "P8342",
                },
              ],
            },
            {
              txt: "特殊教育",
              id: "P835",
              child: [{
                txt: "特殊教育",
                id: "P8350",
              }, ],
            },
            {
              txt: "技能培训、教育辅助及其他教育",
              id: "P839",
              child: [{
                  txt: "职业技能培训",
                  id: "P8391",
                },
                {
                  txt: "体校及体育培训",
                  id: "P8392",
                },
                {
                  txt: "文化艺术培训",
                  id: "P8393",
                },
                {
                  txt: "教育辅助服务",
                  id: "P8394",
                },
                {
                  txt: "其他未列明教育",
                  id: "P8399",
                },
              ],
            },
          ],
        }, ],
      },
      {
        txt: "卫生和社会工作",
        id: "Q",
        child: [{
            txt: "卫生",
            id: "Q84",
            child: [{
                txt: "医院",
                id: "Q841",
                child: [{
                    txt: "综合医院",
                    id: "Q8411",
                  },
                  {
                    txt: "中医医院",
                    id: "Q8412",
                  },
                  {
                    txt: "中西医结合医院",
                    id: "Q8413",
                  },
                  {
                    txt: "民族医院",
                    id: "Q8414",
                  },
                  {
                    txt: "专科医院",
                    id: "Q8415",
                  },
                  {
                    txt: "疗养院",
                    id: "Q8416",
                  },
                ],
              },
              {
                txt: "基层医疗卫生服务",
                id: "Q842",
                child: [{
                    txt: "社区卫生服务中心（站）",
                    id: "Q8421",
                  },
                  {
                    txt: "街道卫生院",
                    id: "Q8422",
                  },
                  {
                    txt: "乡镇卫生院",
                    id: "Q8423",
                  },
                  {
                    txt: "村卫生室",
                    id: "Q8424",
                  },
                  {
                    txt: "门诊部（所）",
                    id: "Q8425",
                  },
                ],
              },
              {
                txt: "专业公共卫生服务",
                id: "Q843",
                child: [{
                    txt: "疾病预防控制中心",
                    id: "Q8431",
                  },
                  {
                    txt: "专科疾病防治院（所、站)",
                    id: "Q8432",
                  },
                  {
                    txt: "妇幼保健院（所、站）",
                    id: "Q8433",
                  },
                  {
                    txt: "急救中心（站）服务",
                    id: "Q8434",
                  },
                  {
                    txt: "采供血机构服务",
                    id: "Q8435",
                  },
                  {
                    txt: "计划生育技术服务活动",
                    id: "Q8436",
                  },
                ],
              },
              {
                txt: "其他卫生活动",
                id: "Q849",
                child: [{
                    txt: "健康体检服务",
                    id: "Q8491",
                  },
                  {
                    txt: "临床检验服务",
                    id: "Q8492",
                  },
                  {
                    txt: "其他未列明卫生服务",
                    id: "Q8499",
                  },
                ],
              },
            ],
          },
          {
            txt: "社会工作",
            id: "Q85",
            child: [{
                txt: "提供住宿社会工作",
                id: "Q851",
                child: [{
                    txt: "干部休养所",
                    id: "Q8511",
                  },
                  {
                    txt: "护理机构服务",
                    id: "Q8512",
                  },
                  {
                    txt: "精神康复服务",
                    id: "Q8513",
                  },
                  {
                    txt: "老年人、残疾人养护服务",
                    id: "Q8514",
                  },
                  {
                    txt: "临终关怀服务",
                    id: "Q8515",
                  },
                  {
                    txt: "孤残儿童收养和庇护服务",
                    id: "Q8516",
                  },
                  {
                    txt: "其他提供住宿社会救助",
                    id: "Q8519",
                  },
                ],
              },
              {
                txt: "不提供住宿社会工作",
                id: "Q852",
                child: [{
                    txt: "社会看护与帮助服务",
                    id: "Q8521",
                  },
                  {
                    txt: "康复辅具适配服务",
                    id: "Q8522",
                  },
                  {
                    txt: "其他不提供住宿社会工作",
                    id: "Q8529",
                  },
                ],
              },
            ],
          },
        ],
      },
      {
        txt: "文化、体育和娱乐业",
        id: "R",
        child: [{
            txt: "新闻和出版业",
            id: "R86",
            child: [{
                txt: "新闻业",
                id: "R861",
                child: [{
                  txt: "新闻业",
                  id: "R8610",
                }, ],
              },
              {
                txt: "出版业",
                id: "R862",
                child: [{
                    txt: "图书出版",
                    id: "R8621",
                  },
                  {
                    txt: "报纸出版",
                    id: "R8622",
                  },
                  {
                    txt: "期刊出版",
                    id: "R8623",
                  },
                  {
                    txt: "音像制品出版",
                    id: "R8624",
                  },
                  {
                    txt: "电子出版物出版",
                    id: "R8625",
                  },
                  {
                    txt: "数字出版",
                    id: "R8626",
                  },
                  {
                    txt: "其他出版业",
                    id: "R8629",
                  },
                ],
              },
            ],
          },
          {
            txt: "广播、电视、电影和影视录音制作业",
            id: "R87",
            child: [{
                txt: "广播",
                id: "R871",
                child: [{
                  txt: "广播",
                  id: "R8710",
                }, ],
              },
              {
                txt: "电视",
                id: "R872",
                child: [{
                  txt: "电视",
                  id: "R8720",
                }, ],
              },
              {
                txt: "影视节目制作",
                id: "R873",
                child: [{
                  txt: "影视节目制作",
                  id: "R8730",
                }, ],
              },
              {
                txt: "广播电视集成播控",
                id: "R874",
                child: [{
                  txt: "广播电视集成播控",
                  id: "R8740",
                }, ],
              },
              {
                txt: "电影和广播电视节目发行",
                id: "R875",
                child: [{
                  txt: "电影和广播电视节目发行",
                  id: "R8750",
                }, ],
              },
              {
                txt: "电影放映",
                id: "R876",
                child: [{
                  txt: "电影放映",
                  id: "R8760",
                }, ],
              },
              {
                txt: "录音制作",
                id: "R877",
                child: [{
                  txt: "录音制作",
                  id: "R8770",
                }, ],
              },
            ],
          },
          {
            txt: "文化艺术业",
            id: "R88",
            child: [{
                txt: "文艺创作与表演",
                id: "R881",
                child: [{
                  txt: "文艺创作与表演",
                  id: "R8810",
                }, ],
              },
              {
                txt: "艺术表演场馆",
                id: "R882",
                child: [{
                  txt: "艺术表演场馆",
                  id: "R8820",
                }, ],
              },
              {
                txt: "图书馆与档案馆",
                id: "R883",
                child: [{
                    txt: "图书馆",
                    id: "R8831",
                  },
                  {
                    txt: "档案馆",
                    id: "R8832",
                  },
                ],
              },
              {
                txt: "文物及非物质文化遗产保护",
                id: "R884",
                child: [{
                  txt: "文物及非物质文化遗产保护",
                  id: "R8840",
                }, ],
              },
              {
                txt: "博物馆",
                id: "R885",
                child: [{
                  txt: "博物馆",
                  id: "R8850",
                }, ],
              },
              {
                txt: "烈士陵园、纪念馆",
                id: "R886",
                child: [{
                  txt: "烈士陵园、纪念馆",
                  id: "R8860",
                }, ],
              },
              {
                txt: "群众文体活动",
                id: "R887",
                child: [{
                  txt: "群众文体活动",
                  id: "R8870",
                }, ],
              },
              {
                txt: "其他文化艺术业",
                id: "R889",
                child: [{
                  txt: "其他文化艺术业",
                  id: "R8890",
                }, ],
              },
            ],
          },
          {
            txt: "体育",
            id: "R89",
            child: [{
                txt: "体育组织",
                id: "R891",
                child: [{
                    txt: "体育竞赛组织",
                    id: "R8911",
                  },
                  {
                    txt: "体育保障组织",
                    id: "R8912",
                  },
                  {
                    txt: "其他体育组织",
                    id: "R8919",
                  },
                ],
              },
              {
                txt: "体育场地设施管理",
                id: "R892",
                child: [{
                    txt: "体育场馆管理",
                    id: "R8921",
                  },
                  {
                    txt: "其他体育场地设施管理",
                    id: "R8929",
                  },
                ],
              },
              {
                txt: "健身休闲活动",
                id: "R893",
                child: [{
                  txt: "健身休闲活动",
                  id: "R8930",
                }, ],
              },
              {
                txt: "其他体育",
                id: "R899",
                child: [{
                    txt: "体育中介代理服务",
                    id: "R8991",
                  },
                  {
                    txt: "体育健康服务",
                    id: "R8992",
                  },
                  {
                    txt: "其他未列明体育",
                    id: "R8999",
                  },
                ],
              },
            ],
          },
          {
            txt: "娱乐业",
            id: "R90",
            child: [{
                txt: "彩票活动",
                id: "R904",
                child: [{
                    txt: "体育彩票服务",
                    id: "R9041",
                  },
                  {
                    txt: "福利彩票服务",
                    id: "R9042",
                  },
                  {
                    txt: "其他彩票服务",
                    id: "R9049",
                  },
                ],
              },
              {
                txt: "文化娱乐体育活动和经纪代理服务",
                id: "R905",
                child: [{
                    txt: "文化活动服务",
                    id: "R9051",
                  },
                  {
                    txt: "体育表演服务",
                    id: "R9052",
                  },
                  {
                    txt: "文化娱乐经纪人",
                    id: "R9053",
                  },
                  {
                    txt: "体育经纪人",
                    id: "R9054",
                  },
                  {
                    txt: "其他文化艺术经纪代理",
                    id: "R9059",
                  },
                ],
              },
              {
                txt: "其他娱乐业",
                id: "R909",
                child: [{
                  txt: "其他娱乐业",
                  id: "R9090",
                }, ],
              },
              {
                txt: "室内娱乐活动",
                id: "R901",
                child: [{
                    txt: "歌舞厅娱乐活动",
                    id: "R9011",
                  },
                  {
                    txt: "电子游艺厅娱乐活动",
                    id: "R9012",
                  },
                  {
                    txt: "网吧活动",
                    id: "R9013",
                  },
                  {
                    txt: "其他室内娱乐活动",
                    id: "R9019",
                  },
                ],
              },
              {
                txt: "游乐园",
                id: "R902",
                child: [{
                  txt: "游乐园",
                  id: "R9020",
                }, ],
              },
              {
                txt: "休闲观光活动",
                id: "R903",
                child: [{
                  txt: "休闲观光活动",
                  id: "R9030",
                }, ],
              },
            ],
          },
        ],
      },
      {
        txt: "公共管理、社会保障和社会组织",
        id: "S",
        child: [{
            txt: "中国共产党机关",
            id: "S91",
            child: [{
              txt: "中国共产党机关",
              id: "S910",
              child: [{
                txt: "中国共产党机关",
                id: "S9100",
              }, ],
            }, ],
          },
          {
            txt: "国家机构",
            id: "S92",
            child: [{
                txt: "国家权力机构",
                id: "S921",
                child: [{
                  txt: "国家权力机构",
                  id: "S9210",
                }, ],
              },
              {
                txt: "国家行政机构",
                id: "S922",
                child: [{
                    txt: "综合事务管理机构",
                    id: "S9221",
                  },
                  {
                    txt: "对外事务管理机构",
                    id: "S9222",
                  },
                  {
                    txt: "公共安全管理机构",
                    id: "S9223",
                  },
                  {
                    txt: "社会事务管理机构",
                    id: "S9224",
                  },
                  {
                    txt: "经济事务管理机构",
                    id: "S9225",
                  },
                  {
                    txt: "行政监督检查机构",
                    id: "S9226",
                  },
                ],
              },
              {
                txt: "人民法院和人民检察院",
                id: "S923",
                child: [{
                    txt: "人民法院",
                    id: "S9231",
                  },
                  {
                    txt: "人民检察院",
                    id: "S9232",
                  },
                ],
              },
              {
                txt: "其他国家机构",
                id: "S929",
                child: [{
                    txt: "消防管理机构",
                    id: "S9291",
                  },
                  {
                    txt: "其他未列明国家机构",
                    id: "S9299",
                  },
                ],
              },
            ],
          },
          {
            txt: "人民政协、民主党派",
            id: "S93",
            child: [{
                txt: "人民政协",
                id: "S931",
                child: [{
                  txt: "人民政协",
                  id: "S9310",
                }, ],
              },
              {
                txt: "民主党派",
                id: "S932",
                child: [{
                  txt: "民主党派",
                  id: "S9320",
                }, ],
              },
            ],
          },
          {
            txt: "社会保障",
            id: "S94",
            child: [{
                txt: "基本保险",
                id: "S941",
                child: [{
                    txt: "基本养老保险",
                    id: "S9411",
                  },
                  {
                    txt: "基本医疗保险",
                    id: "S9412",
                  },
                  {
                    txt: "失业保险",
                    id: "S9413",
                  },
                  {
                    txt: "工伤保险",
                    id: "S9414",
                  },
                  {
                    txt: "生育保险",
                    id: "S9415",
                  },
                  {
                    txt: "其他基本保险",
                    id: "S9419",
                  },
                ],
              },
              {
                txt: "补充保险",
                id: "S942",
                child: [{
                  txt: "补充保险",
                  id: "S9420",
                }, ],
              },
              {
                txt: "其他社会保障",
                id: "S949",
                child: [{
                  txt: "其他社会保障",
                  id: "S9490",
                }, ],
              },
            ],
          },
          {
            txt: "群众团体、社会团体和其他成员组织",
            id: "S95",
            child: [{
                txt: "群众团体",
                id: "S951",
                child: [{
                    txt: "工会",
                    id: "S9511",
                  },
                  {
                    txt: "妇联",
                    id: "S9512",
                  },
                  {
                    txt: "共青团",
                    id: "S9513",
                  },
                  {
                    txt: "其他群众团体",
                    id: "S9519",
                  },
                ],
              },
              {
                txt: "社会团体",
                id: "S952",
                child: [{
                    txt: "专业性团体",
                    id: "S9521",
                  },
                  {
                    txt: "行业性团体",
                    id: "S9522",
                  },
                  {
                    txt: "其他社会团体",
                    id: "S9529",
                  },
                ],
              },
              {
                txt: "基金会",
                id: "S953",
                child: [{
                  txt: "基金会",
                  id: "S9530",
                }, ],
              },
              {
                txt: "宗教组织",
                id: "S954",
                child: [{
                    txt: "宗教团体服务",
                    id: "S9541",
                  },
                  {
                    txt: "宗教活动场所服务",
                    id: "S9542",
                  },
                ],
              },
            ],
          },
          {
            txt: "基层群众自治组织及其他组织",
            id: "S96",
            child: [{
                txt: "社区居民自治组织",
                id: "S961",
                child: [{
                  txt: "社区居民自治组织",
                  id: "S9610",
                }, ],
              },
              {
                txt: "村民自治组织",
                id: "S962",
                child: [{
                  txt: "村民自治组织",
                  id: "S9620",
                }, ],
              },
            ],
          },
        ],
      },
      {
        txt: "国际组织",
        id: "T",
        child: [{
          txt: "国际组织",
          id: "T97",
          child: [{
            txt: "国际组织",
            id: "T970",
            child: [{
              txt: "国际组织",
              id: "T9700",
            }, ],
          }, ],
        }, ],
      },
    ],
    checkAcc:[]

  },
  timestampToTime(timestamp) {

    var date = new Date(timestamp); //时间戳为10位需*1000，时间戳为13位的话不需乘1000

    let Y = date.getFullYear() ;

    let M = (date.getMonth() + 1 < 10 ? '0' + (date.getMonth() + 1) : date.getMonth() + 1) ;

    let D = date.getDate();

    let h = date.getHours() + ':';

    let m = date.getMinutes() + ':';

    let s = date.getSeconds();

    return Y + ''+M +''+ D;

  },
  onPopupEvent: function (e) {
    this.setData({
      idCardSelShow: !this.data.idCardSelShow
    });

  },
  onPopupEvent2: function (e) {
    this.setData({
      dateSelShow: !this.data.dateSelShow
    });

  },
  onPopupEvent3: function (e) {
    this.setData({
      validdateSelShow: !this.data.validdateSelShow
    });

  },
  onPopupEvent4: function (e) {
    this.setData({
      accountSelShow: !this.data.accountSelShow
    });

  },
  onPopupEvent5: function (e) {
    this.setData({
      flagSelShow: !this.data.flagSelShow
    });

  },
  onCancel: function (e) {
    this.setData({
      idCardSelShow: !this.data.idCardSelShow,
      validdateSelShow:false,
    });

  },
  onclickBi(){
    this.setData({
      biTypeListShow:true,
    });
  },
  // 选择确认
  confirmIdCard(event) {
    const {
      picker,
      value,
      index
    } = event.detail;
    console.log(value);
    that.setData({
      selectId: value,
      idCardSelShow: !that.data.idCardSelShow,
      'info.remark3':value.id,
      'info.fzrzjzl':value.id,
      'info.fzrzjzlTxt':value.text,

    })
    console.log('this.data.info.remark3',this.data.info.remark3);

  },
  confirmBiType(event) {
    const {
      picker,
      value,
      index
    } = event.detail;
    that.setData({
      biTypeListShow: !that.data.biTypeListShow,
      'info.zczjbz':value.id,
      'info.zczjbzTxt':value.text,
    })

  },
  onCancel2: function (e) {
    this.setData({
      dateSelShow: !this.data.dateSelShow
    });

  },
  confirm2(event) {
if(that.data.dateSelType=='govinExpireDate'){
  that.setData({
    'info.govinExpireDate':this.timestampToTime(event.detail)
    ,'info.yxrq':'固定有效期'
  })
}

if(that.data.dateSelType=='appCertExpireDate'){
  that.setData({
    'info.appCertExpireDate':this.timestampToTime(event.detail)
  })
  }
    that.setData({
      dateSelShow: !that.data.dateSelShow,
      dateSel: this.timestampToTime(event.detail),
    })

  },

  onCancel3: function (e) {
    this.setData({
      validdateSelShow: !this.data.validdateSelShow
    });

  },
  onCancel4: function (e) {
    this.setData({
      accountSelShow: !this.data.accountSelShow
    });

  },
  onCancel5: function (e) {
    this.setData({
      flagSelShow: !this.data.flagSelShow
    });

  },
  confirm4(event) {
    console.log(this.data.accountType[event.detail.value]);
    that.setData({
      accountSelShow: !that.data.accountSelShow,
    
      'info.zhxz':event.detail.value,
      'info.accountNature':this.data.accountType[event.detail.value],
      // 'info.accountFlag':this.data.accountType[event.detail.value]
    })
  },
  confirm5(event) {
    console.log(this.data.accountType[event.detail.value]);
    that.setData({
      flagSelShow: !that.data.flagSelShow,
      'info.zhxz':'',
      accountColumns:this.data.allAccountType[event.detail.value],
      'info.zhbz':event.detail.value,
      // 'info.accountNature':this.data.accountType[event.detail.value],
      'info.accountFlag':this.data.accountType[event.detail.value]
    })
  },
  confirm3(event) {
    if(event.detail.value==='长期'){
      that.setData({
        'info.govinExpireDate':'99991231'
      
      })
    }
    if(event.detail.value==='无有效期'){
      that.setData({
        'info.govinExpireDate':'99991230'
      
      }) 
    }
    if(event.detail.value==='固定有效期'){
      that.setData({
        'info.govinExpireDate':''
      
      })
    }

    that.setData({
      validdateSelShow: !that.data.validdateSelShow,
      validDate: event.detail.value,
'info.yxrq':event.detail.value
    })
  },
  click1() {
    this.setData({
      idCardSelShow: !this.data.idCardSelShow
    });

  },
  click2(e) {
    
    let type= e.currentTarget.dataset.name
    this.setData({
      dateSelType:type,
      dateSelShow: !this.data.dateSelShow
    });

  },
  click3() {
    this.setData({
      validdateSelShow: !this.data.validdateSelShow
    });

  },
  click4() {
    this.setData({
      accountSelShow: !this.data.accountSelShow
    });
  },
  click5() {
    this.setData({
      flagSelShow: !this.data.flagSelShow
    });
  },
  // 行业类型
  selectId4(value) {
    if (this.data.selectTxt === ""||this.data.selectTxt==='请选择') {
      let dic = this.data.dic;
      let r = dic.filter(function (element, index, self) {
     
        return value === element.id;
      });
      if (r.length == 0) {
        return;
      }
      that.setData({
        selectTxt: r[0].txt
      })
    }
  },
  onInput(event) {
    this.setData({
      currentDate: event.detail,
    });
  },
  onChange({
    detail
  }) {
   console.log(this.data.info)
   console.log(detail)
    if(detail){
      this.setData({
        'info.remark1': '1'

      })
    }else{
      this.setData({
        'info.remark1': '0'
      }) 
    }
    this.setData({
      checked: detail
      
    });
  },
  clickType() {
    this.setData({
      showOver: !this.data.showOver
    })
  },
  selectId1C(e) {
    let id = e.currentTarget.dataset.id
    if (id === this.data.selectId1) {
      this.setData({
        selectId1: '',
        selectId2: '',
        selectId3: '',
        selectId4: '',
      })

    } else {
      this.setData({
        selectId1: id
      })
    }
  },
  selectId2C(e) {
    let id = e.currentTarget.dataset.id

    if (id === this.data.selectId2) {
      this.setData({
        selectId2: ''
      })
    } else {
      this.setData({
        selectId2: id
      })
    }
  },
  selectId3C(e) {
    let id = e.currentTarget.dataset.id

    if (id === this.data.selectId3) {
      this.setData({
        selectId3: ''
      })
    } else {
      this.setData({
        selectId3: id
      })
    }
  },
  selectId4C(e) {
    let id = e.currentTarget.dataset.id

    let txt = e.currentTarget.dataset.txt

    if (id === this.data.selectId4) {
      this.setData({
        selectId4: ''
      })
    } else {

      this.setData({
        selectId4: id,
        selectTxt: txt,
        'info.industryType':id
      })
    }
    this.setData({
      showOver: false
    })
  },
  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
    that = this;

    if (options.e015!=undefined&&options.e015!="{}") {
      let e015= JSON.parse(options.e015)
      this.setData({
        shxydm: e015.shxydm,
        zhanghao: e015.zh,
        e015
      })
      that.searchEd()

    }
    console.log('options',options)
    if(options.p1){
      this.setData({
        shxydm: options.p1,
        zhanghao: options.p2,
   
      })
      
      that.searchEd()
    }
  },
  onChange1(event) {
    this.setData({
      checkAcc: event.detail,
    });
  },
  allCheck(){
    this.setData({
      checkAcc: this.data.List.map(item=>{
        return item.name.toString();
      })
    });
  },
  searchEd() {
    return new Promise((resolve, reject) => {
      wx.showLoading({
        title: '查询中',
        mask: true
      })
      let  wdInfo={}
      if(this.data.wdh===''){
          wdInfo=JSON.parse(wx.getStorageSync('wdInfo'))
      }
      if(that.data.e015.wdh!=undefined){
        wdInfo.value =this.data.wdh
      }
      let dataJson = JSON.stringify({
        shxydm: this.data.shxydm,
        zhanghao: this.data.zhanghao,
        jgh:wdInfo.value
      })
      console.log(dataJson);
      let custnameTwo = encr.jiami(dataJson, aeskey) //3段加密
      wx.request({
        url: app.globalData.YTURL + 'appoint/searchInfo.do',
        data: encr.gwRequest(custnameTwo),
        method: 'POST',
        success(res) {
          wx.hideLoading({
            success: (res) => {},
          })
          console.log('res',res);
          if (res.data.head.H_STATUS != '1') {
            wx.showToast({
              title: res.data.head.H_MSG,
              icon: 'none'
            })
            reject({
              err: 0
            });
            return;
          }
          let json = encr.aesDecrypt(res.data.body, aeskey) //解密返回的报文
          console.log('json',json);
          wx.showToast({
            title: '查询成功',
          })
          if(json.industryType!=''){
            
            that.selectId4(json.industryType)
          }
          let a = json
          if(a.remark1==undefined){
            a.remark1=0
          }else{
            a.remark1=json.remark1
          }
          if(a.remark2==undefined){
            a.remark2=''
          }else{
            a.remark2=json.remark2
          }

          if(a.remark3==undefined){
            a.remark3=''
          }else{
            a.remark3=json.remark3
          }

          if(a.remark4==undefined){
            a.remark4=''
          }else{
            a.remark4=json.remark4
          }

          let data4 = that.data.biTypeList;
          a.zczjbzTxt = '';

          data4.forEach((item, index) => {
            if (item.id == a.zczjbz) {
              // this.reg_cap_typeIndex = index;
              a.zczjbzTxt = item.text;
            }
          });
          if(that.data.e015.wdh!=undefined){
            a.zhbzh=that.data.e015.remark21
            a.fzrmc=that.data.e015.remark22
            a.fzrzjzl=that.data.e015.remark23
            a.fzrzjh=that.data.e015.remark24

            a.remark1=that.data.e015.remark1

            a.zhzwm=that.data.e015.zhmc

            a.govinExpireDate=that.data.e015.yyzzyxq
            a.yxrq=that.data.e015.yxrq
            a.liceAppAddr=that.data.e015.zhzcdz
            a.regCptl=that.data.e015.zczj
            a.industryType=that.data.e015.hylb
            // selectId4: id,
            // selectTxt: txt,

            let dic = that.data.dic;
        let r = dic.filter(function (element, index, self) {
        
          return a.industryType === element.id;
        });
        if (r.length != 0) {
          that.setData({
            selectTxt:r[0].txt,
            selectId4:r[0].id
          })
        }
    
            a.custMainBusn=that.data.e015.jyfw
            a.appCertNo=that.data.e015.spwh

            a.appCertExpireDate=that.data.e015.pwyxrq
            a.workTel=that.data.e015.bgdh
            a.posrCd=that.data.e015.yzbm
            a.workAddr=that.data.e015.bgdz
            a.zczjbz=that.data.e015.zczjbz
let data4 = that.data.biTypeList;
a.zczjbzTxt = '';
data4.forEach((item, index) => {
  if (item.id == a.zczjbz) {
    a.zczjbzTxt = item.text;
  }
});
if(a.remark1=='1'){
  a.remark2=that.data.e015.remark2
  a.remark3=that.data.e015.remark3
  a.remark4=that.data.e015.remark4

  that.setData({
    checked:true
  })
}else{
  that.setData({
    checked:false
  }) 
}
          }
   
      let data1 = that.data.cardTypeList;
   
      data1.forEach((item, index) => {
        console.log(item.text);
        if (item.id == a.fzrzjzl) {
         a.fzrzjzlTxt = item.text;
        }
        
        if (item.id == a.remark3) {
          
       that.setData({
        'selectId.text' : item.text
       })
         }
       
      });
          that.setData({
            info: a
          })
        },fail(err){
        }
      })
    })
  },
  watchZhzwm(e) {
    console.log(e.detail.value);
    this.setData({
      'info.zhzwm':e.detail.value
    })
  },
searchArea(e){
  let that = this
  console.log(e.currentTarget.dataset.type);
  // let companyCode =that.data.info.shxydm
  
  // let companyName = that.data.info.zhzwm
  let companyCode = that.data.info.shxydm
  console.log(that.data.info);
  if(that.data.info.zhzwm===''){
    wx.showToast({
      title : '请输入账户名称',
    })
    return;
  }
  
  // type: 1, //1 企业名称  2统一码
  //   // type: e.currentTarget.dataset.type, //1 企业名称  2统一码
  //   companyName,
  //   // companyCode
  Org.getEnterpriseInfo({type: '2', //1 企业名称  2统一码
  companyCode,})
    .then((res) => {
      console.log(res);
      if(res.enterpriseInfo!=''){
        that.setData({
          'info.custMainBusn':res.enterpriseInfo.oPSCOPE,
          'info.zhzwm':res.enterpriseInfo.eNTNAME,
          'info.liceAppAddr':res.enterpriseInfo.dOM,
        })
        console.log(that.info);
      }else{
        wx.showToast({
          title: '查无信息',
          icon:'none'
        })
      }
    })
},
// 提交，前往下一步，表单事件
submitForm(e){

  const params = e.detail.value;
  let info = that.data.info
let wd= JSON.parse(wx.getStorageSync('wdInfo'));
  info.issqjb=params.remark1;
  info.sqjbrmc=params.remark2;
  info.sqjbrzjzl=this.data.info.remark3
  console.log('params.remark3',this.data.info.remark3);
  if (this.data.checked) {
    info.issqjbSelect = true
    info.sqjbrmcSelect = true
    info.sqjbrzjzlSelect = true
    info.sqjbrzjhmSelect = true
  } else {
    info.issqjbSelect = false
    info.sqjbrmcSelect = false
    info.sqjbrzjzlSelect = false
    info.sqjbrzjhmSelect = false
  }
  info.sqjbrzjhm=params.remark4;
  info.zhzwm=params.zhzwm
  info.shxydm=params.shxydm
  info.liceAppAddr=params.liceAppAddr
  info.regCptl=params.regCptl
  info.custMainBusn=params.custMainBusn
  info.appCertNo=params.appCertNo
  info.workTel=params.workTel
  info.posrCd=params.posrCd
  info.workAddr=params.workAddr
  info.zhanghao=that.data.zhanghao
if(wd){
  info.jgh=wd.value
  info.wdh=wd.value
  info.wdmc=wd.JIGOMC
}
if(that.data.e015.wdh!=undefined&&that.data.e015.wdh!=''){
  let wdInfo= {};
  wdInfo.text =that.data.e015.wdmc
  wdInfo.value =that.data.e015.wdh
  wdInfo.JIGOMC =that.data.e015.wdmc

  wdInfo.DIZHII =''
wx.setStorageSync('wdInfo', JSON.stringify(wdInfo))
}
var obj = Object.assign(info, params);
console.log('info',info);
console.log('params',params);
wx.navigateTo({
  url: './person?data='+JSON.stringify(obj)+'&e015='+JSON.stringify(that.data.e015),
})
},
  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})